[
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.1.1",
      "description": "Ask and answer questions about key details in a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: question, answer, literary text, visualize, infer, read closely, before, during, after, key details, predict, infer, draw conclusion"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.1",
      "grade": null,
      "description": "Read closely to determine what the text says explicitly and make logical inferences from it; cite specific textual evidence and when writing or speaking to support conclusions drawn from the text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "There is a difference between a telling sentence and an asking sentence.",
            "Key words (e.g., who, what, when, etc.) signal a question is being asked.",
            "A key detail is a statement in a text that helps the reader better understand what is read.",
            "Identify key words within a question.",
            "How to participate in conversations that are grounded in text.",
            "How to visualize information to ask and answer questions."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Growing readers learn to ask questions before, during, and after reading to gain meaning from what is read.",
            "Growing readers ask and answer questions within the text (right there) to make and clarify meaning.",
            "Growing readers begin to understand that many of their questions may not be answered in the text. They will need to infer using word and picture clues from the text and use the clues to cite evidence from the text.",
            "Growing readers monitor their comprehension in literary text by asking themselves appropriate questions when they read."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Listen to or read a text then ask or answer questions about the characters, setting, and plot (e.g., beginning, middle, end, problem, and solution) of the text using question words (e.g., who, what, when, where, why, and how).",
            "Find the answers to questions about key details in the text regarding narrative elements, and record answers in a variety of formats (e.g., graphic organizer, sticky notes, two column notes, jotting on text).",
            "Use clues in the text to answer inferential questions (e.g., predict, infer, or draw a conclusion) and be able to justify the answer based on the clues."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "question",
        "answer",
        "literary text",
        "visualize",
        "infer",
        "read closely",
        "before",
        "during",
        "after",
        "key details",
        "predict",
        "infer",
        "draw conclusion"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.1.2",
      "description": "Retell stories, including key details, and demonstrate understanding of their central message or lesson. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: detail, lesson, message, retelling, reflect on thinking, narrative text elements, characters, setting, plot, problem and solution"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.2",
      "grade": null,
      "description": "Determine central ideas or themes of a text and analyze their development; summarize the key supporting details and ideas."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to stop and think about one's own thinking when listening to a read aloud or reading independently.",
            "How to identify the major characters, setting, problem, and solution from a text.",
            "How to cite basic story elements within a story to explain thinking.",
            "Details are pieces of information that help the reader understand what they are reading.",
            "How to determine key details for the beginning, middle, and end.",
            "Sometimes authors use a story to teach a lesson."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors write stories that can teach lessons or send a message. This sometimes applies to readers' own lives.",
            "The central message or lesson of a story is something the author is trying to teach in the story.",
            "Often in a story, the characters learn a lesson through their actions.",
            "Retelling a story helps the reader have greater understanding of the story and assists in determining the message or theme.",
            "Readers synthesize key points made by the author to determine the central message or theme."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Provide a retelling of a story, including key details such as what happened at the beginning, middle, and end of the story.",
            "When retelling a story, tell about the character, setting, plot, problem/solution, and/or the message or lesson of a story.",
            "Identify the central message or lesson in a text.",
            "o What did the character learn in the story?"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "detail",
        "lesson",
        "message",
        "retelling",
        "reflect on thinking",
        "narrative text elements",
        "characters",
        "setting",
        "plot",
        "problem and solution"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.1.3",
      "description": "Describe characters, settings, and major events in a story, using key details. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: character, setting, major event, key detail, interactions, traits, describe"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.3",
      "grade": null,
      "description": "Analyze how and why individuals, events, or ideas develop and interact over the course of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify characteristics of a familiar story: characters, a setting, a problem, and a solution.",
            "A character is a person or creature in a story.",
            "A major event is where something important happens in the story.",
            "The setting is when and where a story takes place.",
            "A key detail is a statement in the text that helps the reader understand the text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors provide key details in a story to share information about characters, the setting, and major events.",
            "Growing readers look for key details in a text that help the reader have greater understanding of what is happening in the story.",
            "Growing readers pay attention to the text to see how the author describes a character's feelings, actions, thoughts, and interactions with other characters.",
            "Growing readers analyze and describe the details that impact the major events within the story.",
            "Growing readers look for details that describe the setting of a story."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Describe characters in a story using key details from the story such as how the character feels, what the character looks like, or how the character interacts with other characters.",
            "Describe the setting of a story using key details from text to tell information about the setting such as where and when the story takes place.",
            "Provide a description of the major events in a story using key details by retelling the story in sequence.",
            "Complete a graphic organizer such as a story map.",
            "Describe or graphically represent the characters, setting, and major events in a story using key details."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "character",
        "setting",
        "major event",
        "key detail",
        "interactions",
        "traits",
        "describe"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.1.4",
      "description": "Identify words and phrases in stories or poems that suggest feelings or appeal to the senses. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: words, phrases, feelings, emotions, senses, mental images, infer, draw conclusions, monitor comprehension, poems, figurative language"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.4",
      "grade": null,
      "description": "Interpret words and phrases as they are used in a text, including determining technical, connotative, and figurative meanings, and analyze how specific word choices shape meaning or tone."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Feelings are emotions and attitudes.",
            "How to identify feelings evoked from the text.",
            "How to interpret word context by using picture clues.",
            "How to explain simple figurative language (e.g., simile, metaphor)",
            "The five senses are sight, hear, smell, touch, and taste."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors choose their words carefully to create a piece of writing that appeals to the reader's emotions. Thinking about how characters feel helps the reader make connections to the text.",
            "Growing readers actively seek to make meaning of unknown words and phrases to clarify their understanding.",
            "Authors chose language that creates mental images in the reader's mind to enhance deep understanding."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Recognize that words and phrases have literal and nonliteral meanings.",
            "Identify words and phrases that suggest feelings or emotions using clues from the text.",
            "Use clues from the text to identify words and phrases in stories or poems that appeal to the senses (e.g., sight, touch, taste, smell, and hearing)."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "words",
        "phrases",
        "feelings",
        "emotions",
        "senses",
        "mental images",
        "infer",
        "draw conclusions",
        "monitor comprehension",
        "poems",
        "figurative language"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.1.5",
      "description": "Explain major differences between books that tell stories and books that give information, drawing on a wide reading of a range of text types. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: fiction, literary text, stories, nonfiction, information, informational text, wide reading, story elements, purpose, similar, different"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.5",
      "grade": null,
      "description": "Analyze the structure of texts, including how specific sentences, paragraphs, and larger portions of the text (e.g., a section, chapter, scene, or stanza) relate to each other and the whole."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Fictional texts tell a story about imaginary people and events.",
            "Stories usually are told to entertain, teach a lesson, or send a message.",
            "Types of literary text include poems, fables, fantasy, etc.",
            "Informational texts provide or teach the reader new information.",
            "Informational texts contain text features (e.g., table of contents, headings, captions, diagrams, etc.)",
            "Types of informational or nonfiction text may include articles, lab reports, biographies, etc."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Readers know that books that tell stories contain story elements (e.g., character, setting, events, problem, solution).",
            "Growing readers understand informational texts are meant to teach the reader about new things.",
            "Informational texts contain text features (e.g., photographs, captions, bolded words, etc.), which help the reader understand the author's purpose.",
            "Readers set a purpose for reading that aids in comprehension."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify stories.",
            "Identify informational texts.",
            "Distinguish the difference between fiction and information text.",
            "Explain the major difference between books that tell stories and books that provide information.",
            "Set a purpose for reading based on text type."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "fiction",
        "literary text",
        "stories",
        "nonfiction",
        "information",
        "informational text",
        "wide reading",
        "story elements",
        "purpose",
        "similar",
        "different"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.1.6",
      "description": "Identify who is telling the story at various points in a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: point of view, characters, dialogue, voice, speaker, narrative, background knowledge, determine importance, synthesize"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.6",
      "grade": null,
      "description": "Assess how point of view or purpose shapes the content and style of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "An author's purpose for writing a text affects who is telling the story or what information is shared with the reader.",
            "The difference between literary text and informational text.",
            "The concept of basic author's purpose (e.g., entertain, share information, inform, persuade, describe, explain).",
            "Authors write through the eyes of different characters. This helps them unfold the plot of the story for the reader."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Growing readers learn that the narrator or speaker is the voice that is telling the story.",
            "Growing readers understand that the narrator or speaker in a story sometimes changes. They have to pay attention to whom is telling the story throughout the text.",
            "A narrator/speaker is a person who tells a story that may be in a voice that is different from the characters.",
            "Characters are the people or creatures within the story.",
            "Sometimes authors use characters to tell the story within a text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the narrator in a story.",
            "Identify which character is speaking in specific parts of the story.",
            "Identify when there is a change in which character is telling the story."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "point of view",
        "characters",
        "dialogue",
        "voice",
        "speaker",
        "narrative",
        "background knowledge",
        "determine importance",
        "synthesize"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.1.7",
      "description": "Use illustrations and details in a story to describe its characters, setting, or events. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: illustrations, details, describe, story elements, characters, setting, problem, solution, plot, visual images, predictions, inferences, draw conclusions, events"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.7",
      "grade": null,
      "description": "Integrate and evaluate content presented in diverse media and formats, including visually and quantitatively, as well as in words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to describe the individual story elements (e.g., character, setting, events, problem, solution).",
            "Illustrations can be pictures, drawings, and photographs.",
            "Authors use illustrations to help tell a story.",
            "Illustrations give clues that support the written text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors use illustrations to go beyond the written word.",
            "Illustrations and details help the reader make greater meaning about a story's elements.",
            "Growing readers analyze visual images/illustrations in stories. This helps them to gain a deeper understanding of the text.",
            "Readers use the visual images to assist in making predictions, making inferences, and drawing conclusions about characters, settings, and events"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use pictures to make predictions before and during reading.",
            "Look at a picture to gain meaning about the character, setting, and plot of a story.",
            "Provide a description of characters, setting, or events from a story using illustrations and details from a story.",
            "Describe the relationship between the illustrations and the text.",
            "o What is going on in the picture and what is said in the text …"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "illustrations",
        "details",
        "describe",
        "story elements",
        "characters",
        "setting",
        "problem",
        "solution",
        "plot",
        "visual images",
        "predictions",
        "inferences",
        "draw conclusions",
        "events"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.1.8",
      "description": "Not applicable to literature. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD:"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.8",
      "grade": null,
      "description": "Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as the relevance and sufficiency of the evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": []
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": []
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": []
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.1.9",
      "description": "Compare and contrast the adventures and experiences of characters in stories. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: compare, contrast, similarities, differences, adventures, experiences, characters, story elements, feelings, actions, thoughts"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Comparing is finding similarities between two or more ideas or objects.",
            "Contrasting is finding the differences between two or more ideas or objects.",
            "Characters are the people or creatures in a story.",
            "The plot of the story is defined as the main event or the problem and solution."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors create stories with adventures and experiences for their characters.",
            "Growing readers know stories have a plot (e.g., main events, main problem, and solution).",
            "Knowing these elements of a story, the reader can think about how each story may be alike or different.",
            "Readers think about a character's feelings and actions. Understanding this helps the reader compare and contrast adventures and experiences."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the characters within and between multiple texts.",
            "Identify the plot within and between multiple texts.",
            "Provide a comparison and contrasting of the adventures and experiences of characters in two or more stories.",
            "o Identify the characters in two or more stories.",
            "o Tell how the characters are alike and different.",
            "Describe what happens in each story, and describe what is similar and what is different in each story."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "compare",
        "contrast",
        "similarities",
        "differences",
        "adventures",
        "experiences",
        "characters",
        "story elements",
        "feelings",
        "actions",
        "thoughts"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Literature",
    "reporting_category": "Range of Reading and Level of Text Complexity",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.1.10",
      "description": "With prompting and support, read prose and poetry of appropriate complexity for grade 1. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: monitor thinking, utilize prior knowledge, ask question, visualize information, determine importance, summarize, synthesize, just right text, complex text, literary, informational, variety of genres, comprehension within/beyond the text"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.10",
      "grade": null,
      "description": "Read and comprehend complex literary and informational texts independently and proficiently."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Read text from a variety of text genres.",
            "Text genres refer to the different types of text such as fantasy, realistic fiction, nonfiction, poetry, etc.",
            "Choose appropriate text for independent reading."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Growing readers participate in rich, small- and whole- group readings where they focus on comprehending within and beyond the text.",
            "First grade readers read a variety of literary text types (e.g., poetry, prose, storybooks)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use comprehension strategies to gain deeper understanding of grade appropriate texts in small- group, whole-group, and independent readings, e.g.",
            "o activate relevant background knowledge",
            "o create visual images, draw inferences",
            "o ask questions",
            "o determine important ideas",
            "o synthesize"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "monitor thinking",
        "utilize prior knowledge",
        "ask question",
        "visualize information",
        "determine importance",
        "summarize",
        "synthesize",
        "just right text",
        "complex text",
        "literary",
        "informational",
        "variety of genres",
        "comprehension within/beyond the text"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.1.1",
      "description": "Ask and answer questions about key details in a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: questions, answers, statements, informational texts, key details, clarify, text features, illustrations, background knowledge, inference, wonderings"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.1",
      "grade": null,
      "description": "Read closely to determine what the text says explicitly and make logical inferences from it; cite specific textual evidence and when writing or speaking to support conclusions drawn from the text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Questions often begin with who, what, where, when, and why.",
            "A question is a statement that requests an answer.",
            "Details are pieces of information that clarify information about a topic.",
            "How to, with prompting and support, explain the difference between questions and answers.",
            "How to set a purpose for reading based on the title, cover, and visual images. (Shark book example: \"I think I will learn about sharks.\")"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors include key details in informational texts that give readers ideas of more information they would like to know about.",
            "The details help a reader to ask and find answers to their questions.",
            "Growing readers study the title, cover, illustrations, photographs, and other images to make predictions or ask questions before reading.",
            "Readers use background knowledge to ask questions and make inferences from the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Ask and answer questions that show understanding of the main topic (main idea) and key details (supporting details) in a text.",
            "Generate questions based on key details learned within a text to clarify meaning.",
            "o Who is the text about?",
            "o What is the text about?",
            "o What happened, when, where, how and why did it happened?",
            "o What statements support the main topic (idea)?",
            "Study text and illustration to generate questions and/or answers about wonderings."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "questions",
        "answers",
        "statements",
        "informational texts",
        "key details",
        "clarify",
        "text features",
        "illustrations",
        "background knowledge",
        "inference",
        "wonderings"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.1.2",
      "description": "Identify the main topic and retell key details of a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: main topic, key details, retell, informational text, images, graphics, main idea, supporting details"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.2",
      "grade": null,
      "description": "Determine central ideas or themes of a text and analyze their development; summarize the key supporting details and ideas."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Authors of informational text write about topics. They include key details to help the reader better understand the text.",
            "Describe the difference between the main topic and key details.",
            "Retell or describe details from an informational read aloud.",
            "Types of information texts may include literary nonfiction, informational, technical, etc."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Informational text has a main topic (what the text is mostly about).",
            "The main topic (main idea) is what the text is mostly about.",
            "A key detail is a statement that provides more information about the main topic.",
            "Readers use text and graphic features as sources to identify the main topic and think about key details.",
            "Growing readers take notes using images and words. This helps them to think about what they have learned to generate a retelling on a topic."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the main topic or main idea.",
            "Identify statements that support the main topic or main idea.",
            "Retell the information in the text by giving the main topic (idea) and the key or supporting details in a text.",
            "Participate in a discussion about the main topic in an effort to recall one or more details from the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "main topic",
        "key details",
        "retell",
        "informational text",
        "images",
        "graphics",
        "main idea",
        "supporting details"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.1.3",
      "description": "Describe the connection between two individuals, events, ideas, or pieces of information in a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: connection, individuals, events, ideas, information, relationship, text features, informational text"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.3",
      "grade": null,
      "description": "Analyze how and why individuals, events, or ideas develop and interact over the course of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to use background knowledge and experiences to identify and discuss how personal experiences, ideas, or pieces of information that are the same and/or different from information learned in text.",
            "Informational text teaches the reader about people, places, events, and ideas.",
            "How to use words and phrases acquired through conversations to describe people, events, and ideas.",
            "Text features contained in informational text may include bold words, photographs, captions, etc., and help understanding of a text.",
            "Explain how someone might use informational text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors sometimes make connections between two individuals, events, ideas, or pieces of informational text. This helps their reader make meaning of what they read.",
            "Authors write about real people, events, and ideas in informational writing.",
            "The people, events, and ideas link, relate, or connect together to provide information about a topic."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify and describe the people, events, and ideas in an informational text.",
            "Find a connection, link, or relationship between individuals, events, and ideas in an informational text and how they relate to the main topic (idea).",
            "Discuss how people in an informational text connect or relate to each other and how that relates to the main topic. .",
            "Discuss how events and ideas in an informational text relate or connect to each other and how they relate to the main topic."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "connection",
        "individuals",
        "events",
        "ideas",
        "information",
        "relationship",
        "text features",
        "informational text"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.1.4",
      "description": "Ask and answer questions to help determine or clarify the meaning of words and phrases in a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: question, answer, statement, background knowledge, phrases, mental images, print features, graphic aids"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.4",
      "grade": null,
      "description": "Interpret words and phrases as they are used in a text, including determining technical, connotative, and figurative meanings, and analyze how specific word choices shape meaning or tone."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Questions often begin with who, what, where, when, and why.",
            "A question has an answer; the answer is called a statement.",
            "How to create simple interrogative sentences about the text.",
            "How to identify unfamiliar words.",
            "Readers use letter and picture clues to unlock meanings of words and phrases.",
            "Recognize words and phrases have literal and nonliteral meanings."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors use words that create mental images to enhance meaning making in informational text. Readers infer meanings based on mental images.",
            "Readers use a variety of print features and graphic aids (e.g., font sizes, illustrations/photographs, drawings, maps, etc.) to identify meanings of unknown words.",
            "Growing readers make note-through writing, symbols, and picture parts-of the text where they have questions."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify informational text features.",
            "Use text features to find information or answer questions about the main topic (idea).",
            "o Find the first page of a chapter using the table of contents",
            "o Find the meaning of a word using the glossary",
            "Read and reread the visual images, print features, and other words in the sentences in the text to identify context clues of unknown words and phrases."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "question",
        "answer",
        "statement",
        "background knowledge",
        "phrases",
        "mental images",
        "print features",
        "graphic aids"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.1.5",
      "description": "Know and use various text features (e.g., headings, tables of contents, glossaries, electronic menus, icons) to locate key facts or information in a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: text features, headings, table of contents, captions, labels, diagrams, maps, indexes, glossaries, electronic menus, icons, informational text"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.5",
      "grade": null,
      "description": "Analyze the structure of texts, including how specific sentences, paragraphs, and larger portions of the text (e.g., a section, chapter, scene, or stanza) relate to each other and the whole."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Text features enhance the author's words in informational text.",
            "The purpose of text features in informational text is to assist the reader in finding key facts and information in text.",
            "That text features assist readers in locating information quickly.",
            "Know and use various text features to locate key facts in informational text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors include text features for their reader to share more information than just the written word.",
            "Readers use text features found in informational text (e.g., subheadings, photographs, captions, bold print, glossaries, electronic menus, icons) to locate key facts and to enhance their new learning.",
            "Readers must utilize all parts of informational text (text features and words) to gain full understanding of the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify different types of text features within a text.",
            "Be able to explain the purpose of different types of text features within a text.",
            "Explain how various text features help readers learn new information from text .",
            "Identify the information provided in the different types of text features used in the text.",
            "Use text features to answer questions about the main topic."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "text features",
        "headings",
        "table of contents",
        "captions",
        "labels",
        "diagrams",
        "maps",
        "indexes",
        "glossaries",
        "electronic menus",
        "icons",
        "informational text"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.1.6",
      "description": "Distinguish between information provided by pictures or other illustrations and information provided by the words in a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: differences, pictures, illustrations, information, key details, main topic, author's purpose, word choice, message, analyze, images, comparing, contrasting"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.6",
      "grade": null,
      "description": "Assess how point of view or purpose shapes the content and style of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Explain the information learned from a picture or illustration.",
            "Differences between words and pictures (illustrations/ photographs) in informational texts.",
            "Words and pictures work together to provide information to the reader.",
            "How to identify important details contained in pictures or other illustrations."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Growing readers use words and pictures or other illustrations to gain understanding of the author's intended message.",
            "Readers analyze images by comparing and contrasting information provided in pictures and other illustrations and the words in the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the illustrations or pictures used in an informational text.",
            "Identify the information provided in the pictures, illustrations, tables, charts, etc., in an informational text.",
            "Determine how the information in the pictures, illustrations, charts, tables, etc., relates to the topic.",
            "Analyze and describe how the pictures and other illustrations in a text contribute to the meaning of the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "differences",
        "pictures",
        "illustrations",
        "information",
        "key details",
        "main topic",
        "author's purpose",
        "word choice",
        "message",
        "analyze",
        "images",
        "comparing",
        "contrasting"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.1.7",
      "description": "Use the illustrations and details in a text to describe its key ideas. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: illustrations, informational texts, main topics, key details, describe, accurate, texts, labels, captions"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.7",
      "grade": null,
      "description": "Integrate and evaluate content presented in diverse media and formats, including visually and quantitatively, as well as in words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Illustrations explain key ideas of topics in informational texts.",
            "Details describe key ideas presented in informational texts.",
            "Informational text present new learning through various types of illustrations (e.g., pictures, photographs, drawings, labels, captions) to explain key ideas and important information."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors use illustrations and details to help share accurate and interesting informational texts with readers.",
            "Readers understand labels and captions provide more information for illustrations in informational texts."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Explain what illustrations describe in a text.",
            "Explain the purpose of specific illustrations in a text.",
            "Explain how the use of illustrations and details describe the key ideas in the text.",
            "Identify the relationship between text and illustrations and how they support one another."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "illustrations",
        "informational texts",
        "main topics",
        "key details",
        "describe",
        "accurate",
        "texts",
        "labels",
        "captions"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.1.8",
      "description": "Identify the reasons an author gives to support points in a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: author, support, details, points, relevant, irrelevant, reasons, examples"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.8",
      "grade": null,
      "description": "Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as the relevance and sufficiency of the evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Informational authors write about topics, and they use key or supporting details to make their point.",
            "How to recall details from a text.",
            "How to participate in a discussion to identify reasons why things happen (cause and effect).",
            "How to determine relevant and irrelevant details."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors of informational text use reasons/examples to provide support to their points and ideas as a way to teach their reader new information.",
            "Growing readers identify the reasons and examples an author uses to support their points and ideas. This helps the reader make meaning of informational text.",
            "Key details support or provide more information about the main topic (idea)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the main topic (idea) of the text.",
            "Identify the key details that support the main topic (idea).",
            "Complete reading activities such as graphic organizers that organizes the main topic (idea) and supporting details.",
            "Summarize the main points of the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "author",
        "support",
        "details",
        "points",
        "relevant",
        "irrelevant",
        "reasons",
        "examples"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.1.9",
      "description": "Identify basic similarities in and differences between two texts on the same topic (e.g., in illustrations, descriptions, or procedures). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: identify, similarities, differences, informational texts, topic, illustrations, descriptions, procedures, describe, labels, captions, connections"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify a topic of a text.",
            "How to recognize texts with the same topic.",
            "How to discuss objects that are similar or different.",
            "Descriptions in informational text are words that describe ideas or things.",
            "Procedures are steps that happen in order to do or make something."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors of informational text use text features (e.g., labels, illustrations, captions, etc.) to share information on their topics.",
            "Readers have greater understandings when they connect new learning to previous experiences.",
            "Growing readers identify similarities and differences between informational texts. They may discover patterns and make connections. This enhances meaning making."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Read two texts on the same topic.",
            "Identify the topic of both texts.",
            "Explain how the two texts on the same topic are alike.",
            "Explain how two texts on the same topic are different.",
            "o What does the author say about the topic in both texts?",
            "o What can be learned about the topic in both texts?"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "identify",
        "similarities",
        "differences",
        "informational texts",
        "topic",
        "illustrations",
        "descriptions",
        "procedures",
        "describe",
        "labels",
        "captions",
        "connections"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.1.1",
      "description": "Recognize the distinguishing features of a sentence (e.g., first word, capitalization, ending punctuation). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: words, sentence, capital letters, end punctuation"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.1",
      "grade": null,
      "description": "Demonstrate understanding of the organization and basic features of print."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Know the difference between capital letters and lowercase letters.",
            "Understand that sentences begin with capital letters and end with the correct punctuation mark.",
            "Understand that a series of words make up a sentence."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A capital begins a sentence and is part of the first word of a sentence.",
            "End punctuation marks are used to end a sentence."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Point to the first word of a sentence.",
            "Acknowledge the capital letter to begin a sentence.",
            "Point to the end punctuation.",
            "Name the end punctuation.",
            "Frame a sentence using two fingers."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "words",
        "sentence",
        "capital letters",
        "end punctuation"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.1.2a",
      "description": "Distinguish long from short vowel sounds in spoken single-syllable words. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: vowel sounds, vowel patterns, vowel teams, diphthongs, r-controlled vowels"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.2",
      "grade": null,
      "description": "Demonstrate understanding of spoken words, syllables, and sounds (phonemes)."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Know the sounds of the letters of the alphabet.",
            "How to differentiate between consonants and vowels."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Vowels can have multiple sounds.",
            "Vowels will have a certain sound based on the spelling of the word.",
            "Vowels have pattern rules."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify and say the vowel sounds based on vowel patterns.",
            "Sort words by the vowel sounds.",
            "Identify words with similar vowel sounds.",
            "Sort words according to vowel sounds.",
            "Segment and blend word based on specific vowel patterns.",
            "Identify CVC and CVCe words.",
            "Identify open and closed syllables"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "vowel sounds",
        "vowel patterns",
        "vowel teams",
        "diphthongs",
        "r-controlled vowels"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.1.2b",
      "description": "Orally produce single-syllable words by blending sounds (phonemes), including consonant blends. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD blend, alphabet sounds, syllables, phoneme"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.2",
      "grade": null,
      "description": "Demonstrate understanding of spoken words, syllables, and sounds (phonemes)."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Know and say the sounds of the letters of the alphabet.",
            "Understand that sounds blend together to make words.",
            "Explain what a syllable represents."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Sounds are blended together to create words.",
            "Listens for the individual phoneme (sounds) in words.",
            "Letters placement in a word helps to create syllable patterns (CVC, CVCe, etc).",
            "Use knowledge of syllable patterns to blend words.",
            "Understand that come consonants blend together to make consonant blends."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the sounds a blend makes.",
            "Say a word with blended sounds.",
            "Listens to a word and is able to produce individual phonemes.",
            "Sees a word in print and is able to blend the letters to make the word.",
            "Build a word by blending the sounds of the word in the order they appear."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.1.2c",
      "description": "Isolate and pronounce initial, medial vowel, and final sounds (phonemes) in spoken single-syllable words. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: isolate, pronounce, initial, medial vowel, final sounds, phonemes, letters"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.2",
      "grade": null,
      "description": "Demonstrate understanding of spoken words, syllables, and sounds (phonemes)."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify the sounds of the letters of the alphabet.",
            "Understand words are made of syllables.",
            "Words have sounds that come at the beginning/initial, middle/medial, and end/final parts of the word."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That letter sounds are placed in a sequence to build words.",
            "That in a single-syllable word there will be an initial sound, medial vowel sound, and final sound.",
            "Identify CVC patterns in words.",
            "To build a word from its phonemes, the phonemes will be blended together.",
            "A word can be changed from cat to bat by isolating the -at and changing the initial sound."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Hear and state the initial sound, the medial vowel sound, and the final sound of a word.",
            "Blend the phonemes together in the order represented in the word to state the spoken word.",
            "State a word. Isolate the initial sound and place a new sound at the front of the word to build a new word."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "isolate",
        "pronounce",
        "initial",
        "medial vowel",
        "final sounds",
        "phonemes",
        "letters"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.1.2d",
      "description": "Segment spoken single-syllable words into their complete sequence of individual sounds (phonemes). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: blend, segment, sounds, phonemes, initial, medial, final, syllable"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.2",
      "grade": null,
      "description": "Demonstrate understanding of spoken words, syllables, and sounds (phonemes)."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The sounds of the letters of the alphabet.",
            "What a syllable represents.",
            "Words have sounds that come at the beginning/initial, middle/medial, and end/final parts of the word."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Letter sounds are placed in a sequence to build words.",
            "In a single-syllable word, there will be an initial sound, medial vowel sound, and final sound.",
            "To break a word into its sounds, the phonemes will be segmented into their complete sequence of individual sounds.",
            "A word can be changed from cat to bat by isolating the -at and changing the initial sound."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Listen to a spoken word and produces each individual phoneme that makes up the word.",
            "Use different color titles to represent each phoneme in a given word.",
            "Be successful in phoneme segmentation fluency activities",
            "o Teacher says \"he\"",
            "o Student says /h/ /e/",
            "o Teacher says \"tack\"",
            "o Student says /t/ /a/ /k/"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "blend",
        "segment",
        "sounds",
        "phonemes",
        "initial",
        "medial",
        "final",
        "syllable"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.1.3a",
      "description": "Know the spelling-sound correspondences for common consonant digraphs. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: letters, sounds, digraphs, consonants"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.3",
      "grade": null,
      "description": "Know and apply grade-level phonics and word analysis skills in decoding words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Some letters (whether vowels or consonants) can be joined together to make one sound.",
            "Know and say the sound of each letter of the alphabet."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Consonants can be joined together to make one sound.",
            "The most common consonant digraphs are ch-, sh-, th-, ph- and wh-."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Understand that diagraphs represent one individual phoneme or speech sound.",
            "When spelling words, correctly represent digraphs.",
            "When segmenting words, understand that digraphs produce one individual speck sound.",
            "When blending words, produce one individual sound to represent consonant digraphs."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "letters",
        "sounds",
        "digraphs",
        "consonants"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.1.3b",
      "description": "Decode regularly spelled one-syllable words. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: decode, one-syllable, phonemes, break a word apart"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.3",
      "grade": null,
      "description": "Know and apply grade-level phonics and word analysis skills in decoding words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Demonstrate basic knowledge of one-to-one letter-sound correspondences by producing the primary or many of the most frequent sound for each consonant.",
            "How to associate the long and short sounds with common spellings (graphemes) for the five major vowels.",
            "How to distinguish between similarly spelled words by identifying the sounds of the letters that differ."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "An unknown one-syllable word can be decoded by its phonemes.",
            "Words are divided into syllables.",
            "Syllables have pattern.",
            "Identify CVC, CV, CCVC, and CVCC syllable patterns words."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use the decoding strategy to figure out unknown one-syllable words while reading.",
            "Break a word apart by saying its initial, medial, and final sound.",
            "Identify a word's syllable patterns and use phonic rules to decode, blend, or spell the word."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "decode",
        "one-syllable",
        "phonemes",
        "break a word apart"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.1.3c",
      "description": "Know final -e and common vowel team conventions for representing long vowel sounds. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: decode, final -e rules, vowel team conventions, apply"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.3",
      "grade": null,
      "description": "Know and apply grade-level phonics and word analysis skills in decoding words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Rules are established to help a reader read an unknown word.",
            "How to use word analysis skills to decode unknown words."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Know final -e is a word analysis strategy to use with an unknown word.",
            "Know vowel team conventions to analyze and decode an unknown word with a long vowel sound.",
            "CVCe represents the long vowel sound."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Apply the rule for decoding a word apart with a final -e to say an unknown word.",
            "Apply vowel team conventions to analyze and decode an unknown word with a long vowel sound."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "decode",
        "final -e rules",
        "vowel team conventions",
        "apply"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.1.3d",
      "description": "Use knowledge that every syllable must have a vowel sound to determine the number of syllables in a printed word. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: vowel sounds, syllables, decode"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.3",
      "grade": null,
      "description": "Know and apply grade-level phonics and word analysis skills in decoding words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Know the sounds of letters.",
            "How to distinguish vowels from consonants.",
            "Understand that each syllable of a word must have a vowel sound."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understand syllabication rules state that every syllable must contain a vowel.",
            "Understand vowels must be in every syllable.",
            "Understand vowel rules in order to be able to decode a word.",
            "Vowel sounds in a word are determined by syllable patterns, such as CVC, CVCe, CVCC, CCVC, CV, CCV, CVVC, CCVVC, etc."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Apply syllabication rules to decode syllables in a word ensuring each syllable contains a vowel.",
            "Apply vowel sound rules to decode a word into its syllables.",
            "Identify vowel sounds in individual syllables using syllable patterns."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "vowel sounds",
        "syllables",
        "decode"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.1.3e",
      "description": "Decode two-syllable words following basic patterns by breaking the words into syllables. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: decode, syllables, vowels, syllable patterns, closed syllable, opened syllable, vowel combination, r-controlled, vowel combination, vowel-consonant e, consonant-le."
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.3",
      "grade": null,
      "description": "Know and apply grade-level phonics and word analysis skills in decoding words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Know the sounds of letters.",
            "Distinguish vowels from consonants.",
            "How to demonstrate basic knowledge of one-to-one letter-sound correspondences by producing the primary or many of the most frequent sound for each consonant.",
            "How to associate the long and short sounds with common spellings (graphemes) for the five major vowels."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Words are broken into its syllables to decode an unknown word.",
            "Words can have several syllables, but each syllable must have a vowel.",
            "Syllable patterns: closed, opened, vowel combination, r-controlled, vowel-consonant e, and consonant-le."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify syllable pattern in words.",
            "Divide words into syllables according to syllable patterns",
            "Produce the vowel sound according to the syllable pattern:",
            "o VC, VCV, CCVC, CVCC patterns are closed and the vowel produce the short sound.",
            "o CV and CCV patterns are open and the vowel produces the long sound.",
            "o CVVC, CCVV , CVVCC patterns are made up of vowel combinations and sounds can be short but are typically long."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "decode",
        "syllables",
        "vowels",
        "syllable patterns",
        "closed syllable",
        "opened syllable",
        "vowel combination",
        "r-controlled",
        "vowel combination",
        "vowel-consonant e",
        "consonant-le."
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.1.3f",
      "description": "Read words with inflectional endings. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: words, sounds, inflectional endings"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.3",
      "grade": null,
      "description": "Know and apply grade-level phonics and word analysis skills in decoding words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Words have ending sounds.",
            "A word is read from left to right.",
            "Word parts are added to words.",
            "Word parts can change the meaning of the word."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "To read a word, the reader must start at the left and read to the right.",
            "The reader must read through the entire word and make the sounds of all letters or combinations of letters.",
            "The reader must know some letters are added to the ends of words to provide new meanings.",
            "Adding -s or -es to the end of a noun makes it mean more than one.",
            "Adding -ing to a verb means an action is happening now.",
            "Adding -ed to a verb means an action has already happened."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Add -s,-es, -ed, -ing to the end of a word and still read a word in its entirety.",
            "Know when to add -s and -es to a word.",
            "Know when to add -ed to a word.",
            "Know when to add -ing to a word."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "words",
        "sounds",
        "inflectional endings"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.1.3g",
      "description": "Recognize and read grade-appropriate irregularly spelled words. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Irregular, read, words, spellings"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.3",
      "grade": null,
      "description": "Know and apply grade-level phonics and word analysis skills in decoding words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to recognize and produce multiple sounds of vowels and consonants that can make several sounds."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Recognize that some words can't be decoded using one-to-one correspondence.",
            "Understand that some words do not follow a predictable pattern that can be learned to decode or spell the word.",
            "Understand that some words are not spelled like they sound."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Read and spell irregular words.",
            "Identify some irregular spelled words such as comb with a silent consonant b at the end of the word."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Irregular",
        "read",
        "words",
        "spellings"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.1.4a",
      "description": "Read on-level text with purpose and understanding. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: reading, texts, genres, predictions, on-level, vocabulary"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.4",
      "grade": null,
      "description": "Read with sufficient accuracy and fluency to support comprehension."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to listen to different genres with a given purpose.",
            "How to demonstrate understanding of text when it is read aloud.",
            "Understand that readers have a purpose when reading."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understanding the different purposes for reading.",
            "Participate in guided reading and shared reading of texts from a variety of genres.",
            "Have an understanding of on-level vocabulary.",
            "Make predictions about texts, and use the text to confirm those predictions during read aloud.",
            "Use information known about the text to determine genre.",
            "Know the purpose for reading on-level text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Predict what a text may be about before reading.",
            "Check the predictions of text during reading.",
            "Check for understanding of comprehension before, during, and after reading."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "reading",
        "texts",
        "genres",
        "predictions",
        "on-level",
        "vocabulary"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.1.4b",
      "description": "Read on-level text orally with accuracy, appropriate rate, and expression on successive readings. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: read, orally, purpose, fluency, rate, expression"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.4",
      "grade": null,
      "description": "Read with sufficient accuracy and fluency to support comprehension."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Know text needs to be read with accuracy to support comprehension.",
            "Know successive readings of a text, helps a reader read with accuracy, appropriate rate, and expression."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "There are strategies for how to read with accuracy.",
            "There are strategies for how to adapt the oral reading rate to fit the purpose and context of the reading.",
            "While reading, read grade-levels words accurately and repeatedly.",
            "Use decoding strategies and skills when reading on-level words.",
            "Punctuation is used to help express the meaning of the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Read text aloud.",
            "Read text aloud with fluency.",
            "Read text aloud fluently with appropriate rate.",
            "Read text aloud fluently with appropriate rate and expression.",
            "Read fluently when reading a passage successively.",
            "Read fluently using punctuation to assist in reading with expression."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "read",
        "orally",
        "purpose",
        "fluency",
        "rate",
        "expression"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.1.4c",
      "description": "Use context to confirm or self-correct word recognition and understanding, rereading as necessary. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: self-correct, monitor, reread, misread, context, meaning"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.4",
      "grade": null,
      "description": "Read with sufficient accuracy and fluency to support comprehension."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Know word meaning can be gained from context around an unknown word."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Monitor one's reading to understand when comprehension is not taking place.",
            "Self-correct when a word is misread, and reread the sentence."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use appropriate grade-level strategies to decode words.",
            "Use the context of a sentence, picture, or text to help with word recognition.",
            "Use the context of a sentence, picture, or text to assist in understanding word meaning."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "self-correct",
        "monitor",
        "reread",
        "misread",
        "context",
        "meaning"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.1.1",
      "description": "Write opinion pieces, in which they introduce the topic or name the book they are writing about, state an opinion, supply a reason for the opinion, and provide some sense of closure. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: opinion, fact, reasons, supporting detail, vivid vocabulary, beginning, middle, conclusion, topic, mentors, revise, edit, write for reader"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "An opinion is how someone thinks or feels.",
            "A fact is information that can be proven or verified.",
            "An introduction is one or more sentences that provide an overview of the topic.",
            "Reasons are examples that support the opinion.",
            "A conclusion is how an author ends a piece of writing.",
            "How to share an opinion on a topic orally, through drawing, and in writing."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Writers brainstorm multiple ideas before beginning the writing process.",
            "Growing writers pre-tell, draft, and re-read to revise or improve their writing. Their final step is to edit (e.g., check capitalization, punctuation, and spelling.",
            "Authors add words/vivid details and phrases that supply evidence for reasons, which support their opinion or preference.",
            "Growing writers look at models of good writing to aid in lifting the level of their pieces."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Compose a piece of writing in which the students",
            "o Name the topic",
            "o State an opinion",
            "o Provide at least one reason to support the opinion",
            "o Provide a sense of closure to indicate the writing has ended",
            "Generate multiple opinion pieces that include an introduction, body, and closing such as a paragraph, speech, letter, thank-you note, etc.",
            "Add words and phrases that engage the reader and enhance the reason for the opinion and provide a sense of closure."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "opinion",
        "fact",
        "reasons",
        "supporting detail",
        "vivid vocabulary",
        "beginning",
        "middle",
        "conclusion",
        "topic",
        "mentors",
        "revise",
        "edit",
        "write for reader"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.1.2",
      "description": "Write informative/explanatory texts in which they name a topic, supply some facts about the topic, and provide some sense of closure. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: informational text, explanatory text, facts, details, topic, labels, drawing, sketches, information, procedures, nonfiction, beginnings, endings, notes, compose, topic, closure, literary nonfiction, nonfiction, procedural writing, friendly letters, biographies"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative/explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Informative texts covey facts or information about a topic.",
            "Explanatory text explains how or why something happens.",
            "Informative/explanatory text teach the reader new information.",
            "Types of informational/ explanatory writing: nonfiction, literary nonfiction, procedures, friendly letters, biographies, and writing about reading."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Growing writers write books or short pieces that are enjoyable for the reader and at the same time teach the reader about a new topic.",
            "Authors of informational texts use text features (e.g., illustrations, labels, captions, etc.) to provide information to their readers.",
            "Authors use a variety of beginnings or endings through drawings and writing that engage and teach their readers."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Compose a piece of writing that explains, informs, or describes in which the students",
            "o Name the topic",
            "o Supply some facts about the topic",
            "o Provide a sense of closure",
            "Take notes through drawing or writing to assist with the composition of informative/ explanatory writing.",
            "Create informational/ explanatory writing in different forms such as creating how-to posters, etc.",
            "Look at models of informative/explanatory text to assist in improving the composition of their writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "informational text",
        "explanatory text",
        "facts",
        "details",
        "topic",
        "labels",
        "drawing",
        "sketches",
        "information",
        "procedures",
        "nonfiction",
        "beginnings",
        "endings",
        "notes",
        "compose",
        "topic",
        "closure",
        "literary nonfiction",
        "nonfiction",
        "procedural writing",
        "friendly letters",
        "biographies"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.1.3",
      "description": "Write narratives in which they recount two or more appropriately sequenced events, include some details regarding what happened, use temporal words to signal event order, and provide some sense of closure. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: narrative, personal narrative, memoir, story, sequence, transition/temporal words, details, describe, closure, recount, draft, revision, edit"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details and well-structured event sequences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Narrative writing entertains or informs a reader with real or imagined events.",
            "An event is an activity or action that happens in a certain place during a specific period.",
            "Details are used to describe what happens in the story.",
            "Sequenced events have a beginning, middle, and end.",
            "Temporal words and phrases show the passage of time (e.g., meanwhile, after a while, etc.)"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Writers tell stories from their own life that are often based on a memory. Stories contain a beginning, middle, and end.",
            "Growing writers begin by utilizing prewriting (e.g., oral, written, drawn) before they write.",
            "Growing writers express their feelings, actions, and thoughts before, during, and after events.",
            "Authors consider their word choices (e.g., descriptive language, synonyms, similes, metaphors) to make their stories more interesting for their readers."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Generate narratives by recounting two or more appropriately sequenced events that include details (e.g., thoughts, feelings, actions) from a personal experience.",
            "Create a fictional story with two or more appropriately sequenced events with some details about the character, setting, and events.",
            "Use temporal or signal words to help link or sequence the events.",
            "Create narrative elements when writing such as characters, a setting, two or more appropriately sequenced of events, and an ending."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "narrative",
        "personal narrative",
        "memoir",
        "story",
        "sequence",
        "transition/temporal words",
        "details",
        "describe",
        "closure",
        "recount",
        "draft",
        "revision",
        "edit"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.1.4",
      "description": "Begins in grade 3. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD:"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.4",
      "grade": null,
      "description": "Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": []
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": []
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": []
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.1.5",
      "description": "With guidance and support from adults, focus on a topic, respond to questions and suggestions from peers, and add details to strengthen writing as needed. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) improve their message. A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: topic, subject, discussion, detail, clarify meaning, mental images, revision, conferring, sentence structure, word choice, draft, publish"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.5",
      "grade": null,
      "description": "Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A topic is a subject or idea that can be developed through discussion and writing.",
            "Details help readers create mental images and understand the writer's thoughts.",
            "Revision means to make changes to writing by adding or deleting details.",
            "Conferring with peers and adults enhance the writing product."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Growing writers work with peers and adults to revise their work by adding details (e.g., thoughts, feelings, actions). These details make their ideas clearer for the reader.",
            "Revising is an ongoing process that provides writers with opportunities to clarify ideas and revisit sentence structure and word choice to"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Generate a writing piece in response to a question or prompt.",
            "Generate writing that is focused on a topic.",
            "Revise writing based on suggestions from peers.",
            "Analyze suggestions provided by peers and adults to make decisions on revisions.",
            "Analyze suggestions provided by peers and adults to make editing decisions on capitalization, punctuation, and spelling."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "topic",
        "subject",
        "discussion",
        "detail",
        "clarify meaning",
        "mental images",
        "revision",
        "conferring",
        "sentence structure",
        "word choice",
        "draft",
        "publish"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.1.6",
      "description": "With guidance and support from adults, use a variety of digital tools to produce and publish writing, including in collaboration with peers. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: digital tools, dropdown menus, word processing, paint programs, digital images, audio recordings, podcasts, blogging, email, social media, text, presentations, backchannel, audio tracks, produce, publish, collaborate, draft, revise, edit"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.6",
      "grade": null,
      "description": "Use technology, including the Internet, to produce and publish writing and to interact and collaborate with others."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Digital tools may be used to produce and publish writing.",
            "Digital tools may be used for communication (e.g., texting, emailing, blogging, using social media, using digital images).",
            "A writer selects the digital tool according to the task, audience, or purpose.",
            "Writers use peers and digital tools (e.g., drop-down menus with spelling/grammar check, thesaurus) to edit and enhance their work."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Writers use digital tools to enhance their writing (e.g., word processing, paint programs, cameras, and audio recordings, podcasts)",
            "Authors determine the digital tools to be utilized based on the task or purpose (e.g., blog, text, presentation, backchannel, audio track, etc.)",
            "Writers select the digital tool according to the task, audience, or purpose."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use a variety of digital tools (e.g., story-telling software, drawing software, voice recording software) to produce, share, and publish writing.",
            "Collaborate with peers to produce and publish writing, using a variety of digital tools."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "digital tools",
        "dropdown menus",
        "word processing",
        "paint programs",
        "digital images",
        "audio recordings",
        "podcasts",
        "blogging",
        "email",
        "social media",
        "text",
        "presentations",
        "backchannel",
        "audio tracks",
        "produce",
        "publish",
        "collaborate",
        "draft",
        "revise",
        "edit"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.1.7",
      "description": "Participate in shared research and writing projects (e.g., explore a number of \"how-to\" books on a given topic and use them to write a sequence of instructions). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: research, data, facts, relevant information, resources, note taking, organize, inquiry, investigation"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.7",
      "grade": null,
      "description": "Conduct short as well as more sustained research projects based on focused questions, demonstrating understanding of the subject under investigation."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Research is the act of gathering data, facts, and information based on a focus question.",
            "How to identify which resources might provide information about a specific topic (e.g., books, photos, video clips, websites, personal experiences, interviews)",
            "How to record new information through note taking methods.",
            "How to determine if information is relevant to research topic.",
            "Writing should be organized in a logical manner."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Writers research information to learn more about their subjects. Their information can be shared through a variety of methods (e.g., print, digital, text features, sequence of events, procedures)",
            "Authors investigate and read about their topics before they compose their writing.",
            "Growing writers decide which important information should be included in their research project."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Participates in shared research and writing projects.",
            "Read or listen to a variety of informational text (books in print or digital sources) on a particular topic.",
            "Create an inquiry and writing project that demonstrates new understandings gained from an investigation.",
            "Utilize resources (with assistance) to gain information to be included in the writing.",
            "Look at mentor text for inspiration in generating a variety of writing (e.g., \"how-to\", lab reports, nonfiction chapter books)."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "research",
        "data",
        "facts",
        "relevant information",
        "resources",
        "note taking",
        "organize",
        "inquiry",
        "investigation"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.1.8",
      "description": "With guidance and support from adults, recall information from experiences or gather information from provided sources to answer a question. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: background knowledge, schema, note taking, information, composing, cite, sources, accurate"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.8",
      "grade": null,
      "description": "Gather relevant information from multiple print and digital sources, assess the credibility and accuracy of each source, and integrate the information while avoiding plagiarism."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Information can be found in various sources (e.g., books, magazines, Internet, etc.) or from others' experiences.",
            "A question is a statement that requests information.",
            "An answer provides the required information or answer to a question.",
            "Background knowledge or past experiences may be important when answering questions."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors gather information from sources and use their background knowledge when answering research questions.",
            "Writers collect information by taking notes. This helps them to hold on to their new learning and use their own words when composing.",
            "Authors use and cite multiple sources to make sure they have accurate information."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Recall information from experiences to answer questions in writing.",
            "Listen attentively to adults when receiving support with research, revising, or editing.",
            "Gather information from provided sources to answer a question in writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "background knowledge",
        "schema",
        "note taking",
        "information",
        "composing",
        "cite",
        "sources",
        "accurate"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.1.9",
      "description": "Begins in grade 4. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD:"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.9",
      "grade": null,
      "description": "Draw evidence from literary or informational texts to support analysis, reflection, and research."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": []
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": []
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": []
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Writing",
    "reporting_category": "Range of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.1.10",
      "description": "Begins in grade 3. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD:"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.10",
      "grade": null,
      "description": "Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of tasks, purposes, and audiences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": []
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": []
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": []
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.1.1a",
      "description": "Follow agreed-upon rules for discussions (e.g., listening to others with care, speaking one at a time about the topics and texts under discussion). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: class rules, appropriate, discussions, expectations, share, talk about, peers"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Participate in collaborative conversations with diverse partners about grade 1 topics and texts with peers and adults in small and larger groups."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Rules help everyone play fair.",
            "Discussions are when two people talk about a topic or a text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understand the class rules for discussions.",
            "Understand the proper expectations for following the agreed-upon rules for classroom discussions."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Follow the appropriate rules when participating in discussions.",
            "Listen to classmates share and discuss a topic.",
            "Provide information about a topic to peers in a group discussion.",
            "Wait the appropriate turn before speaking.",
            "Participate in discussion when prompted."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "class rules",
        "appropriate",
        "discussions",
        "expectations",
        "share",
        "talk about",
        "peers"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.1.1b",
      "description": "Build on others' talk in conversations by responding to the comments of others through multiple exchanges. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: listen effectively, build on, add ideas, discussion"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Participate in collaborative conversations with diverse partners about grade 1 topics and texts with peers and adults in small and larger groups."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Understand how to listen to a peer's comments on a given topic and then continue the discussion by providing more information.",
            "Understand how to listen to a peer's comments on a given topic and topic and then continue the discussion by restating what has been shared.",
            "Listen to others' discussion in a group and wait to respond when a turn arises."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understand how to listen effectively to respond to others' comments.",
            "Understand how to listen effectively to others' comments to build on a given topic of discussion."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Listen to peers' comments during a discussion.",
            "Consider what to share during the discussion.",
            "Share information about the topic during the discussion.",
            "Decide as the discussion continues if he/she can share more information."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "listen effectively",
        "build on",
        "add ideas",
        "discussion"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.1.1c",
      "description": "Ask questions to clear up any confusion about the topics and texts under discussion. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: collaborative conversations, diverse partners, peers, adults, small and large group, discussions, questions, answers"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Participate in collaborative conversations with diverse partners about grade 1 topics and texts with peers and adults in small and larger groups."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Understand that questions require answers.",
            "Questions often begin with question words: who, what, when, where, why, how.",
            "Understand that asking questions can help listeners better understand what is said."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Collaborative conversations take place when partners work together to discuss a given topic.",
            "Questions will need to be asked when there is confusion in the conversation.",
            "Questions will need to be answered when there is confusion in the conversation."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Discuss Grade 1 topics with peers and/or adults in small- and large group settings.",
            "Ask questions when confusion arises in the conversation.",
            "Answer questions when confusion arises in the conversation."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "collaborative conversations",
        "diverse partners",
        "peers",
        "adults",
        "small and large group",
        "discussions",
        "questions",
        "answers"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.1.2",
      "description": "Ask and answer questions about key details in a text read aloud or information presented orally or through other media. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: ask questions, answer questions, key details"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Integrate and evaluate information presented in diverse media and formats, including visually, quantitatively, and orally."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Understand how to share what is understood from a read aloud or information presented orally or through other media.",
            "Understand how to ask questions about key details needing clarification from a read aloud or information presented orally or through other media.",
            "Understand how to answer questions about key details needing clarification from a read aloud or information presented orally or through other media."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Questions about key details in a text read aloud or information presented orally or through other media may clarify the subject.",
            "Questions about key details in a text read aloud or information presented orally or through other media may clarify the subject."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Share what is understood from a read aloud or information presented orally or through other media.",
            "Ask questions about key details needing clarification from a read aloud or information presented orally or through other media.",
            "Answer questions about key details needing clarification from a read aloud or information presented orally or through other media.",
            "Ask questions about key details in a text read aloud or information presented orally or through other media.",
            "Answer questions about key details in a text read aloud or information presented orally or through other media."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "ask questions",
        "answer questions",
        "key details"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.1.3",
      "description": "Ask and answer questions about what a speaker says in order to gather additional information or clarify something that is not understood. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: ask, clarification, answer, questions"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.3",
      "grade": null,
      "description": "Evaluate a speaker's point of view, reasoning, and use of evidence and rhetoric."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Understand how to ask others for help when clarification is needed.",
            "Understand how to ask others for more information to clarify when something is not understood.",
            "Understand how to ask for clarification when something is not understood.",
            "Understand how to answer others when they request clarification."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understand when more information is needed to understand what a speaker has stated.",
            "Understand how to ask questions about what a speaker says to gather additional information.",
            "Understand how to ask questions about what a speaker says to clarify something that is not understood.",
            "Understand how to answer questions about what a speaker says."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Ask questions when confused about a statement during discussions to gain a better understand of what is said.",
            "Ask for clarification when something is misunderstood.",
            "Ask questions that require a more detailed answer.",
            "Ask for the meaning of unknown words.",
            "Continue to ask more questions about a topic that have not been addressed."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "ask",
        "clarification",
        "answer",
        "questions"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.1.4",
      "description": "Describe people, places, things, and events with relevant details, expressing ideas and feelings clearly. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: evidence, prior knowledge, back ground knowledge, relevant, details, describe"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.4",
      "grade": null,
      "description": "Present information, findings, and supporting evidence such that listeners can follow the line of reasoning and the organization, development, and style are appropriate to task, purpose, and audience."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Adjectives can be used to help to describe people, places, and events.",
            "Thinking about what you know about a person, place, thing, or event can help generate more details."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "To describe people, places, things, and events, relevant details must be included in the description.",
            "To describe people, places, things, and events, ideas must be expressed clearly.",
            "To describe people, places, things, and events, feelings must be expressed clearly."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Describe a familiar person, place, thing, and event with details to help others understand.",
            "Describe people, places, things, and events so ideas can be expressed clearly.",
            "Describe people, places, things, and events so feelings can be expressed clearly."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "evidence",
        "prior knowledge",
        "back ground knowledge",
        "relevant",
        "details",
        "describe"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.1.5",
      "description": "Add drawings or other visual displays to descriptions when appropriate to clarify ideas, thoughts, and feelings. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: draw, add visuals, add more detail"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.5",
      "grade": null,
      "description": "Make strategic use of digital media and visual displays of data to express information and enhance understanding of presentations."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Understand how to draw what is described in print.",
            "Understand how to add visuals to information described in print.",
            "Understand how to add drawings to give more details to what has been described."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Adding drawings to descriptions can help to clarify ideas, thoughts, and feelings.",
            "How and when to add other visual displays to descriptions to clarify ideas.",
            "Adding other visual displays to descriptions to clarify ideas, thoughts, and feelings."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Draw what is described in print.",
            "Add visuals to information described in print.",
            "Add drawings to give more details to what has been described.",
            "Add drawings to clarify ideas.",
            "Add drawings to clarify thoughts.",
            "Add drawings to clarify feelings.",
            "Add other visual displays to clarify ideas.",
            "Add other visual displays to clarify thoughts.",
            "Add other visual displays to clarify feelings."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "draw",
        "add visuals",
        "add more detail"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.1.6",
      "description": "Produce complete sentences when appropriate to task and situation. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: complete sentence, subject, predicate, complete thought"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.6",
      "grade": null,
      "description": "Adapt speech to a variety of contexts and communicative tasks, demonstrating command of formal English when indicated or appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Understand that to express a thought to others, the thought will need to be spoken.",
            "Understand that to be expressive one must convey thoughts, feelings, and ideas in a way for others to understand them.",
            "Understand the meaning and function of subjects and predicates."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Complete sentences need to be used to help others understand.",
            "A complete sentence contains a subject and predicate and expresses a complete thought."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Verbally express thoughts to others.",
            "Verbally express thoughts, feelings, and ideas in a way for others to understand them.",
            "Uses complete sentences when speaking and when making statements.",
            "Uses complete sentences when asking questions."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "complete sentence",
        "subject",
        "predicate",
        "complete thought"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.1a",
      "description": "Print all upper-and lowercase letters. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: alphabet, uppercase, lowercase, print, standard form, distinguish, letters, words, demonstrate, command, conventions, standard English, grammar, writing, speaking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Letters can be written in uppercase and lowercase.",
            "Distinguish between letters and shapes."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The alphabet is made up of letters that can be printed in upper- and lowercase.",
            "Letters look different when printed in upper- versus lowercase.",
            "Letters make up words.",
            "The printed alphabet has a standard form that is universally used.",
            "Printing letters correctly allows the reader to understand what has been written.",
            "Printing letters correctly allows the student to write using Standard English."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Distinguish the difference between upper- and lowercase letters.",
            "Write in standard print many upper- and lowercase letters.",
            "Recognize that writing keys produce a letter, number, and symbol."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "alphabet",
        "uppercase",
        "lowercase",
        "print",
        "standard form",
        "distinguish",
        "letters",
        "words",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "grammar",
        "writing",
        "speaking"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.1b",
      "description": "Use common, proper, and possessive nouns. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: noun, common noun, proper noun, possessive noun, explain, classify, use, demonstrate, command, conventions, standard English, grammar, writing, speaking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Words in our language can be grouped into categories based on how we use the words.",
            "Nouns name people, places, or things."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Common nouns name any person, place, or thing.",
            "Proper nouns name specific people, places, or things. Pronouns must be capitalized.",
            "Possessive nouns show ownership. They end with an appositive and an \"s.\""
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Explain the difference between common, proper, and possessive nouns.",
            "Classify common, proper, and possessive nouns correctly.",
            "Use common, proper, and possessive nouns correctly in sentences."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "noun",
        "common noun",
        "proper noun",
        "possessive noun",
        "explain",
        "classify",
        "use",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "grammar",
        "writing",
        "speaking"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.1c",
      "description": "Use singular and plural nouns with matching verbs in basic sentences (e.g., He hops; We hop). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: singular noun, plural noun, matching verbs, identify, agree, match, difference, demonstrate, command, conventions, standard English, grammar, usage, writing, speaking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Nouns are classified as singular or plural.",
            "Singular and plural nouns will have a matching verb in a sentence.",
            "Plural forms of given nouns."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The verb must agree with the noun in a sentence."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the difference between singular and plural nouns.",
            "Match the noun with the correct form of the verb."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "singular noun",
        "plural noun",
        "matching verbs",
        "identify",
        "agree",
        "match",
        "difference",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "grammar",
        "usage",
        "writing",
        "speaking"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.1d",
      "description": "Use personal, possessive, and indefinite pronouns (e.g., I, me, my; they, them, their, anyone, everything). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: pronouns, nouns, replace, use, personal pronouns, possessive pronouns, indefinite pronouns, sentences, demonstrate, command, conventions, standard English, grammar, usage, writing, speaking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Words in our language can be grouped into categories based on how we use the words.",
            "Nouns name a person, place, or thing.",
            "Text can be written in first-person (personal pronouns)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Pronouns name a noun.",
            "Different types of pronouns are used.",
            "Personal pronouns replace nouns representing people, places, and things.",
            "Indefinite pronouns refer to nonspecific nouns.",
            "Possessive pronouns show possession."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Replace nouns with correct pronouns.",
            "Correctly identify personal, possessive, and indefinite pronouns.",
            "Correctly use personal, possessive, and indefinite pronouns."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "pronouns",
        "nouns",
        "replace",
        "use",
        "personal pronouns",
        "possessive pronouns",
        "indefinite pronouns",
        "sentences",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "grammar",
        "usage",
        "writing",
        "speaking"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.1e",
      "description": "Use verbs to convey a sense of past, present, and future (e.g., Yesterday I walked home; Today I walk home; Tomorrow I will walk home). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: verbs, past, present, future, tense, express, convey, explain, difference, use, sentence, demonstrate, command, conventions, standard English, grammar, usage, writing, speaking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Verbs express an action, occurrence, or state of being.",
            "Text can be written in the past (yesterday), the present (now), or the future (tomorrow)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Verbs have different tenses.",
            "Verbs can be used to express time.",
            "Present tense means something is happening now.",
            "Past tense means something has already happened.",
            "Future tense means something will happen in a time to come."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Explain the difference between past, present, and future tense verbs.",
            "Correctly identify past, present, and future forms of verbs.",
            "Correctly add -s, -ing, etc. to verbs to show action or select the correct form of the present tense verb.",
            "Correctly add -ed to the end of verbs to show actions that happened in the past or correctly select the correct irregular form of the past tense form of a verb.",
            "Correctly add \"will\" to verbs to show action that will happen in the future."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "verbs",
        "past",
        "present",
        "future",
        "tense",
        "express",
        "convey",
        "explain",
        "difference",
        "use",
        "sentence",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "grammar",
        "usage",
        "writing",
        "speaking"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.1f",
      "description": "Use frequently occurring adjectives. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, frequently, adjectives, describe, nouns, sentence, identify, demonstrate, command, conventions, standard English, grammar, usage, writing, speaking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Words in our language can be grouped into categories according to how they are used.",
            "Words can be used to describe things.",
            "Words can be used to describe something in greater detail, appealing to the senses."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Adjectives are used in sentences to describe nouns.",
            "Adjectives can make the sentence sound better.",
            "Adjectives tell how many, which one, which color, etc., about the noun."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify adjectives.",
            "Identify frequently occurring adjectives in sentences.",
            "Use frequently occurring adjectives in sentences when writing.",
            "Determine and/or select the appropriate adjective."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "frequently",
        "adjectives",
        "describe",
        "nouns",
        "sentence",
        "identify",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "grammar",
        "usage",
        "writing",
        "speaking"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.1g",
      "description": "Use frequently occurring conjunctions (e.g., and, but, or, so, because). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, frequently, conjunctions, expand, join, words, sentence, explain, demonstrate, command, conventions, standard English, grammar, usage, writing, speaking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Words in our language can be grouped into categories based on how we use the word.",
            "There are special words that are used to join words or ideas.",
            "These words are called conjunctions."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Conjunctions are used to join words and sentences.",
            "The most common conjunctions are for, and, nor, but, or, yet, and so.",
            "Conjunction can create a compound sentence, compound subject, and compound predicated."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify conjunctions in writing and speech.",
            "Explain the purpose of a conjunction in a sentence.",
            "Use frequently occurring conjunctions to join words and sentences.",
            "Correctly identify which conjunction to use when joining words and/or sentences."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "frequently",
        "conjunctions",
        "expand",
        "join",
        "words",
        "sentence",
        "explain",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "grammar",
        "usage",
        "writing",
        "speaking"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.1h",
      "description": "Use determiners (e.g., articles, demonstratives). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, determiners, articles, demonstratives, describe, modify, noun, replaces, identify, sentences, demonstrate, command, conventions, standard English, grammar, usage, writing, speaking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Words in our language can be grouped into categories based on how we use the words.",
            "Some words can describe other words.",
            "These words are known as adjectives. There are different types of adjectives.",
            "These words help make spoken and written communication clear."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Determiners are words that precede and modify nouns.",
            "A demonstrative is a determiner that points to a particular noun or to the noun it replaces (e.g., this, these, that, those).",
            "An article is used to indicate a noun (e.g., a, an, the).",
            "Determiners are used in sentences to help clarify."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify article adjectives: a, an, and the.",
            "Correctly use article adjectives when speaking and writing.",
            "Identify when to use each article adjective.",
            "Identify demonstrative adjectives.",
            "Correctly use demonstrative adjectives: this, these, that, those, and such.",
            "Identify when to use each demonstrative adjective when speaking and writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "determiners",
        "articles",
        "demonstratives",
        "describe",
        "modify",
        "noun",
        "replaces",
        "identify",
        "sentences",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "grammar",
        "usage",
        "writing",
        "speaking"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": null,
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.1i",
      "description": "Use frequently occurring prepositions (e.g., during, beyond, toward). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, frequently occurring, prepositions, clarify, identify, sentences , demonstrate, command, conventions, standard English, grammar, usage, writing, speaking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Words in our language can be grouped into categories based on how we use them.",
            "Prepositions are used with a noun or pronoun to show direction, location, or time."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Prepositions help clarify a noun's relationship to another noun in a sentence.",
            "Prepositions usually come before a noun.",
            "Prepositions help readers understand where something or someone is located, when or when something happened, etc."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify prepositions in isolation and in sentences.",
            "Correctly use prepositions when speaking and writing.",
            "Determine which preposition should be used to complete a sentence."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "frequently occurring",
        "prepositions",
        "clarify",
        "identify",
        "sentences",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "grammar",
        "usage",
        "writing",
        "speaking"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": null,
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.1j",
      "description": "Produce and expand complete simple and compound declarative, interrogative, imperative, and exclamatory sentences in response to prompts. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: produce, expand, complete, simple, compound, declarative, interrogative, imperative, exclamatory, sentences, prompts, subject, verb, enhanced, conjunctions, adjectives, adverbs, complete thought, independent clause, distinguish, identify, demonstrate, command, conventions, standard English, grammar, usage, writing, speaking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Sentences are formed with a subject and verb.",
            "Sentences can be enhanced by adding conjunctions, adjectives, and adverbs.",
            "There are four types of sentences that serve different purposes.",
            "Declarative sentences tell something and end with a period.",
            "Interrogative sentences ask a question and usually begin with a question word (e.g., who, what, when, etc., and end with a question mark.",
            "Imperative sentence gives a command and ends with a period.",
            "Exclamatory sentence shows strong emotion and ends with an exclamation mark."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A complete simple sentence contains a subject and a verb and forms a complete thought.",
            "Compound sentences join two independent clauses or sentences.",
            "Compound sentence are formed when to sentences are joined using a conjunction and a comma.",
            "Compound sentences have more than one subject and predicate."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Distinguish between a complete simple and compound sentence.",
            "Identify complete simple and compound declarative, interrogative, imperative, and exclamatory sentences.",
            "In response to prompts, produce complete simple and compound declarative, interrogative, imperative, and exclamatory sentences.",
            "In response to prompts, expand complete simple and compound declarative, interrogative, imperative, and exclamatory sentences."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "produce",
        "expand",
        "complete",
        "simple",
        "compound",
        "declarative",
        "interrogative",
        "imperative",
        "exclamatory",
        "sentences",
        "prompts",
        "subject",
        "verb",
        "enhanced",
        "conjunctions",
        "adjectives",
        "adverbs",
        "complete thought",
        "independent clause",
        "distinguish",
        "identify",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "grammar",
        "usage",
        "writing",
        "speaking"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.2a",
      "description": "Capitalize dates and names of people. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: capitalize, dates, names of people, sentences, select, demonstrate, command, conventions, standard English, capitalization, punctuation, spelling, writing"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Some words should be capitalized.",
            "The first word in a sentence should be capitalized.",
            "The pronoun I should be capitalized.",
            "Proper names should be capitalized.",
            "Days of the week and months of the year should always be capitalized."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Dates should be capitalized.",
            "Dates consist of days of the week and/or months of the year.",
            "Names of people (first and last) should be capitalized."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Select words (dates and names of people) that are capitalized correctly.",
            "Capitalize dates in sentences.",
            "Capitalize names of people in sentences."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "capitalize",
        "dates",
        "names of people",
        "sentences",
        "select",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "capitalization",
        "punctuation",
        "spelling",
        "writing"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.2b",
      "description": "Use end punctuation for sentences. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, end punctuation, sentences, purpose, type, select, demonstrate, command, conventions, standard English, capitalization, punctuation, spelling, writing"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "All sentences have an end punctuation mark.",
            "Each end punctuation mark serves a different purpose."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "End punctuation is always used when writing a sentence.",
            "End punctuation serves a purpose.",
            "The type of end punctuation that is selected to be used depends on the type of sentence.",
            "End punctuation tells the reader that the sentence has ended."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the end punctuation mark an author uses to end a sentence.",
            "Explain why the end punctuation mark used was chosen.",
            "Select the correct end punctuation for the type of sentence that is written:",
            "o Place periods after declarative and imperative sentences.",
            "o Place question marks after interrogative sentences.",
            "o Place exclamation marks after exclamatory sentences.",
            "Use end punctuation correctly when writing different types of sentences."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "end punctuation",
        "sentences",
        "purpose",
        "type",
        "select",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "capitalization",
        "punctuation",
        "spelling",
        "writing"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.2c",
      "description": "Use commas in dates and to separate single words in a series. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, commas, dates, separate, single words, series, pause, saying, write, sentence, demonstrate, command, conventions, standard English, capitalization, punctuation, spelling, writing, individual"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A speaker pauses when saying a sentence with single words in a series.",
            "Dates are the month, day, and year."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A comma is used to separate the day from the year when writing a date.",
            "Commas are used to separate single words in a series.",
            "Commas create pauses when an individual speaks."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write a date with the day and year separated by a comma.",
            "Write a sentence with single words in a series separated by commas.",
            "When saying a sentence that contains commas, pause at the commas."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "commas",
        "dates",
        "separate",
        "single words",
        "series",
        "pause",
        "saying",
        "write",
        "sentence",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "capitalization",
        "punctuation",
        "spelling",
        "writing",
        "individual"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.2d",
      "description": "Use conventional spelling for words with common spelling patterns and for frequently occurring irregular words. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, conventional spelling, patterns, letters, sounds, phonics, simple words, correct, regular words, irregular words, demonstrate, command, conventions, standard English, capitalization, punctuation, writing"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Letters represent sounds.",
            "Some words can be spelled when you know the sounds the letters make.",
            "Some simple words can be spelled phonetically."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Words have a correct way to be spelled.",
            "Sometimes, words can be spelled correctly using knowledge of phonics.",
            "Other words are spelled correctly by not following phonetic rules."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Spell regular words correctly using common spelling patterns.",
            "Spell frequently occurring irregular words correctly."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "conventional spelling",
        "patterns",
        "letters",
        "sounds",
        "phonics",
        "simple words",
        "correct",
        "regular words",
        "irregular words",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "capitalization",
        "punctuation",
        "writing"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.2e",
      "description": "Spell untaught words phonetically, drawing on phonemic awareness and spelling conventions. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: spell, untaught words, phonics, phonemic awareness, spelling conventions, letters, sounds, correct, demonstrate, command, conventions, standard English, capitalization, punctuation, writing"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Letters represent sounds.",
            "Some words can be spelled when you know the sounds the letters make.",
            "Some simple words can be spelled phonetically.",
            "Words have a correct way to be spelled.",
            "Sometimes, words can be spelled correctly using knowledge of phonics.",
            "Other words are spelled correctly by not following phonetic rules."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Phonics and spelling conventions can be used to spell some unknown words.",
            "The position of letter pairs in a word can affect the pronunciation of the letters.",
            "Understand syllable patterns."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the phonetic pattern in words when spelling and/or writing words.",
            "Use knowledge of phonetic pattern to spell unknown words.",
            "Use knowledge of syllable patterns to correctly spell words orally or in writing.",
            "Use knowledge of phonograms (word families) when spelling orally or in writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "spell",
        "untaught words",
        "phonics",
        "phonemic awareness",
        "spelling conventions",
        "letters",
        "sounds",
        "correct",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "capitalization",
        "punctuation",
        "writing"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.4a",
      "description": "Use sentence-level context as a clue to the meaning of a word or phrase. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, sentence, context, clue, meaning, word, determine, clarify, new, unknown words, multiple-meaning words, phrases, context clues, analyzing, word parts, consulting, reference materials"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "New meanings of familiar words can be determined.",
            "Often the author will give clues in the text to help the reader figure out the meaning of an unknown word.",
            "Context clues are clues in text that the reader can use to determine meaning."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The context of the sentence can serve as a clue to determine the meaning of a word or phrase.",
            "Readers can reread the sentence and look for clues that help determine the meaning of a word."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use vocabulary strategies to determine the meaning of unknown words in a text.",
            "Reread a sentence to look for clues that help determine the meaning of the unknown word.",
            "o Look for synonym or antonyms"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "sentence",
        "context",
        "clue",
        "meaning",
        "word",
        "determine",
        "clarify",
        "new",
        "unknown words",
        "multiple-meaning words",
        "phrases",
        "context clues",
        "analyzing",
        "word parts",
        "consulting",
        "reference materials"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.4b",
      "description": "Use frequently occurring affixes as a clue to the meaning of a word. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, affixes, clue, meaning, word, determine, clarify, new, unknown words, multiple-meaning words, phrases, context clues, analyzing, word parts, consulting, reference materials"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Prefixes are word parts added to the beginning of a word that modify meaning.",
            "Suffixes are parts added to the end of a word that modify meaning.",
            "Affixes give a clue as to the meaning of a word."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Words can be built with a root word and affixes.",
            "Affixes give a clue to the meaning of a word.",
            "Prefixes and suffixes have meanings.",
            "When added to words, prefixes and suffixes change the meaning of unknown words."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify grade appropriate prefixes and suffixes.",
            "Identify words with grade appropriate prefixes and suffixes.",
            "Determine words with and without affixes.",
            "Create new words using grade appropriate prefixes and suffixes.",
            "Determine the meaning of a word based on its prefix or suffix."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "affixes",
        "clue",
        "meaning",
        "word",
        "determine",
        "clarify",
        "new",
        "unknown words",
        "multiple-meaning words",
        "phrases",
        "context clues",
        "analyzing",
        "word parts",
        "consulting",
        "reference materials"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.4c",
      "description": "Identify frequently occurring root words (e.g., look) and their inflectional forms (e.g., looks, looked, looking). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: identify, root words, inflectional forms, meaning, unknown word, clarify, new, unknown words, multiple-meaning words, phrases, context clues, analyzing, word parts, consulting, reference materials"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Affixes are word parts that are added to a root word or base word.",
            "Prefixes and suffixes are affixes.",
            "Affixes change the meaning of the root or base word.",
            "A root word is the original word and cannot be broken into smaller words or word parts."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Knowing the meaning of a root word and inflections can help determine the meaning of a word.",
            "Readers must learn to identify inflectional endings and then determine when an inflectional ending is used with a root word."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Read a word and determine if the word has an affix (prefix or suffix).",
            "Identify the root word.",
            "Identify the affix (prefix or suffix).",
            "Create new words by adding affixes (prefixes or suffixes) to the root word.",
            "Isolate the root word from the affix."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "identify",
        "root words",
        "inflectional forms",
        "meaning",
        "unknown word",
        "clarify",
        "new",
        "unknown words",
        "multiple-meaning words",
        "phrases",
        "context clues",
        "analyzing",
        "word parts",
        "consulting",
        "reference materials"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.5a",
      "description": "Sort words into categories (e.g., colors, clothing) to gain a sense of the concepts the categories represent. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: sort, common, objects, categories, shapes, foods, sense, concepts, represent, demonstrates, understanding, word relationships, nuances, word meanings, figurative language"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Words in our language can be grouped into categories based on how we use the words.",
            "Categories are groups that share a characteristic in common.",
            "Sorting common objects into categories helps to gain a sense of the concepts the categories represent."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Words can be sorted into groups or categories with other words in which they share a similar characteristic.",
            "Gaining a sense of the concept categories represented helps in understanding word relationships and nuances in word meanings.",
            "Sorting helps one to understand similarities among things in the world."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Sort words or items into given categories.",
            "Determine which word, picture, or item fits into a specific category.",
            "Identify a specific category by examining the objects within the category."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "sort",
        "common",
        "objects",
        "categories",
        "shapes",
        "foods",
        "sense",
        "concepts",
        "represent",
        "demonstrates",
        "understanding",
        "word relationships",
        "nuances",
        "word meanings",
        "figurative language"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.5b",
      "description": "Define words by category and by one or more key attributes (e.g., a duck is a bird that swims; a tiger is a large cat with stripes). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: define, words, category, key attribute, shows, demonstrate, understanding, word relationships, nuances, word meanings, figurative language"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Words can be classified into categories.",
            "Words can have more than one meaning.",
            "Words in our language can be grouped into categories based on how we use them.",
            "Words in our language are grouped according to the different parts of speech."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Defining words by category helps in understanding word relationships and nuances in word meanings.",
            "How to identify the meaning of a word based on its part of speech.",
            "There are eight parts of speech.",
            "When we use words, they fit into one of the eight parts of speech.",
            "The meaning of a word can vary depending on the part of speech."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Show understanding of word relationships and nuances in word meanings by defining words by category.",
            "Show understanding of word relationships and nuances in word meanings by defining words by one or more key attributes.",
            "Determine if a word is used as a specific part of speech such as a noun, verb, adjective, or adverb.",
            "Determine the meaning of the word based on its usage."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "define",
        "words",
        "category",
        "key attribute",
        "shows",
        "demonstrate",
        "understanding",
        "word relationships",
        "nuances",
        "word meanings",
        "figurative language"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.5c",
      "description": "Identify real-life connections between words and their use (e.g., note places at home that are cozy). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: identify, real-life connections, words, use, shows, demonstrate, understanding, word relationships, nuances, word meanings, figurative language"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Words are a part of our daily lives.",
            "Words are used to tell stories, describe feelings, etc.",
            "Words are a vital part of how we communicate.",
            "Words make up our personal vocabulary.",
            "Vocabulary refers to the words we know how to say and those for which we know the meaning."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Words are useful when describing things that we know about.",
            "Words should be used to tell about an experience.",
            "Words are used to explain how we feel, what we think, and what we want."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify if a word is known or unknown when it is read or heard.",
            "Tell about a time when the word was used by the student or when the student heard someone use the word.",
            "Tell about a real-life experience in which the word (and/its meaning) was experienced by the student:",
            "o I went to the park with my family. I saw trees at the park. I saw people walking at the park. I played with my sister at the park."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "identify",
        "real-life connections",
        "words",
        "use",
        "shows",
        "demonstrate",
        "understanding",
        "word relationships",
        "nuances",
        "word meanings",
        "figurative language"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.5d",
      "description": "Distinguish shades of meaning among verbs differing in manner (e.g., look, peek, glance, stare, glare, scowl) and adjectives differing in intensity (e.g., large, gigantic) by defining or choosing them or by acting out the meanings. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: distinguish, shades of meaning, verbs, differing, adjectives, intensity, defining, choosing, acting out, words, defines, chooses, acts out, demonstrate, figurative language, word relationships, nuances, word meaning"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Some words can have very similar meanings.",
            "Synonyms are words that have similar meanings.",
            "Some verbs and adjectives have synonyms."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Verbs that differ in manner have shades of meaning.",
            "Adjectives can differ in intensity.",
            "The shade of meaning of a verb and/or adjective will determine which verb and/or adjective a writer will select for a piece of writing."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Define the different shades of meaning among verbs differing in manner and/or adjectives differing in intensity.",
            "Determine how synonyms differ by acting out the meaning of each word.",
            "Choose the correct shade of meaning among verbs differing in manner and/or adjectives differing in intensity.",
            "Act out the meaning of the different synonyms (shades of meaning) among verbs and/or adjectives differing in intensity."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "distinguish",
        "shades of meaning",
        "verbs",
        "differing",
        "adjectives",
        "intensity",
        "defining",
        "choosing",
        "acting out",
        "words",
        "defines",
        "chooses",
        "acts out",
        "demonstrate",
        "figurative language",
        "word relationships",
        "nuances",
        "word meaning"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "1",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.1.6",
      "description": "Use words and phrases acquired through conversations, reading and being read to, and responding to texts, including using frequently occurring conjunctions to signal simple relationships (e.g., because). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, words, phrases, acquired, conversations, reading, being read to, responding to texts, frequently occurring conjunctions, simple relationships, newly, demonstrates, statement"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.6",
      "grade": null,
      "description": "Acquire and use accurately a range of general academic and domain-specific words and phrases sufficient for reading, writing, speaking, and listening at the college and career readiness level; demonstrate independence in gathering vocabulary knowledge when encountering an unknown term important to comprehension or expression."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Words and phrases can be learned through direct and indirect manners.",
            "New words and phrases can be learned by listening to conversations, reading, and being read to.",
            "Words and phrases that are heard during these activities can become a part of a person's personal lexicon.",
            "Words and phrases in a person's personal lexicon can be used when that person speaks or writes."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Newly acquired words and phrases including frequently occurring conjunctions should be used to help with reading, writing, speaking, and listening."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Listen to teacher read alouds, and uses new words when speaking and writing.",
            "Learn new words and phrases when reading, and uses new words when speaking and writing.",
            "Listen to others talking and use new words when speaking and writing.",
            "Keep a journal of new words and phrases.",
            "Show an increase in vocabulary when speaking and writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "words",
        "phrases",
        "acquired",
        "conversations",
        "reading",
        "being read to",
        "responding to texts",
        "frequently occurring conjunctions",
        "simple relationships",
        "newly",
        "demonstrates",
        "statement"
      ]
    }
  }
]