[
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.12.1",
      "description": "Cite strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text, including determining where the text leaves matters uncertain. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: cite, evidence, analysis, inference, detail, annotate, support, uncertain"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.1",
      "grade": null,
      "description": "Read closely to determine what the text says explicitly and to make logical inferences from it; cite specific textual"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to cite textual evidence.",
            "How to identify key details that contribute to key ideas.",
            "How to identify unfamiliar words.",
            "How to question the author's purpose.",
            "How to predict what will happen next.",
            "How to identify potential bias and false information in text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "An author may choose to leave the plot unresolved or purposefully vague.",
            "The author's choice of an unresolved or vague resolution has an intentional effect on the audience (e.g., disappointment, confusion, suspenseful anticipation of a sequel, etc.).",
            "An author may also choose to leave matters within the text uncertain. A reader must identify why the author would make such a choice (e.g., to build suspense, to gloss over a societal taboo, to direct the reader's focus elsewhere, etc.)"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Annotate a text while reading.",
            "Make inferences based on textual evidence.",
            "Distinguish important facts from \"extra\" details.",
            "Identify strong evidence to support an inference or claim from a text.",
            "Identify and explain where within a text the author leaves matters uncertain.",
            "Cite evidence from a text both verbally and with standard citation format (i.e. MLA, APA, Turabian, etc.)."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "cite",
        "evidence",
        "analysis",
        "inference",
        "detail",
        "annotate",
        "support",
        "uncertain"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.12.2",
      "description": "Determine themes or central ideas of a text and analyze in detail their development over the course of the text, including how details of a text interact and build on one another to produce a complex account; provide an accurate summary of the text based upon this analysis. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) Interact with and build upon one another"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.2",
      "grade": null,
      "description": "Determine central ideas or themes of a text and analyze their development; summarize the key supporting details"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Students understand that an accurate summary is free from bias or personal opinion and must utilize specific details from the text.",
            "Students identify the themes or central ideas of a text and understand that multiple themes may emerge over the course of a text as the author develops:",
            "o Plot, sub-plots, or parallel plots",
            "o Characters",
            "o Conflict"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Often, an author develops two or more themes or central ideas in a text.",
            "Specific details in a text should be analyzed and inferences should be made to determine the themes in a text.",
            "The complexity of the text increases as multiple themes or central ideas emerge and interact with and build upon one another.",
            "Two or more works by the same author, from the same period, from different cultures, presented in different forms, can have similar themes.",
            "An analysis of multiple themes or central ideas in a text can be synthesized to create an accurate summary of the text.",
            "An analysis of multiple themes or central ideas in a text can be"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Trace the development of the themes or central ideas by identifying specific details from the text.",
            "Analyze the development of multiple themes in a text.",
            "Synthesize the analysis of two or more themes or central ideas of a text.",
            "Use a range of textual evidence with various text complexities to support interpretations of texts.",
            "Compose an accurate summary of a text that includes how the central ideas/themes:",
            "o Emerge",
            "o Are shaped",
            "o Are refined by specific details"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.12.3",
      "description": "Analyze the impact of the author's choices regarding how to develop and relate elements of a literary text (e.g., where a story is set, how the action is ordered, how the characters are introduced and developed). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: analyze, complex character, motivation, conflict, interact, plot, theme, direct, indirect, static, dynamic, flat, round, protagonist, antagonist, sequence, setting"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.3",
      "grade": null,
      "description": "Analyze how and why individuals, events, and ideas develop and interact over the course of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Authors develop characters to be complex and characters can change over the course of the text.",
            "Authors intentionally develop some characters more fully than others in order to advance the plot in a certain way (author's purpose).",
            "Complex characters and their character traits.",
            "Character motivation.",
            "Understand that character interactions advance the plot and theme of the text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors advance the plot and/or development of the theme through the decisions, actions, and dialogue of the character(s).",
            "Authors develop a complex text through intentional decisions regarding literary elements:",
            "o Setting",
            "o Sequence",
            "o Characterization",
            "o Diction",
            "o Syntax",
            "o Word choice",
            "Characters with different motivations are often classified as:",
            "o Protagonist",
            "o Antagonist"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Analyze complex characters in a text and provide textual evidence that shows their complexity.",
            "Evaluate the author's choices for developing literary elements.",
            "Examine the motivation(s) of characters within a text and determine when those motivations are conflicting.",
            "Examine how an author's choices regarding characterization, setting, sequence, etc., impact the text as a whole."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "analyze",
        "complex character",
        "motivation",
        "conflict",
        "interact",
        "plot",
        "theme",
        "direct",
        "indirect",
        "static",
        "dynamic",
        "flat",
        "round",
        "protagonist",
        "antagonist",
        "sequence",
        "setting"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.12.4",
      "description": "Determine the meaning of words and phrases as they are used in the text, including figurative and connotative meanings; analyze the impact of specific word choices on meaning and tone, including words with multiple meanings or language that is particularly fresh, engaging, or beautiful. (Include Shakespeare as well as other authors.) Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Connotation, denotation, figurative meaning/language, formal and informal tone, bias, impact, context, aesthetic"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.4",
      "grade": null,
      "description": "Interpret words and phrases as they are used in a text, including determining technical, connotative, and figurative"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Understand that the cumulative impact of word choice directly relates to the tone and theme of the text.",
            "How to identify sound devices (i.e., alliteration, assonance, consonance, etc.), rhyme, rhythm, and repetition to develop tone."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "In crafting a text, an author chooses words and phrases to contribute to the overall meaning and aesthetic of the text.",
            "A reader should closely examine particularly descriptive, creative, or original manipulation of language and how it contributes to the text as a whole.",
            "Over the course of a text, an author's word choices can establish:",
            "o Formal vs. informal tone",
            "o Sense of time and place",
            "o Potential bias"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Define unfamiliar and/or critical words within a text through context \"clues.\"",
            "Translate figurative language into concrete language.",
            "List multiple meanings of a word or phrase and identify the author's intended meaning based on connotation.",
            "Identify the tone of a text.",
            "Explain how an author's word choice and/or use of figurative or connotative meaning contribute to the meaning and tone of a specific text.",
            "Evaluate an author's word choice in terms of aesthetic appeal and/or originality."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Connotation",
        "denotation",
        "figurative meaning/language",
        "formal and informal tone",
        "bias",
        "impact",
        "context",
        "aesthetic"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.12.5",
      "description": "Analyze how an author's choices concerning how to structure specific parts of a text (e.g., the choice of where to begin or end a story, the choice to provide a comedic or tragic resolution) contribute to its overall structure and meaning as well as its aesthetic impact. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: structure, plot, mystery, tension, surprise, flashback, flash-forward, beginning in medias res, foreshadowing, pacing, dramatic effect, manipulation, aesthetic"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.5",
      "grade": null,
      "description": "Analyze the structure of texts, including how specific sentences, paragraphs, and larger portions of the text"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Understand that parallel plots can exist within the same text, and those plots often relate to or provide contrast to one another (i.e., the love story between Romeo and Juliet paired with the subplot of the feud between the Montagues and Capulets).",
            "Manipulation of time contributes to the overall tone and mood of a text:",
            "o Flashback",
            "o Flashforward",
            "o Beginning in medias res",
            "o Foreshadowing",
            "o Pacing"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors not only choose an overall structure for a text, but also they structure specific parts (e.g., introduction, resolution, flashback, etc.) of the text to contribute to the overall meaning and/or aesthetic impact of the text.",
            "Aesthetic refers to a concept of beauty, sometimes specific to a time and/or place. For example, the seventeenth-century aesthetic would be very different from the post-modern aesthetic.",
            "Authors hold ultimate control over the structure of a text (i.e., plot, time, etc.); therefore, an author's manipulation of that structure is intentional."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Analyze and explain how an author's choices (e.g., plot structure, order of events, manipulation of time, etc.) contribute to the overall structure of a text.",
            "Analyze and explain how an author structures a specific part of a text to contribute to the overall structure, meaning, and aesthetic of a text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "structure",
        "plot",
        "mystery",
        "tension",
        "surprise",
        "flashback",
        "flash-forward",
        "beginning in medias res",
        "foreshadowing",
        "pacing",
        "dramatic effect",
        "manipulation",
        "aesthetic"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.12.6",
      "description": "Analyze a case in which grasping point of view requires distinguishing what is directly stated in a text from what is really meant (e.g., satire, sarcasm, irony, or understatement). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Point of view, satire, sarcasm, irony, understatement, grasping point of view"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.6",
      "grade": null,
      "description": "Assess how point of view or purpose shapes the content and style of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Understand that point of view is the vantage point from which a text is presented.",
            "Over the course of a text, the actual theme or central idea may change from what is perceived at the beginning of the text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A grasping point of view implies that the speaker may mean something entirely different from what is being said in the text.",
            "o Satire",
            "o Sarcasm",
            "o Irony",
            "o Understatement"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify and explain the author's perspective using textual evidence of what is explicitly stated and what is implied.",
            "Identify satire, sarcasm, irony, or understatement in a text.",
            "Explain how an author's grasping point of view contributes to the theme or central ideas of the text as a whole."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Point of view",
        "satire",
        "sarcasm",
        "irony",
        "understatement",
        "grasping point of view"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.12.7",
      "description": "Analyze multiple interpretations of a story, drama, or poem (e.g., recorded or live production of a play or recorded novel or poetry), evaluating how each version interprets the source text. (Include at least one play by Shakespeare and one play by an American dramatist.) Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Representation, artistic mediums, interpretation, source text"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.7",
      "grade": null,
      "description": "Integrate and evaluate content presented in diverse formats and media, including visually and quantitatively, as"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Understand that a source material refers to a text that is referenced in a later work.",
            "How to identify artistic mediums as (but not limited to):",
            "o Film",
            "o Drama",
            "o Drawing",
            "o Painting",
            "o Sculpture",
            "o Song",
            "o Poetry"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Different versions of a story, drama, or poem are subject to the author/artist's interpretation as well as the limitations of the chosen medium."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Compare and contrast multiple interpretations of a story, drama, or poem.",
            "Analyze and evaluate each interpretation based on the source text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Representation",
        "artistic mediums",
        "interpretation",
        "source text"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.12.8",
      "description": "(Not applicable to literature) Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD:"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.8",
      "grade": null,
      "description": "Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": []
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": []
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": []
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.12.9",
      "description": "Demonstrate knowledge of eighteenth-, nineteenth- and early-twentieth-century foundational works of American literature, including how two or more texts from the same period treat similar themes or topics. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Source material, draw(s) on, transform, theme, topic, subject, allusion, allegory, parody, parable, metaphor, simile"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Understand that foundational works of literature are those \"essential texts\" that are seen as the cornerstone of American society.",
            "Students are familiar with the historical periods (e.g., eighteenth-, nineteenth-, and twentieth-centuries)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "American literature tends to mirror the fundamental beliefs and concerns of the period in which it was written.",
            "During a given period, authors often wrote about similar themes, topics, concerns, and societal norms with, perhaps, different perspectives."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify common themes and/or topics with two or more texts from the same historical period utilizing American literature in the eighteenth, nineteenth, and early twentieth centuries.",
            "Evaluate how two or more texts from the same period treat similar themes and/or topics."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Source material",
        "draw(s) on",
        "transform",
        "theme",
        "topic",
        "subject",
        "allusion",
        "allegory",
        "parody",
        "parable",
        "metaphor",
        "simile"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Literature",
    "reporting_category": "Range of Reading and Level of Text Complexity",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.12.10",
      "description": "By the end of grade 12, read and comprehend literature, including stories, dramas, and poems, at the high end of the grades 12-CCR text complexity band independently and proficiently. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Comprehend, proficiently, scaffolding, key ideas, details, structural elements, grade-level appropriate"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.10",
      "grade": null,
      "description": "Read and comprehend complex literary and informational texts independently and proficiently."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Students are able to identify in a literary text:",
            "o Key ideas and details",
            "o Structural elements",
            "o Intentional choices made by the author (word choice, figurative/connotative meaning, etc.)"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Students should be able to comprehend and analyze:",
            "o Key ideas and details",
            "o Structural elements",
            "o Intentional choices made by the author (word choice, figurative/ connotative meaning, etc.)"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Read and demonstrate comprehension of grade-level appropriate literature.",
            "Read and demonstrate comprehension of high-end grade-level appropriate literature with scaffolding as needed."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Comprehend",
        "proficiently",
        "scaffolding",
        "key ideas",
        "details",
        "structural elements",
        "grade-level appropriate"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.12.1",
      "description": "Cite strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text, including determining where the text leaves matters uncertain. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Cite, evidence, analysis, inference, detail, annotate, support, uncertain"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.1",
      "grade": null,
      "description": "Read closely to determine what the text says explicitly and to make logical inferences from it; cite specific textual"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Understand that authors include critical and extraneous details.",
            "How to identify not only key ideas, but also the details that contribute to those key ideas to thoroughly analyze a text.",
            "Through annotation, students:",
            "o Identify unfamiliar words",
            "o Question the author's purpose",
            "o Predict what will happen next",
            "o Identify potential bias and false information"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "In a text, an author may choose to leave elements of the text unresolved or purposefully vague.",
            "The author's choice of an unresolved or vague conclusion has an intentional effect on the audience (e.g., disappointment, confusion, curiosity, suspenseful anticipation, etc.)",
            "An author may also choose to leave matters within a text uncertain. A close reader must identify and grapple with why the author would make such a choice (e.g., to build suspense, to gloss over a societal taboo, to direct the reader's focus elsewhere, etc.)"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Annotate a text while reading.",
            "Make inferences based on textual evidence.",
            "Distinguish important facts from \"extra\" details.",
            "Identify strong evidence to support an inference or claim from a text.",
            "Identify and explain where within a text the author leaves matters uncertain.",
            "Cite evidence from a text both verbally and with standard citation format (i.e., MLA, APA, Turabian, etc.)."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Cite",
        "evidence",
        "analysis",
        "inference",
        "detail",
        "annotate",
        "support",
        "uncertain"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.12.2",
      "description": "Determine two or more central ideas of a text and analyze in detail their development over the course of the text, including how they interact and build on one another to provide a complex analysis; provide an accurate summary of the text based upon this analysis. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: theme, central idea, analyze, detail, development, emerges, refined, précis, objective summary, bias"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.2",
      "grade": null,
      "description": "Determine central ideas or themes of a text and analyze their development; summarize the key supporting details"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The central idea (or main idea) of an informational text is the recurring, specific concept on which the key details of the text focus.",
            "Acknowledge that informational texts often follow predictable patterns or outlines, and that reverse outlining may be helpful in determining the central idea and identifying the specific detail that support it.",
            "Provide an accurate summary."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A writer develops multiple central ideas in a text.",
            "Specific details in a text should be analyzed, and inferences should be made to determine central ideas in a text.",
            "Multiple central ideas in a text can be synthesized to create an accurate summary of the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Articulate central ideas of a text.",
            "Trace the development of the central ideas by identifying specific details from throughout the text.",
            "Analyze the development of multiple central ideas.",
            "Use a range of textual evidence with various text complexities to support interpretations of a text.",
            "Compose an accurate summary of a text that includes how the central ideas:",
            "o Emerge",
            "o Are shaped",
            "o Are refined by specific details"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "theme",
        "central idea",
        "analyze",
        "detail",
        "development",
        "emerges",
        "refined",
        "précis",
        "objective summary",
        "bias"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.12.3",
      "description": "Analyze a complex set of ideas or sequence of events and explain how specific Individuals, ideas, or events interact and develop over the course of the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: analysis, series, connections, evidence, details, sequence, purpose, interactions"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.3",
      "grade": null,
      "description": "Analyze how and why individuals, events, and ideas develop and interact over the course of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Authors use text structures (i.e., cause and effect, problem and solution, procedures, etc.) to achieve the desired goal for writing.",
            "Authors determine the sequence of information that most effectively accomplishes their purpose or goal in writing.",
            "Understand that an author may choose to omit information that does not support or lead to his/her desired conclusion.",
            "Evidence and/or details provided in a text are directly related to the purpose of the text (scientific article vs. diary)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Within a complex text, authors create interactions between individuals, ideas, and events in order to support the central idea and purpose of the text.",
            "Over the course of a text, individuals, ideas, and events develop and change."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Outline the series of ideas or events presented in a text.",
            "Distinguish between important facts (based on the author's purpose for writing) and extraneous information.",
            "Identify the organizational structure used in a text, and evaluate how effectively that structure accomplishes the purpose for writing.",
            "Identify relationships between individuals, ideas, and events, and explain how these interactions contribute to the meaning of the text as a whole."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "analysis",
        "series",
        "connections",
        "evidence",
        "details",
        "sequence",
        "purpose",
        "interactions"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.12.4",
      "description": "Determine the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings; analyze how an author uses and refines the meaning of a key term or terms over the course of a text (e.g., how Madison defines faction in Federalist No. 10). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: connotation, denotation, figurative meaning/language, tone, formal and informal tone, bias, cumulative impact, context, jargon, technical meaning"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.4",
      "grade": null,
      "description": "Interpret words and phrases as they are used in a text, including determining technical, connotative, and figurative"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Words often have multiple meanings (connotation, denotation, figures of speech).",
            "Technical meaning refers to the words (or jargon) specific to a discipline or skill.",
            "Students understand that authors craft texts by specifically selecting words and phrases that contribute not only to the reader's understanding, but also to the central idea of the text as a whole.",
            "Over the course of a text, an author's word choices can establish:",
            "o Formal vs. informal tone",
            "o Sense of time and place",
            "o Potential bias"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors of informational texts use specific words and phrases to effectively \"target\" the intended audience (i.e. using specific, technical words in a textbook).",
            "Over the course of a text, an author may repeatedly use and refine a particular word. In such cases, readers must understand the entire text to capture the nuances of the word.",
            "Tone is the overall attitude toward the topic and audience that is implied in a literary text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Define unfamiliar and/or critical words within a text through context \"clues.\"",
            "List multiple meanings of a word or phrase and identify the author's intended meaning based on textual clues.",
            "Identify the tone of a text.",
            "Explain how an author's word choice and/or use of figurative or connotative meaning contribute cumulatively to the meaning and tone of a specific text.",
            "Identify words or phrases that are used repeatedly within a text, and explain how the meaning changes or develops over the course of the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "connotation",
        "denotation",
        "figurative meaning/language",
        "tone",
        "formal and informal tone",
        "bias",
        "cumulative impact",
        "context",
        "jargon",
        "technical meaning"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.12.5",
      "description": "Analyze and evaluate the effectiveness of the structure an author uses in his or her exposition or argument, including whether the structure makes points clear, convincing, and engaging. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Developed, refined, claims, structural segments, sequential order, chronological order, procedural order, cause and effect, problem and solution, spatial order, order of importance, description, syntax, diction"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.5",
      "grade": null,
      "description": "Analyze the structure of texts, including how specific sentences, paragraphs, and larger portions of the text"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Students know that an author's claim is the position he/she takes regarding a given topic.",
            "Students know that authors use specific text structures to organize ideas and claims:",
            "o Sequential Order",
            "o Chronological Order",
            "o Procedural Order",
            "o Cause and Effect",
            "o Problem and Solution",
            "o Spatial Order",
            "o Order of Importance",
            "o Description",
            "Students know the structural segments of a text (i.e. sentences, paragraphs, etc.) develop and refine the larger text structure and the overall aim of the text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors select structures for both the exposition and actual argument to be clear, convincing, and engaging.",
            "The author's attempts at clarity, persuasion, and engagement are not always effective and may lead to confusion and disinterest.",
            "A critical reader will analyze the structure used in the exposition and/or argument to determine if a different structure would have been more effective."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify and explain the structural patterns within a text.",
            "o Sentence structure",
            "o Organization patterns",
            "o Syntax",
            "o Diction",
            "Analyze and explain how an author's ideas or claims are developed and refined by breaking down individual sections of the text.",
            "Evaluate the effectiveness of the author's exposition or argument in terms of clarity, persuasion, and engagement by analyzing the structure of a text.",
            "Identify if an author was/was not effectively clear, convincing, and engaging and explain why or why not."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Developed",
        "refined",
        "claims",
        "structural segments",
        "sequential order",
        "chronological order",
        "procedural order",
        "cause and effect",
        "problem and solution",
        "spatial order",
        "order of importance",
        "description",
        "syntax",
        "diction"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.12.6",
      "description": "Determine an author's point of view or purpose in a text in which the rhetoric is particularly effective, analyzing how style and content contribute to the power, persuasiveness, or beauty of the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: argument, claim, rhetoric, purpose, point of view, style, persuasiveness"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.6",
      "grade": null,
      "description": "Assess how point of view or purpose shapes the content and style of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Understand that an argument or claim is often backed with reasoned, logical evidence.",
            "How to acknowledge that authors write from a specific point of view with a specific purpose in mind.",
            "Rhetoric refers to writing or speech that is intentionally persuasive and can be reasoned and logical, or it can appeal to emotions (i.e., propaganda techniques).",
            "How to recognize that authors may employ rhetorical techniques to advance their point of view:",
            "o Appeals to emotion",
            "o Appeals to intelligence",
            "o Appeals to authority",
            "o Exaggeration",
            "o Logical fallacies"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "When an author's use of rhetoric is particularly effective, the combination of style and content create power, persuasiveness, and/or beauty within the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the author's point of view or purpose in a text.",
            "Identify and evaluate the author's use of rhetoric and how that rhetoric advances or detracts from the point of view or purpose.",
            "Evaluate and explain the effectiveness of rhetoric in terms of style and content, especially when such rhetoric produces a sense of power, persuasiveness, or beauty."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "argument",
        "claim",
        "rhetoric",
        "purpose",
        "point of view",
        "style",
        "persuasiveness"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.12.7",
      "description": "Integrate and evaluate multiple sources of information presented in different media or formats (e.g., visually, quantitatively) as well as in words in order to address a question or solve a problem. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Mediums, multimedia, details, emphasized, marginalized, purpose, integrate, research question, credibility"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.7",
      "grade": null,
      "description": "Integrate and evaluate content presented in diverse formats and media, including visually and quantitatively, as"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "In presenting accounts of the same subject in different medium, writers/producers/ etc., make choices as to which details to emphasize, marginalize, or exclude.",
            "When evaluating which details are emphasized, they must carefully consider the purpose for writing/presenting (i.e., to inform, to entertain, to persuade)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Research questions and problems can be addressed with more than printed words.",
            "Writers/presenters can and should integrate a variety of source material to effectively answer research questions or solve problems.",
            "As with print sources, multimedia sources must be evaluated for reliability, credibility, and effectiveness in supporting the author's purpose."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Utilize a variety of sources of information from different formats (e.g., print, digital, video, audio, etc.) to address a question and/or solve a research problem.",
            "Evaluate the efficacy, reliability, and credibility of multiple sources of information."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Mediums",
        "multimedia",
        "details",
        "emphasized",
        "marginalized",
        "purpose",
        "integrate",
        "research question",
        "credibility"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.12.8",
      "description": "Delineate and evaluate the reasoning in seminal U.S. texts, including the application of constitutional principles and use of legal reasoning (e.g., in U.S. Supreme Court majority opinions and dissents) and the premises, purposes, and arguments in works of public advocacy (e.g., The Federalist, presidential addresses). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Delineate, evaluate, argument, claims, valid, relevant, sufficient, false statements, fallacious reasoning, rhetoric, constitutional principles, premise, purpose, public advocacy"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.8",
      "grade": null,
      "description": "Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "An argument is a reasoned, evidence-based position on a debatable topic.",
            "A claim is a specific detail or piece of evidence provided to support an argument.",
            "An effective argument depends upon valid reasoning and relevant, sufficient evidence.",
            "How to recognize that false statements and fallacious reasoning (reasoning contrary to fact) weaken even the most appealing argument.",
            "Authors use rhetoric (both positive and negative) to further advance an argument."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Throughout U.S. history, rhetoric and legal reasoning have been used in seminal documents.",
            "Seminal means to be influential, formative, groundbreaking, original, and/or innovative.",
            "The Constitution informs many literary nonfiction texts that form the foundation of American literature:",
            "o Presidential addresses",
            "o Court rulings",
            "o Opinion papers",
            "o Etc."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the primary argument of a seminal U.S. document, and trace the specific claims that support the argument, paying particular attention to the document's relationship to constitutional principles and legal reasoning.",
            "Assess the reasoning and evidence provided to support a claim and/or argument.",
            "Distinguish between valid reasoning and fallacious reasoning."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Delineate",
        "evaluate",
        "argument",
        "claims",
        "valid",
        "relevant",
        "sufficient",
        "false statements",
        "fallacious reasoning",
        "rhetoric",
        "constitutional principles",
        "premise",
        "purpose",
        "public advocacy"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.12.9",
      "description": "Analyze seventeenth-, eighteenth-, and nineteenth-century foundational U.S. documents of historical and literary significance for their themes, purposes, and rhetorical features. Such documents might include The Declaration of Independence, the Preamble to the Constitution, the Bill of Rights, and Lincoln's Second Inaugural Address. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Seminal, significance, related themes and concepts, rhetoric, context, bias, purpose"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The context of historical documents.",
            "Tone, syntax, and mood affect the meaning of foundational documents.",
            "Influential, historical U.S. documents often deal with similar themes and concepts.",
            "The treatment of themes and concepts depends a great deal on the perspective and purpose of the author and text structure.",
            "Rhetorical devices impact the meaning and purpose of foundational documents."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Foundational documents address common themes, concepts, and rhetorical features.",
            "Critical examination of foundational documents will reveal potential biases and author's purpose.",
            "Historical documents will contain elements of historical time periods.",
            "An analysis of the theme and text structure of a foundational document will reveal the author's purpose.",
            "Rhetorical features in foundational documents impact the meaning of the document."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Analyze U.S. documents of historical and literary significance in terms of literary merit (diction, syntax, word choice, rhetoric, etc.).",
            "Evaluate how historically significant documents address related themes and concepts.",
            "Evaluate the purposes and rhetorical features in foundational U.S. documents of literary and historical significance."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Seminal",
        "significance",
        "related themes and concepts",
        "rhetoric",
        "context",
        "bias",
        "purpose"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Reading Informational Text",
    "reporting_category": "Range of Reading and Level of Text Complexity",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.12.10",
      "description": "By the end of grade 12, read and comprehend literary nonfiction at the high end of the grades 12-CCR text complexity band independently and proficiently. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: comprehend, proficiently, scaffolding, key ideas, details, structural elements, grade-level appropriate"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.10",
      "grade": null,
      "description": "Read and comprehend complex literary and informational texts independently and proficiently."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify in a literary nonfiction text:",
            "o Key ideas and details",
            "o Structural elements",
            "o Intentional choices made by the author (i.e., word choice, figurative/ connotative meaning, etc.)",
            "Literary nonfiction can be presented in various mediums, such as:",
            "o Text/print",
            "o Photographs",
            "o Illustrations",
            "o Film",
            "o Audio recording"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to comprehend and analyze:",
            "o Key ideas and details",
            "o Structural elements",
            "o Intentional choices made by the author (word choice, figurative/connotative meaning, etc.)"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Read and demonstrate comprehension of grade-level appropriate informational literature in a variety of formats.",
            "Read and demonstrate comprehension of high-end grade-level appropriate literature with scaffolding as needed at the high end of the range."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "comprehend",
        "proficiently",
        "scaffolding",
        "key ideas",
        "details",
        "structural elements",
        "grade-level appropriate"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.1a",
      "description": "Introduce precise, knowledgeable claim(s), establish the significance of the claim(s), distinguish the claim(s) from alternate or opposing claims, and create an organization that logically sequences claim(s), counterclaims, reasons, and evidence. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: argument, precise, claim, counterclaim, organization, reasons, evidence, substantiate, support, acknowledge"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "An argument is a reasoned, logical way of demonstrating that the writer's position, belief, or conclusion is valid.",
            "A claim is a specific opinion or viewpoint expressed by a writer; a counterclaim is an opinion or viewpoint that is different from that of the writer.",
            "Reasons and evidence are provided to support a claim.",
            "Arguments are used to:",
            "o Change the reader's point of view",
            "o Bring about some action on the reader's part",
            "o Ask the reader to accept the writer's evaluation of a topic"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "In presenting an argument to a particular audience, a writer must clearly establish the significance of the claim in relation to that audience.",
            "A strong argument acknowledges and disproves counterclaims.",
            "Logical organization is required to show the relationship and significance of claim(s), counterclaims, reasons, and evidence."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Choose a stance from which to argue.",
            "Write precise claim(s) in response to a specific topic.",
            "Identify and explain the significance of a claim in relation to the intended audience.",
            "Supply reasoned evidence to disprove/discredit opposing claims (counterclaims) when stating alternate or opposing claims within writing.",
            "Organize ideas to show the relationship between claim(s), counterclaims, reasons, and evidence."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "argument",
        "precise",
        "claim",
        "counterclaim",
        "organization",
        "reasons",
        "evidence",
        "substantiate",
        "support",
        "acknowledge"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.1b",
      "description": "Develop claim(s) and counterclaims fairly and thoroughly, supplying the most relevant evidence for each while pointing out the strengths and limitations of both in a manner that anticipates the audience's knowledge level, concerns, values, and possible biases. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: claim, counterclaim, supply, anticipate, knowledge level, concerns, bias, values"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A claim is a specific opinion or viewpoint; a counterclaim is an opinion or viewpoint that is different from that of the writer.",
            "Reasons and evidence are provided to support and develop a claim.",
            "Task and audience should inform the decisions of the writer concerning what information to include in an argument (background, potential concerns, etc.).",
            "How to recognize that bias can weaken a writer's stance and should be avoided. Instead, a writer should provide strengths and limitations of both claims and counterclaims strengthens the validity of the argument."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Argumentative writing is not simple persuasion; instead, an argument should give the audience adequate, reliable information about both claims and counterclaims in order to make an informed decision.",
            "In argumentative writing, claims and counterclaims should be developed fairly and thoroughly.",
            "Evidence should be selected based on relevancy and appropriateness for task, audience, and purpose.",
            "Writers should anticipate and address not only the audience's knowledge level and concerns, but also their values and possible biases."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write a reasoned, unbiased explanation of both claim(s) and counterclaim(s), giving equal attention to both.",
            "Identify and discuss the strengths and limitations of both claims and counterclaims in anticipation/reaction to the audience's knowledge level, concerns, values, and possible biases."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "claim",
        "counterclaim",
        "supply",
        "anticipate",
        "knowledge level",
        "concerns",
        "bias",
        "values"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.1c",
      "description": "Use words, phrases, and clauses as well as varied syntax to link the major sections of the text, create cohesion, and clarify the relationships between claim(s) and reasons, between reasons and evidence, and between claim(s) and counterclaims. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: connect, phrase, clause, syntax clarify, relationship, reasons, evidence, claims, counterclaims"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Words, phrases, and clauses are used to connect ideas and clarify relationships within a text by:",
            "o Strengthening the connection between the major sections of a text.",
            "o Making a text more unified, or cohesive.",
            "o Clarifying the relationship between elements of a text.",
            "How to recognize that reasons are provided to support a claim(s).",
            "How to acknowledge that evidence is provided to support a reason(s) through:",
            "o Examples",
            "o Statistics"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Writers use varied syntax to link sections of a text, create cohesion, and clarify relationships between ideas."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write sentences that use words, phrases, clauses, and varied syntax to link major sections of a text.",
            "Write sentences that use words, phrases, clauses, and syntax to create cohesion.",
            "Write sentences that use words, phrases, clauses, and syntax to clarify the relationships between:",
            "o Claim(s) and reasons",
            "o Reason(s) and evidence",
            "o Claim(s) and counterclaims"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "connect",
        "phrase",
        "clause",
        "syntax clarify",
        "relationship",
        "reasons",
        "evidence",
        "claims",
        "counterclaims"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.1d",
      "description": "Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Establish, maintain, formal style, objective tone, norms, conventions, discipline"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to recognize that formal style is different from everyday discourse.",
            "Formal, objective writing is usually written from the third-person point of view.",
            "Writers use different techniques depending upon the intended audience, subject, and purpose."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Each discipline (i.e., mathematics, science, etc.) has specific norms and conventions for writing, including (but not limited to):",
            "o Headings",
            "o Subheadings",
            "o Numbered lists",
            "o Charts/graphs",
            "o Illustrations",
            "o Maps",
            "An objective tone presents information without bias or prejudice, with both claims and counterclaims being discussed and evaluated."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify discipline-specific norms and conventions within a document (e.g., headings, subheadings, numbered lists, charts/graphs, illustrations, and maps).",
            "Write a discipline-specific document that demonstrates use of formal style and objective tone."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Establish",
        "maintain",
        "formal style",
        "objective tone",
        "norms",
        "conventions",
        "discipline"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.1e",
      "description": "Provide a concluding statement or section that follows from and supports the argument presented. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: conclusion, follows from, supports"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A conclusion gives closure to an argument by:",
            "o Restating the thesis/main idea",
            "o Providing a call to action",
            "o Expressing a final thought or opinion"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The conclusion must provide a logical ending and sense of closure to an argument.",
            "A conclusion is not just a summary of the main idea."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write a concluding statement or paragraph that supports the argument presented remembering to restate the main idea, provide a call to action, and express a final thought and/or opinion."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "conclusion",
        "follows from",
        "supports"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.2a",
      "description": "Introduce a topic; organize complex ideas, concepts, and information so that each new element builds on that which precedes it to create a unified whole; include formatting (e.g., headings), graphics (e.g., figures, tables), and multimedia when useful to aiding comprehension. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: topic, complex ideas, connection, distinction, formatting, headings, graphics, figures, tables, multimedia, unified whole"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative/explanatory texts to examine and convey complex ideas, concepts, and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Informative/expository writing focuses on one topic and develops it fully.",
            "Ideas, concepts, and supporting information are connected."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors intentionally use text structures (e.g., compare/ contrast, cause and effect, procedure) to show connections and distinctions within complex texts.",
            "Authors organize ideas to build upon previous ideas and support future statements.",
            "Purposeful use of text features (e.g., headings, figures, tables, pictures) can help a reader better comprehend complex information."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write an introductory sentence and/or paragraph.",
            "Organize ideas in sections that build upon the preceding section to create a unified whole.",
            "Utilize formatting (e.g., headings, graphics, and multimedia) to aid in comprehension."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "topic",
        "complex ideas",
        "connection",
        "distinction",
        "formatting",
        "headings",
        "graphics",
        "figures",
        "tables",
        "multimedia",
        "unified whole"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.2b",
      "description": "Develop the topic thoroughly by selecting the most significant and relevant facts, extended definitions, concrete details, quotations, or other information and examples appropriate to the audience's knowledge of the topic. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: develop, significant, relevant, extended definition, concrete details, quotations, examples"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative/explanatory texts to examine and convey complex ideas, concepts, and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Relevant, sufficient facts are necessary to develop a topic.",
            "Quotations should be punctuated properly depending upon their use in a sentence.",
            "Writers choose supporting information that is appropriate to the audience's knowledge of a topic."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A topic can be supported with a variety of types of supporting information:",
            "o Facts",
            "o Extended definitions",
            "o Concrete details",
            "o Quotations",
            "o Examples",
            "o Other appropriate information"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Distinguish between relevant and irrelevant facts that help develop the topic.",
            "Write a paragraph that uses a variety of supporting information to develop the topic thoroughly.",
            "Evaluate the audience's prior knowledge of the topic and select support that is appropriate."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "develop",
        "significant",
        "relevant",
        "extended definition",
        "concrete details",
        "quotations",
        "examples"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.2c",
      "description": "Use appropriate and varied transitions and syntax to link the major sections of the text, create cohesion, and clarify the relationships among complex ideas and concepts. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: transition, syntax, cohesion, clarify, complex ideas and concepts"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative/explanatory texts to examine and convey complex ideas, concepts, and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Authors use transition words to signal a change from one idea to the next.",
            "Transitions are needed to connect ideas within sentences, within paragraphs, and between paragraphs (coordinating conjunctions, correlative conjunctions, conjunctive adverbs, etc.)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Writers use varied syntax to link sections of a text, create cohesion, and clarify relationships between ideas.",
            "o Sentence patterns",
            "o Phrasal patterns",
            "o Sentence structure"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify and use appropriate and varied transitions that link paragraphs.",
            "Write an essay that utilizes varied transitions between and within paragraphs to create cohesion, and clarify the relationships among complex ideas and concepts."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "transition",
        "syntax",
        "cohesion",
        "clarify",
        "complex ideas and concepts"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.2d",
      "description": "Use precise language, domain-specific vocabulary, and techniques such as metaphor, simile, and analogy to manage the complexity of the topic. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: precise, domain-specific vocabulary, complexity, simile, metaphor, analogy"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative/explanatory texts to examine and convey complex ideas, concepts, and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Precise language and domain-specific vocabulary are used to inform and explain complex topics, giving the reader more detailed information about topics that may be difficult to understand.",
            "Domain-specific means words that are specific to a certain topic."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Writers often use figurative language to make complex ideas more accessible to the general public:",
            "o Simile",
            "o Metaphor",
            "o Analogy"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify precise and domain-specific vocabulary within a text.",
            "Use precise and domain-specific vocabulary to write about a complex topic.",
            "Use figurative techniques to explain/discuss a complex topic."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "precise",
        "domain-specific vocabulary",
        "complexity",
        "simile",
        "metaphor",
        "analogy"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.2e",
      "description": "Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: establish, maintain, formal style, objective tone, norms, conventions, discipline"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative/explanatory texts to examine and convey complex ideas, concepts, and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Formal style is different from everyday discourse.",
            "Formal, objective writing is usually written from the third-person point of view.",
            "Writers use different techniques depending upon the intended audience and subject."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Each discipline (i.e., mathematics, science, etc.) has specific norms and conventions for writing, including (but not limited to):",
            "o Headings",
            "o Subheadings",
            "o Numbered lists",
            "o Charts/graphs",
            "o Illustrations",
            "o Maps",
            "An objective tone presents information without bias or prejudice, with both claims and counterclaims being discussed and evaluated."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify discipline-specific norms and conventions (ex. headings, subheadings, numbered lists, charts/graphs, illustrations, and maps) within a document.",
            "Write a discipline-specific document that demonstrates use of formal style and objective tone."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "establish",
        "maintain",
        "formal style",
        "objective tone",
        "norms",
        "conventions",
        "discipline"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.2f",
      "description": "Provide a concluding statement or section that follows from and supports the information or explanation presented (e.g., articulating implications or the significance of the topic). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: conclusion, articulate, implication, significance"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative/explanatory texts to examine and convey complex ideas, concepts, and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Concluding statement or sections should logically support the information in the rest of the text.",
            "A conclusion should provide closure for the information or explanation that has already been presented."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "In an informative/explanatory text, a concluding statement or section can:",
            "o Articulate implications",
            "o Point out significance"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine what type of conclusion is effective and supportive based on the information or explanation provided.",
            "Write a conclusion that follows from and supports the information or explanation presented.",
            "Write a concluding statement or section that articulates the implications of an issue/topic.",
            "Write a concluding statement or section that points out the significance of an issue/topic."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "conclusion",
        "articulate",
        "implication",
        "significance"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.3a",
      "description": "Engage and orient the reader by setting out a problem, situation, or observation and its significance, establishing one or multiple point(s) of view, and introducing a narrator and/or characters; create a smooth progression of experiences or events. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Imagined narrative, engage, orient, significance point of view, narrator, characters, progression, sequence"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details,"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Students understand a writer chooses the point of view from which to write based on the task, audience, and purpose.",
            "o 1st Person",
            "o 2nd Person",
            "o 3rd Person (limited, omniscient)",
            "Students know a narrator (1st or 3rd person) relates the events of a narrative."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The introduction of a text should:",
            "o engage/orient the reader",
            "o introduce the problem, situation, or observation, along with a statement of its significance",
            "o introduce a narrator and/or characters",
            "Point of view can change over the course of a text.",
            "Experiences and/or events in a text should progress smoothly and logically."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write an introduction for a narrative (real or imagined) that:",
            "o is engaging",
            "o sets out a problem, situation, or observation and discusses its significance",
            "o establishes point of view",
            "o introduces a narrator and/or characters",
            "o progresses smoothly and logically from one event to the next"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Imagined narrative",
        "engage",
        "orient",
        "significance point of view",
        "narrator",
        "characters",
        "progression",
        "sequence"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.3b",
      "description": "Use narrative techniques, such as dialogue, pacing, description, reflection, and multiple plot lines, to develop experiences, events, and/or characters. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: narrative, dialogue, pacing, description, reflection, multiple plot lines, direct characterization, indirect characterization"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details,"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Narrative writers use a variety of techniques to develop the plot.",
            "Plot typically follows a predictable pattern:",
            "o Introduction",
            "o Rising action",
            "o Climax",
            "o Falling action",
            "o Resolution",
            "Writers use direct and indirect characterization to develop characters."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Narrative techniques include:",
            "o Dialogue",
            "o Pacing",
            "o Description",
            "o Reflection",
            "o Multiple plot lines",
            "A variety of techniques should be used to effectively develop the plot and characters."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write a real or imagined narrative focusing on one narrative technique at a time:",
            "o Dialogue",
            "o Pacing",
            "o Description",
            "o Reflection",
            "o Multiple plot lines",
            "Write a real or imagined narrative that incorporates a variety of narrative techniques."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "narrative",
        "dialogue",
        "pacing",
        "description",
        "reflection",
        "multiple plot lines",
        "direct characterization",
        "indirect characterization"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.3c",
      "description": "Use a variety of techniques to sequence events so that they build on one another to create a coherent whole and build toward a particular tone and outcome (e.g., a sense of mystery, suspense, growth, or resolution). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: sequence, chronological, manipulate, flashback, flash forward, coherent, logical, transitions, mystery, suspense, growth, resolution"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details,"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Because narratives relay events with time as the deep structure, they are often written in chronological/sequential order.",
            "Writers sometimes manipulate time to develop a coherent story.",
            "A variety of techniques can be used to manipulate time in a narrative:",
            "o Flashback",
            "o Flashforward",
            "o Dreams",
            "o Memories",
            "Events should build on one another to create a well-organized, logical sequence.",
            "Transitions show that events build on one another."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Writers intentionally sequence events to build toward a particular tone and outcome:",
            "o Sense of mystery",
            "o Suspense",
            "o Growth",
            "o Resolution"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use a variety of techniques to logically sequence and connect events.",
            "Write a narrative using a variety of transitions to develop a coherent sequence of events.",
            "Establish and build to a particular tone and outcome."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "sequence",
        "chronological",
        "manipulate",
        "flashback",
        "flash forward",
        "coherent",
        "logical",
        "transitions",
        "mystery",
        "suspense",
        "growth",
        "resolution"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.3d",
      "description": "Use precise words and phrases, telling details, and sensory language to convey a vivid picture of the experiences, events, setting, and/or characters. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: precise, sensory, vivid, imagery, visual, auditory, olfactory, kinesthetic, gustatory"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details,"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Writers choose words that are PRECISE, relaying exactly what is meant.",
            "Details should be relevant and specific to the task.",
            "Imagery is created through the use of sensory language and vivid vocabulary."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The development of characters, setting, and events relies on an author's intentional use of:",
            "o Vivid language",
            "o Precise and purposeful words",
            "o Specific details",
            "o Sensory language",
            "Through incorporating a variety of sensory details, an author can appeal to a reader's senses in multiples ways:",
            "o Visual imagery",
            "o Auditory imagery",
            "o Olfactory imagery",
            "o Kinesthetic imagery",
            "o Gustatory imagery"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify an author's use of precise words, specific details, and sensory language.",
            "Evaluate the effect of precise words, specific details, and sensory language on a text.",
            "Utilize a variety of techniques to convey a vivid picture of experiences, events, setting, and/or characters in a narrative."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "precise",
        "sensory",
        "vivid",
        "imagery",
        "visual",
        "auditory",
        "olfactory",
        "kinesthetic",
        "gustatory"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.3e",
      "description": "Provide a conclusion that follows from and reflects on what is experienced, observed, or resolved over the course of the narrative. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: conclusion, reflection, resolution"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details,"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The conclusion provides a logical resolution to the events of the narrative.",
            "A conclusion should support the overall theme/focus of the narrative."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Often in the narrative mode, writers use reflection to conclude a writing.",
            "Through reflection, writers are able to convey experiences, observations, and resolutions."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Develop a conclusion that reflects on what is experienced, observed, or resolved in a narrative.",
            "Write a narrative that provides a reflective conclusion that follows from and supports what is experienced, observed, and resolved."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "conclusion",
        "reflection",
        "resolution"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.4",
      "description": "Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1-3 above.) Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: coherent, development, organization, style, sequence, chronological, cause and effect, problem and solution, compare and contrast, spatial, order of importance, description"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.4",
      "grade": null,
      "description": "Produce clear and coherent writing in which the development, organization, and style are appropriate to task,"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Task, audience, and purpose should inform a writer's decisions.",
            "Style is an individual writer's pattern of writing (e.g., diction, syntax, word choice, sentence patterns, etc.)"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Writing is organized in various ways depending upon task, audience, and purpose:",
            "o Sequence/ chronological",
            "o Cause and effect",
            "o Problem and solution",
            "o Compare and contrast",
            "o Spatial",
            "o Order of importance",
            "o Description",
            "Academic writing is free from slang, abbreviations, texting language, etc."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Analyze a writing prompt to identify:",
            "o Task",
            "o Audience",
            "o Purpose",
            "Select an organization structure that is appropriate to task, audience, and purpose.",
            "Write an organized paper/article that is clear and has fully developed ideas and style appropriate for the task and audience."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "coherent",
        "development",
        "organization",
        "style",
        "sequence",
        "chronological",
        "cause and effect",
        "problem and solution",
        "compare and contrast",
        "spatial",
        "order of importance",
        "description"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.5",
      "description": "Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on addressing what is most significant for a specific purpose and audience. (Editing for conventions should demonstrate command of Language standards 1-3 up to and including grades 12-12). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Planning, revising, editing, rewriting, new approach, significant, audience, purpose"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.5",
      "grade": null,
      "description": "Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Students understand that writers must plan, revise, edit, rewrite, and sometimes try a new approach.",
            "Students know that writers must identify the audience and purpose of writing in order to determine the appropriate response."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Successful writers rarely produce a polished text in one writing session. Rather, a process of planning, writing, rereading, editing, and revising is used to ensure that the finished product is appropriate, complete, and free from errors.",
            "Conventions of standard English grammar should be utilized to strengthen writing.",
            "Planning, editing, and revising should take into consideration the audience and purpose.",
            "Acceptable style and tone vary from audience to audience."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the audience and purpose for writing, along with any expectations concerning style and tone.",
            "Identify if/when writing requires planning, revising, editing, rewriting, or a new approach.",
            "Develop and strengthen writing by engaging in the writing process."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Planning",
        "revising",
        "editing",
        "rewriting",
        "new approach",
        "significant",
        "audience",
        "purpose"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.6",
      "description": "Use technology, including the Internet, to produce, publish, and update individual or shared writing products in response to ongoing feedback, including new arguments or information. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: produce, publish, update, shared writing, link, hyperlink, blog, podcast. Prezi, wiki, website, discussion board, cite, feedback"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.6",
      "grade": null,
      "description": "Use technology, including the Internet, to produce and publish writing and to interact and collaborate with others."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Basic keyboarding and computing skills.",
            "All texts, including those published online, must utilize appropriate citations.",
            "In addition to print publishing, technology can be used to produce and publish writing.",
            "Information and sources can be linked through hyperlinks and embedded objects to produce dynamic and flexible products."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Technology offers a variety of platforms for collaboration and shared work:",
            "o Blogs",
            "o Podcasts",
            "o Prezis",
            "o Wikis",
            "o Websites",
            "o Discussion boards",
            "Effective writers update individual and shared writing products in response to feedback.",
            "New arguments and information should be added as necessary."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use technology (e.g., the Internet) to produce, revise, edit, and publish writing.",
            "Use technology to interact and collaborate with peers.",
            "Demonstrate use of technology to update individual and shared writing.",
            "Use technology to link appropriate sources of information.",
            "Use technology to update individual and shared writing with new arguments and information."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "produce",
        "publish",
        "update",
        "shared writing",
        "link",
        "hyperlink",
        "blog",
        "podcast. Prezi",
        "wiki",
        "website",
        "discussion board",
        "cite",
        "feedback"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.7",
      "description": "Conduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Research, self-generated question, narrow/broaden inquiry, synthesize, investigation"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.7",
      "grade": null,
      "description": "Conduct short as well as more sustained research projects based on focused questions, demonstrating"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Not all sources are reliable, and a researcher must be able to distinguish credible sources from sources that are not credible or reliable.",
            "Sources used in research must be cited in the appropriate format (i.e., MLA, APA, Turabian, etc.)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A research topic or question can be altered based on the information available:",
            "o Narrowed if too much information is available",
            "o Broadened if too little information is available",
            "Successful writers \"weave\" a variety of research materials into a text to provide a thorough discussion of the topic."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Generate and refine research questions.",
            "Evaluate the credibility of sources.",
            "Conduct short and more sustained research to answer a question or solve a problem.",
            "Routinely incorporate (or synthesize) cited material, quotations, inferences, and other support into research writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Research",
        "self-generated question",
        "narrow/broaden inquiry",
        "synthesize",
        "investigation"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.8",
      "description": "Gather relevant information from multiple authoritative print and digital sources, using advanced searches effectively; assess the strengths and limitations of each source in terms of the task, purpose, and audience; integrate information into the text selectively to maintain the flow of ideas, avoiding plagiarism and overreliance on any one source and following a standard format for citation. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: relevant, authoritative, print and digital sources, advanced search, integrate, flow of ideas, plagiarism, standard format (MLA, APA, etc.), textual evidence, documented, footnotes, endnotes, reliability, lead-ins, direct quotes, indirect quotes, block quotes"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.8",
      "grade": null,
      "description": "Gather relevant information from multiple print and digital sources, assess the credibility and accuracy of each"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Not all sources (print/digital/ multimedia) are accurate or reliable; therefore, sources must be evaluated based on their usefulness in answering the research question.",
            "Plagiarizing is using another person's words or ideas as one's own.",
            "Textual evidence (sources) must be documented in the appropriate citation format (i.e., MLA, APA, Turabian, etc.)",
            "Students understand that multiple sources increase the reliability of one's research."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Researchers must assess the strengths and limitations of sources in terms of task, audience, and purpose.",
            "Overreliance on one source undermines the integrity of one's research.",
            "Footnotes and endnotes can be used in citing evidence, based on the appropriate style guide.",
            "Information must be integrated selectively and intentionally to maintain the flow of ideas:",
            "o Lead-ins",
            "o Indirect quotations",
            "o Block quotes"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Evaluate and choose multiple research sources based on relevancy and reliability.",
            "Use sources that are most appropriate based on task, audience, and purpose.",
            "Use a variety of sources without depending too heavily on one.",
            "Avoid plagiarism by correctly quoting and citing sources.",
            "Follow a standard citation formation (i.e., MLA, APA, Turabian, etc.) based on the subject under investigation."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "relevant",
        "authoritative",
        "print and digital sources",
        "advanced search",
        "integrate",
        "flow of ideas",
        "plagiarism",
        "standard format (MLA",
        "APA",
        "etc.)",
        "textual evidence",
        "documented",
        "footnotes",
        "endnotes",
        "reliability",
        "lead-ins",
        "direct quotes",
        "indirect quotes",
        "block quotes"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.9b",
      "description": "Apply grades 11-12 Reading standards to literary nonfiction (e.g., \"Delineate and evaluate the reasoning in seminal U.S. texts, including the application of constitutional principles and use of legal reasoning [e.g., in U.S. Supreme Court Case majority opinions and dissents] and the premises, purposes, and arguments in works of public advocacy [e.g., The Federalist, presidential addresses]\"). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: substantiation, text evidence, analysis, reflection, research, literary source, informational source"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.9",
      "grade": null,
      "description": "Draw evidence from literary or informational texts to support analysis, reflection, and research."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Writing requires substantiation (text evidence) from literary or informational texts.",
            "Textual evidence can provide support for analysis, reflection, and research."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Analysis depends on the writer's interpretation of textual evidence.",
            "During reflection, a writer must evaluate his/her conclusion(s)/claim(s) based on the evidence provided.",
            "If a writer's conclusion(s)/ claim(s) is/are found to be unsound, revision is necessary.",
            "Research is a synthesis of text-based evidence from a variety of sources."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Incorporate textual evidence from literary and/or informational sources when writing.",
            "Evaluate a writer's conclusion(s)/claim(s) based on textual evidence.",
            "Correctly incorporate textual evidence in research writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "substantiation",
        "text evidence",
        "analysis",
        "reflection",
        "research",
        "literary source",
        "informational source"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Writing",
    "reporting_category": "Range of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.12.10",
      "description": "Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of tasks, purposes, and audiences. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: routinely, extended, task, audience, purpose, revision"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.10",
      "grade": null,
      "description": "Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of tasks, purposes, and audiences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Writing is conducted for a specific purpose.",
            "Depending on the purpose and task, writing will require varying amounts of time."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Successful writers do not write to a specified page length. Rather, successful writers write until the task is complete.",
            "Careful revision is part of the writing process that can take an extended amount of time."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write regularly for a variety of purposes including informational research and literary analysis.",
            "Write over extended time frames:",
            "o Research",
            "o Reflection",
            "o Revision",
            "Write for short time frames:",
            "o One class period",
            "o An extended writing block",
            "o Two or more class periods"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "routinely",
        "extended",
        "task",
        "audience",
        "purpose",
        "revision"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.12.1a",
      "description": "Come to discussions prepared, having read and researched material under study; explicitly draw on that preparation by referring to evidence from texts and other research on the topic or issue to stimulate a thoughtful, well-reasoned exchange of ideas. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: prepared, researched, study, explicitly, refer, evidence, text, topic, issue, thoughtful, well-reasoned"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "When it is appropriate to speak and when to listen.",
            "How to read a text independently and pick out evidence from a text that is relevant to the discussion.",
            "How to reference texts in a discussion with their peers."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Students need to analyze information independently and be prepared to share that information in a class setting.",
            "Students need to understand that not all material is unbiased.",
            "Students need to understand the importance of contributing to class discussion by preparing in advance rather than simply relying on their opinion on a topic."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Support claims verbally with evidence from texts.",
            "Contribute to discussion using claims that are based on independent research rather than simply opinion.",
            "Evaluate the quality of information presented by peers in a discussion.",
            "Analyze the reasoning in their statements and those of peers.",
            "Make claims free of fallacies.",
            "Identify fallacies in claims.",
            "Apply this knowledge to more complex topics than that of Grades 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "prepared",
        "researched",
        "study",
        "explicitly",
        "refer",
        "evidence",
        "text",
        "topic",
        "issue",
        "thoughtful",
        "well-reasoned"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.12.1b",
      "description": "Work with peers to promote civil, democratic discussions and decision-making, set clear goals and deadlines, and establish individual roles as needed. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: civil, democratic, discussion, goals, deadlines, roles"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Civil discussion means polite discussions where everyone gets a voice and all opinions are heard.",
            "Democratic means everyone is equal.",
            "The importance of following protocol when working with small- or whole-groups to make decisions or work towards a goal.",
            "How to set individual goals.",
            "To be respectful of alternate or opposing viewpoints in a class or group discussion.",
            "An informal consensus could be a show of hands or roll call vote."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Students should understand the rules of collegial discussions and/or group work.",
            "Students should understand the importance of setting and tracking goals when working with peers.",
            "Students should understand the importance of setting and meeting deadlines to achieve certain goals when working with peers or individually.",
            "Students should understand the importance of listening to peers.",
            "Students should understand they will have to work with peers in a college or workplace setting."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Track progress (through a chart or other form of self-evaluation) when meeting deadlines and following protocol for collegial discussions and decision making.",
            "Set/write individual goals to help achieve group goals.",
            "Understand role in a group and how that role fits into the goal of the group.",
            "Present alternative views on a topic.",
            "Apply knowledge to more complex topics than those in Grades 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "civil",
        "democratic",
        "discussion",
        "goals",
        "deadlines",
        "roles"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.12.1c",
      "description": "Propel conversations by posing and responding to questions that probe reasoning and evidence; ensure a hearing for a full range of positions on a topic or issue; clarify, verify, or challenge ideas and conclusions; and promote divergent and creative perspectives. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Propel, probe, conversations, discussions, themes, ideas, clarify, justify, challenge, conclusion, promote, divergent, creative, perspectives, claims, incorporate"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to ask purposeful questions or contribute to a discussion in a productive way.",
            "To speak when it is their turn to speak and not to interrupt others.",
            "How to stay on topic when having class discussions.",
            "How to appropriately disagree or challenge an idea made by a member of the class in a respectful way."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The importance of posing meaningful questions when having a class/group discussion.",
            "How the current discussion fits into the larger theme of the unit of instruction or a larger topic/universal theme.",
            "The importance of hearing from others in a discussion setting.",
            "The importance of asking for clarification during discussions.",
            "Divergent means different, and having different perspectives on a topic helps to understand the topic in its entirety."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Contribute to a discussion and stay on topic.",
            "Keep a conversation going by asking questions that are relevant and insightful.",
            "Ask for clarification of an idea or conclusion during discussion.",
            "Verify personal claims and those of others.",
            "Challenge ideas and conclusions of others with backup and evidence from reading/research.",
            "Hold other group members accountable for backing up their ideas and claims.",
            "Engage less vocal students in the conversation.",
            "Apply knowledge to more complex topics than those of Grades 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Propel",
        "probe",
        "conversations",
        "discussions",
        "themes",
        "ideas",
        "clarify",
        "justify",
        "challenge",
        "conclusion",
        "promote",
        "divergent",
        "creative",
        "perspectives",
        "claims",
        "incorporate"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.12.1d",
      "description": "Respond thoughtfully to diverse perspectives; synthesize comments, claims, and evidence made on all sides of an issue; resolve contradictions when possible; and determine what additional information or research is required to deepen the investigation or complete the task. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Most topics will have different perspectives.",
            "What a summary is and how to summarize the main points of an argument",
            "How to justify their own views with evidence from a text.",
            "How to justify their own views with logical reasoning not just feelings.",
            "What logical reasoning is.",
            "Synthesize means to put together.",
            "Resolve means to have closure or solve an issue.",
            "Contradictions are opposing viewpoints."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "They are to take an active role in discussions rather than being a passive listener.",
            "Most topics are not simple, black-and-white issues, that there are multiple viewpoints to consider, which makes listening to all sides important.",
            "The importance of thoroughly researching a topic or listening to all sides of a topic before drawing a conclusion.",
            "To be career and college ready, they need to be able to organize the information presented to them in order to form their own ideas on an issue."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Summarize what a speaker says.",
            "Determine whether a speaker uses logical or fallacious reasoning.",
            "Determine whether what a speaker says is relevant to the argument or not.",
            "Justify reasons logically and free of fallacies.",
            "Apply what is learned in discussions and make new connections or, when necessary, change ideas in light of what was learned.",
            "Qualify or set boundaries for beliefs and reasoning.",
            "Combine research and claims made by other speakers to come to a conclusion.",
            "Determine if enough information is present to"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.12.2",
      "description": "Integrate multiple sources of information presented in diverse formats and media (e.g., visually, quantitatively, orally) in order to make informed decisions and solve problems, evaluating the credibility and accuracy of each source and noting any discrepancies among the data. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: integrate, multiple sources, format, diverse media, visually, quantitatively, orally, credibility, accuracy, evaluate, bias, valid, validity, discrepancies, solve problems"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.2",
      "grade": null,
      "description": "Integrate and evaluate information presented in diverse media and formats, including visually, quantitatively, and orally."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Media is a form of communication, which can include written texts, videos, newspapers, online sources.",
            "Information can be presented in various forms including written text, charts, graphics, audio, and art.",
            "Quantitatively means that the information can be measured.",
            "Orally means spoken.",
            "Determine if a speaker's reasoning and claims are sound or not.",
            "Credible and valid sources are those that use reliable data and are free from bias."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "What a reliable source is.",
            "How and where to find valid and credible sources for a given topic.",
            "Not all sources are valid or credible.",
            "The importance of making decisions based on valid, reliable information.",
            "To be college and career ready, they need to be able to compile research from sources of different media and present that information in a way that covers all sides and points out how sources differ from each other.",
            "Being able to solve problems through the use of careful research is an essential skill of college and career readiness.",
            "A discrepancy is disagreement or variance in point of view."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Synthesize information from different sources, recognizing similarities and differences.",
            "Evaluate the validity of sources.",
            "Identify information in sources that is false or fallacious.",
            "Identify information in sources that may be biased.",
            "Check the validity of statements believed to be false.",
            "Note discrepancies among different sources in writing, speaking, and reading utilizing a chart or other graphic organizer, and transferring their findings into a finished product.",
            "Apply this knowledge to more complex topics than those in Grades 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "integrate",
        "multiple sources",
        "format",
        "diverse media",
        "visually",
        "quantitatively",
        "orally",
        "credibility",
        "accuracy",
        "evaluate",
        "bias",
        "valid",
        "validity",
        "discrepancies",
        "solve problems"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.12.3",
      "description": "Evaluate a speaker's point of view, reasoning, and use of evidence and rhetoric, assessing the stance, premises, links among ideas, word choice, points of emphasis, and tone used. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.3",
      "grade": null,
      "description": "Evaluate a speaker's point of view, reasoning, and use of evidence and rhetoric."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Point of view means that perspective from which something is told.",
            "Reasoning is a speaker's use of logic and that good reasoning should be based on facts and free of fallacies.",
            "Rhetoric deals with speaking and the way a speaker uses language to achieve a purpose.",
            "A speaker's premise is a statement assumed to be true for the point of argument.",
            "A fallacy is something that is false or misleading.",
            "If information presented is relevant to a discussion or not.",
            "Exaggerated means presenting information in a way to make it appear better or worse than it is.",
            "Distorted information is information that is false or misrepresented in some way."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "What fallacies are and some common logical fallacies: slippery slope, straw man, etc.",
            "What the speaker's point of view is and if his/her point of view might lead him/her to be biased.",
            "A speaker's choice of words or diction helps him/her achieve a purpose.",
            "A speaker's stance on an issue can affect how he/she presents information and links ideas together.",
            "A speaker's stance on an issue can also determine which points he/she wishes to emphasize.",
            "To be college and career ready, they need to be analytical thinkers who listen discerningly and are able to make their own judgments about the"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Evaluate if what a speaker says is valid and true.",
            "Identify fallacies in a speaker's reasoning.",
            "Verify if the speaker's premise is true or not.",
            "Evaluate a speaker's words and tone and determine how it helps the speaker achieve his/her purpose.",
            "Evaluate whether the speaker's stance is justified based on the evidence the speaker gives.",
            "Apply this knowledge to more complex topics than those in Grades 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.12.4",
      "description": "Present information, findings, and supporting evidence, conveying a clear and distinct perspective, such that listeners can follow the line of reasoning, alternative or opposing perspectives are addressed, and the organization, development, substance, and style are appropriate to purpose, audience, and a range of formal and informal tasks. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.4",
      "grade": null,
      "description": "Present information, findings, and supporting evidence such that listeners can follow the line of reasoning and the organization, development, and style are appropriate to task, purpose, and audience."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to research information for a presentation.",
            "How to synthesize information from different sources into one product.",
            "Concisely means to shorten information without changing the meaning.",
            "Different organizational structures and how to use them to achieve a purpose-i.e., cause/effect, process, chronological, problem/solution.",
            "What their purpose, audience, and task are for a presentation.",
            "How to present information in a formal setting (such as a presentation) and an informal setting (such as group discussion).",
            "Argumentative writing and speaking will address the"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The importance of providing information appropriate to a specific audience, purpose, and task.",
            "How to adjust their presentation for information to fit a specific audience.",
            "How to transition from presenting information as writer to presenting information as a speaker.",
            "They will have to present information orally in college and in many careers.",
            "Good public speaking requires not only speaking loud enough for all to hear but also using tone and inflection in delivery to help achieve a purpose.",
            "Good presentations and public speaking requires preparation and practice."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Participate and contribute orally in group discussions, formal presentations, formal/informal debates, etc.",
            "Present an argument along with address the counterargument and a rebuttal to the argument.",
            "Write an outline for a presentation.",
            "Synthesize information from multiple sources, organizing that information in a way that is easy for listeners to follow.",
            "Adjust style of delivery to be appropriate for the audience.",
            "Use PowerPoint, Prezi, websites, and other digital media and sources to present information to an audience.",
            "Judge what information is appropriate for the task and what information is extraneous when preparing a presentation."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.12.5",
      "description": "Make strategic use of digital media (e.g., textual, graphical, audio, visual, and interactive elements) in presentations to enhance understanding of findings, reasoning, and evidence and to add interest. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Strategic, digital media, textual, graphical, audio, visual, interactive elements, presentations, enhance, understanding of findings, reasoning, evidence, add interest, cite, evidence, sources, reputable, valid"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.5",
      "grade": null,
      "description": "Make strategic use of digital media and visual displays of data to express information and enhance understanding of presentations."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Students know how to use various forms of digital media - PowerPoint, Prezi, etc. and how to find other forms of digital media - videos, graphs, etc.",
            "Students know how to outline, organize, and deliver a presentation of information they have researched.",
            "Students know how to find information that is appropriate for their topic and presentation."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Students should understand that the use of digital media in a presentation should be used to support their purpose and/or claim or to provide background information.",
            "Students should understand the use of digital media is not simply to make a presentation \"look good\" but it should add to or support the information in the presentation.",
            "Students should understand that in our world of technology, being able to incorporate digital media into a presentation is not only essential for college readiness but also a marketable job skill."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use textual evidence from reputable sources in a presentation and cite sources.",
            "Locate or make graphs and charts to present information in a visual format.",
            "Locate and insert audio and video clips into a presentation (such as PowerPoint, Prezi, etc.) and cite the source(s).",
            "Present information in a way (PowerPoint, Prezi, etc.) that allows viewers to explore the information at their own pace.",
            "Find digital media that is reputable and valid and use that media to enhance presentation rather than simply make it visually pleasing.",
            "Apply this knowledge to more complex topics than 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Strategic",
        "digital media",
        "textual",
        "graphical",
        "audio",
        "visual",
        "interactive elements",
        "presentations",
        "enhance",
        "understanding of findings",
        "reasoning",
        "evidence",
        "add interest",
        "cite",
        "evidence",
        "sources",
        "reputable",
        "valid"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.12.6",
      "description": "Adapt speech to a variety of contexts and tasks, demonstrating command of formal English when indicated or appropriate. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: adapt, formal English, contexts, tasks, demonstrate, appropriate, audience, professional"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.6",
      "grade": null,
      "description": "Adapt speech to a variety of contexts and communicative tasks, demonstrating command of formal English when indicated or appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Formal English is that which is used in business and academic settings.",
            "Formal English is free from slang, contractions or abbreviations, instant messaging use of words or spellings, idioms, and other colloquialisms.",
            "Context means that which surrounds a situation or text.",
            "Their given task will determine the purpose of their speech and presentation."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The need to adapt their speech to suit a specific audience or topic.",
            "Formal English is used in college classrooms and in most work environments.",
            "The importance of using formal English so that one presents oneself in a professional manner."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use formal English when making presentations.",
            "Use formal English in writing including any written aspect of a presentation.",
            "Use different styles of speech to adapt to different audiences.",
            "Adapt speech, word choice, and delivery depending on the purpose of the task-for example, using persuasive appeals when trying to convince an audience versus using facts and data when trying to inform.",
            "Apply this knowledge to more complex topics than those for Grades 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "adapt",
        "formal English",
        "contexts",
        "tasks",
        "demonstrate",
        "appropriate",
        "audience",
        "professional"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.12.1a",
      "description": "Apply the understanding that usage is a matter of convention, can change over time, and is sometimes contested. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to use correct parallel structure.",
            "The function of verbals (gerunds, participles, infinitives) and their function in sentences.",
            "How to form and use verbs in the active and passive voice.",
            "How to form and use verbs in the indicative, imperative, interrogative, conditional, and subjunctive moods.",
            "How to recognize and correct inappropriate shifts in verb voice and mood.",
            "How to explain the function of phrases and clauses and their function in specific sentences.",
            "How to choose among simple, compound, complex, and compound-complex sentences to signal differing relationships among ideas.",
            "How to place phrases and clauses within a sentence,"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The importance of writing with correct usage and how to look up usage rules in text or digital sources.",
            "Writing correctly is important as a part of good communication.",
            "Usage and grammar rules have and do change over time.",
            "How to apply usage rules of writing to speaking as well.",
            "How to correctly use usage rules, along with all rules of language, are important to being college and career ready."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write with correct usage and apply these rules to speaking, presentations, and other forms of communication.",
            "Use reference materials (print or digital) to refer to the rules for correct usage.",
            "Understand that usage rules change, and, therefore, need to make sure they are referencing the most current guide.",
            "Apply this knowledge in more complex texts than those for Grades 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.12.1b",
      "description": "Resolve issues of complex or contested usage, consulting references (e.g., Merriam-Webster's Dictionary of English Usage, Garner's Modern American Usage) as needed. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Resolve, complex, contested, consult, reference guide, usage"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to use reference material to guide them in using correct usage.",
            "Usage rules change over time.",
            "Usage rules can differ depending on the style of writing or which reference guide they are using."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The importance of knowing which reference guide the teacher wants them to use.",
            "They need to refer to the latest edition of the assigned reference guide.",
            "Different schools, departments, and career fields use different reference guides.",
            "The importance of communicating clearly.",
            "The importance of citing sources and giving credit when using sources."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use the correct reference guide dictated by their course of study or assignment.",
            "Access reference guides online.",
            "Apply the rules for usage dictated by the reference guide to their own writing.",
            "Apply this knowledge in more complex texts than those for Grades 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Resolve",
        "complex",
        "contested",
        "consult",
        "reference guide",
        "usage"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.12.2a",
      "description": "Observe hyphenation conventions. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "To use hyphens when writing compound numbers-for example, twenty-two.",
            "How to hyphenate spelled out fractions.",
            "What the parts of speech are so that they can determine if two words are working together as one word.",
            "Prefixes so they can determine if a prefix and its root word needs to be hyphenated.",
            "Coordinating adjectives are two adjectives of equal value that modify the same noun."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Compound verbs or verbs with two words can be written as one word or hyphenated. Students need to look words up in the dictionary to be sure of the correct spelling.",
            "To hyphenate two or more adjectives when they come before a noun and act as a single idea.",
            "When compound adverbs are used before a verb (and do not end in -ly), the adverbs are hyphenated. When the adverbs are after the verb, they are not hyphenated.",
            "Hyphens are NOT used to separate coordinating adjectives.",
            "To hyphenate prefixes before proper nouns.",
            "NOT to hyphenate a prefix and root word if the prefix and root word end and begin with different vowels. However, if the prefix and suffix begin and"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use hyphens correctly in writing and any other form of written communications.",
            "Refer to a reputable usage guide or dictionary for the correct spelling of a word when in doubt.",
            "Apply this knowledge in more complex texts than those for Grades 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.12.2b",
      "description": "Spell correctly. Desired Student Performance A student should know (Prerequisite Knowledge) How to form the plural of a word by adding s or es. A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Latin prefixes and suffixes: ab, abs, ad, bi, circum, com, con , contra, de, ex, in ,inter, intra, per, pro, re, retro, semi, sub, super, trans",
            "How to spell common easily confused words.",
            "How to form the plural of words that end with the letters s, x, z, ch, sh.",
            "How to form the plural of nouns that end in a consonant and y.",
            "How to form the plural of nouns that end in a vowel and y.",
            "How to form the plural of nouns that end in f or fe.",
            "How to form the plural of nouns that end in 0.",
            "How to correctly spell and use different homophones. For"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Spelling correctly is part of good writing.",
            "Good word choice enhances writing and makes reading more enjoyable.",
            "Contractions are not used in formal writing."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Correctly spell grade appropriate words.",
            "Recognize misspellings when editing their writing and the writing of their peers.",
            "Apply the rules of spelling to unfamiliar words.",
            "Determine the meaning of unfamiliar words based on context.",
            "Apply this knowledge in more complex texts than those for Grades 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Language",
    "reporting_category": "Knowledge of Language",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.12.3a",
      "description": "Vary syntax for effect, consulting references (e.g., Tufte's Artful Sentences) for guidance as needed; when analyzing complex texts, demonstrate an understanding of how syntax contributes to the purpose or meaning of the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: syntax, reference, consult, complex text, sentence structure, parts of speech, clause, phrase"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.3",
      "grade": null,
      "description": "Apply knowledge of language to understand how language functions in different contexts, to make effective choices for meaning or style, and to comprehend more fully when reading or listening."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How syntax refers to word order.",
            "What phrases are and the different types-noun, verb, adjectival, adverbial, participial, prepositional, absolute.",
            "Clauses contain a subject and a verb.",
            "Different types of clauses- independent, dependent; noun, relative, adverbial.",
            "Sentence parts-subjects, verbs, direct objects, predicate adjectives, indirect objects.",
            "Sentence types-simple, compound, complex, compound-complex."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Writers vary the combination of words in their writing to achieve a purpose. For example, the use of short choppy sentences, though not normally desired, could be used for the effect of showing urgency.",
            "Speakers use syntax to convey a purpose.",
            "Continue to understand how language functions and how to apply the rules of language to their writing, reading, and speaking."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Vary the combination of words in their writing for effect.",
            "Analyze the syntax in a complex text and evaluate how the syntax contributes to the work as a whole.",
            "Refer to reference guides when writing and editing sentences as needed to help achieve the desired effect.",
            "Apply this knowledge more complex texts than those for Grades 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "syntax",
        "reference",
        "consult",
        "complex text",
        "sentence structure",
        "parts of speech",
        "clause",
        "phrase"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.12.4a",
      "description": "Use context (e.g., the overall meaning of a sentence, paragraph, or text; a word's position or function in a sentence) as a clue to the meaning of a word or phrase. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: determine, clarify, context, phrase, prefix, suffix, retain"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on grades 12-12 reading and content, choosing flexibly from a range of strategies."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Parts of speech-i.e., noun, pronoun, verb, adjective, adverb, conjunctions, prepositions, interjections.",
            "Sentence parts-subjects, verbs, direct objects, predicate adjectives, indirect objects.",
            "How to read texts on grade-level and determine the main idea of a text.",
            "How to use knowledge of Greek prefixes and suffixes to help determine meaning of unknown words."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Context is anything that surrounds a text-history, culture, subject matter, etc.",
            "Authors use word choice to suit their purpose-to inform, to persuade, to tell a story, etc.",
            "Different sentence patterns and use that knowledge to determine the part of speech of the unknown word.",
            "Words have multiple meanings."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine what part of speech the unknown word or phrase is in the context of the sentence/paragraph.",
            "Apply knowledge to Greek prefixes and suffixes to help determine meaning of unknown word(s) or phrase(s).",
            "Retain knowledge of new word(s) and use it in writing.",
            "Apply this knowledge in more complex texts than those for Grades 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "determine",
        "clarify",
        "context",
        "phrase",
        "prefix",
        "suffix",
        "retain"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.12.4b",
      "description": "Identify and correctly use patterns of word changes that indicate different meanings or parts of speech (e.g., conceive, conception, conceivable). Desired Student Performance A student should know (Prerequisite Knowledge) -en often indicate a verb. -wards indicate an adverb. A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: determine, context, prefix, suffix, use"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on grades 12-12 reading and content, choosing flexibly from a range of strategies."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Parts of speech-i.e., noun, pronoun, verb, adjective, adverb, conjunctions, prepositions, interjections.",
            "Prefixes such as be-, de- or en- and suffixes -ify, -ize, -ate, or",
            "Suffixes such as- er, -ice, -ness,- sion, -ance, -ment, -hood,- dom, -cy, -ist, -ty, and -ship indicate a word is a noun.",
            "Suffixes such as - ful, -eous, - y, -ish, - ble, - ial, -ent, -less,- ng, -ly, -ar, and - ive indicate an adjective.",
            "Suffixes such as -ly, -wise, and"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Words have roots that do not change meaning regardless of the prefix or suffix.",
            "How to form the different forms of a word by changing its prefix and suffix."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine which part of speech a word needs to be in the context of a sentence or passage.",
            "Use the correct form of a word in their writing.",
            "Determine the meaning of unknown words based on knowledge of root words and prefixes and suffixes.",
            "Determine the meaning of unknown words in grade-level texts based on the context of the word in the sentence or passage.",
            "Apply this knowledge in more complex texts than 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "determine",
        "context",
        "prefix",
        "suffix",
        "use"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.12.4c",
      "description": "Consult general and specialized reference materials (e.g., dictionaries, glossaries, thesauruses), both print and digital, to find the pronunciation of a word or determine or clarify its precise meaning, its part of speech, its etymology, or its standard usage. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on grades 12-12 reading and content, choosing flexibly from a range of strategies."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Dictionaries (print and digital) are used to find word meanings, parts of speech, and pronunciations.",
            "Glossaries are located in the back of texts and are used to define words based on the context of the text.",
            "Students know parts of speech - i.e., noun, pronoun, verb, adjective, adverb, conjunctions, prepositions, interjections.",
            "Thesauruses (print and digital) are used to find synonyms and antonyms.",
            "Synonyms are words that have the same or closely the same meaning.",
            "Antonyms are words that have opposite meanings.",
            "Etymology means the study of word origins and how words have changed over time."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Words have different meanings based on the context in which they are used.",
            "Dictionaries, glossaries, and thesauruses will give the root word and often give alternative forms of a word to use for different parts of speech.",
            "Words have prefixes and suffixes that can change the meaning and/or part of speech of a word.",
            "Dictionaries, glossaries, and thesauruses are arranged alphabetically.",
            "Words meanings change over time and should consult a reference guide for the correct and current usage.",
            "To be college and career ready, it is important to know not only a wide range of words but how to use reference guides to assure their proper usage."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use print and digital dictionaries.",
            "Use print and digital glossaries.",
            "Use print and digital thesauruses.",
            "Determine which meaning best fits with the context of the word when words have multiple meanings.",
            "Look up a word's part of speech and be able to use it appropriately in a sentence.",
            "Locate a word's pronunciation guide and pronounce it correctly.",
            "Use a reference guide to trace the origin of a word and how it has changed over time.",
            "Apply this knowledge in more complex texts than those for Grades 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.12.4d",
      "description": "Verify the preliminary determination of the meaning of a word or phrase (e.g., by checking the inferred meaning in context or in a dictionary). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: determine, context, prefix, suffix, use, dictionary, preliminary, infer, phrase"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on grades 12-12 reading and content, choosing flexibly from a range of strategies."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to look up word or phrase meanings in a dictionary.",
            "How to infer word or phrase meanings based on context clues.",
            "Preliminary means first."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Words have different meanings.",
            "Word or phrase meanings can change based on context.",
            "Words have roots, prefixes, and suffixes that can help determine meaning.",
            "Words can have different forms for different parts of speech."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Make a preliminary determination of the meaning of a word or phrase based on the word or phrase's context.",
            "Use a dictionary to look up word meanings.",
            "Evaluate how close the preliminary meaning was to the true meaning of the word or phrase.",
            "Evaluate which meaning is appropriate for the context of the word or phrase if a word or phrase has multiple meanings.",
            "Use a new word or phrase correctly and appropriately, changing the word's form as needed.",
            "Apply this knowledge in more complex texts than those for Grades 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "determine",
        "context",
        "prefix",
        "suffix",
        "use",
        "dictionary",
        "preliminary",
        "infer",
        "phrase"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.12.5a",
      "description": "Interpret figures of speech (e.g., hyperbole, paradox) in context and analyze their role in the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: figurative language, word relationships, nuances, figures of speech, euphemism, oxymoron, idiom, metaphor, simile, hyperbole, paradox, distinguish, overused, juxtaposition, contradictory, expression, evaluate"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Hyperboles are exaggerations writers and speakers use to emphasize a point.",
            "A paradox is a statement that seems contradictory but on further study has truth to it.",
            "Idioms are expressions that do not mean what they literally say.",
            "Figurative language such as metaphors, similes, euphemisms, and oxymorons can be used as figures of speech.",
            "Nuances are slight differences in meaning and that word phrases have different nuances based on their context."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Writers use figures of speech to achieve a specific effect.",
            "Writers use metaphors and similes as figures of speech to make comparisons.",
            "Writers use hyperboles as figures of speech to emphasize a point.",
            "Writers use euphemisms to soften a point.",
            "Writers use oxymorons to show a juxtaposition of words or ideas or to show a paradoxical event. Writers use oxymorons to make readers think and take notice of what is being described.",
            "Idioms are used in everyday life and are not meant to be literal.",
            "To be college and career ready, they need to be able to read higher level texts, which include sophisticated figurative language."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Recognize a figure of speech and explain its effect on the piece of writing.",
            "Distinguish between overused figures of speech and original figures of speech.",
            "Evaluate the use of a figure of speech in a piece of writing and evaluate whether the figure of speech achieves the author's purpose.",
            "Enhance writing by correctly using original figures of speech to help achieve a purpose in writing.",
            "Apply this knowledge in more complex texts than those for Grades 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "figurative language",
        "word relationships",
        "nuances",
        "figures of speech",
        "euphemism",
        "oxymoron",
        "idiom",
        "metaphor",
        "simile",
        "hyperbole",
        "paradox",
        "distinguish",
        "overused",
        "juxtaposition",
        "contradictory",
        "expression",
        "evaluate"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.12.5b",
      "description": "Analyze nuances in the meaning of words with similar denotations. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: figurative language, word relationships, nuances, word meanings, denotation, connotation, determine, convey"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Nuances are slight differences in meaning, tone, or feeling.",
            "Denotation means the dictionary definition of a word.",
            "Words have more than one meaning.",
            "Connotation is the feeling or emotion that is associated with a word.",
            "Words can have similar denotations but different connotations-i.e., eager and anxious."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Nuances in language add a rich complexity to language, helping writers not only be more specific but also to convey more emotions and meanings in their writing.",
            "Good writers use less traditional means or connotations of words to help achieve their purpose and add variety to language."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use context clues to determine the detonation and connotation of a word as it is used in its context.",
            "Determine the difference between two (or more) words with similar denotations by the context in which the words are used.",
            "Justify the author's word choice based on the purpose of the writing.",
            "Choose words for writing that help convey purpose and meaning.",
            "Apply this knowledge in more complex texts than those for Grades 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "figurative language",
        "word relationships",
        "nuances",
        "word meanings",
        "denotation",
        "connotation",
        "determine",
        "convey"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "12",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.12.6",
      "description": "Acquire and use accurately general academic and domain-specific words and phrases, sufficient for reading, writing, speaking, and listening at the college and career readiness level; demonstrate independence in gathering vocabulary knowledge when considering a word or phrase important to comprehension or expression. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Developing Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Academic words, domain-specific words and phrases, sufficient, reading, writing, speaking, listening, college and career readiness level, demonstrate, independence, vocabulary, comprehension, expression"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.6",
      "grade": null,
      "description": "Acquire and use accurately general academic and domain-specific words and phrases, sufficient for reading, writing, speaking, and listening at the college and career readiness level; demonstrate independence in gathering vocabulary knowledge when considering a word or phrase important to comprehension or expression."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Grade appropriate words and vocabulary.",
            "Domain-specific means words that are specific to a certain topic.",
            "When reading, writing, and speaking, how to correctly use grade appropriate words.",
            "How to use context clues to determine meaning for unfamiliar words.",
            "How to use text and electronic sources to locate word meanings."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to determine a word's meaning in reading, writing, speaking, or listening by using their knowledge of language and context clues.",
            "That they will be expected to use and know age appropriate and task appropriate words in reading, speaking, and listening in college and in the workplace.",
            "The importance of expanding their general vocabulary."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine the meaning of words using context clues.",
            "Locate the meanings of unknown words in print dictionaries or through online dictionaries.",
            "Use new words correctly.",
            "Incorporate new words into vocabulary and be able to use them independently and appropriately.",
            "Apply this knowledge in more complex texts than those for Grades 9-10."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Academic words",
        "domain-specific words and phrases",
        "sufficient",
        "reading",
        "writing",
        "speaking",
        "listening",
        "college and career readiness level",
        "demonstrate",
        "independence",
        "vocabulary",
        "comprehension",
        "expression"
      ]
    }
  }
]