[
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.2.1",
      "description": "Ask and answer such questions as who, what, where, when, why, and how to demonstrate understanding of key details in a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) Readers support inferential thinking based on specific evidence from the text and prior knowledge. A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: prior knowledge, schema, think aloud, infer, inferential, question, visualize, read closely, reread, use text features, draw or write thinking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.1",
      "grade": null,
      "description": "Read closely to determine what the text says explicitly and make logical inferences from it; cite specific textual evidence and when writing or speaking to support conclusions drawn from the text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "There is a difference between a telling sentence and an asking sentence.",
            "Key words (e.g., who, what, when, etc.) signal a question is being asked.",
            "How to ask questions to clarify meaning and self-monitor understanding, especially when meaning is lost.",
            "How to visualize key elements within the text.",
            "How to ask and answer questions before, during, and after reading.",
            "Remember key details located within the text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Growing readers ask and answer literal and inferential questions.",
            "Readers read with a question in mind. They infer answers not explicitly stated within the text.",
            "Thoughtful readers ask questions for a variety of purposes: to determine an author's style, intent, content, and format.",
            "Growing readers read closely to cite information from the text in order to ask and answer questions."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Provide questions and/or answers that show understanding of key details in a text, including answers to such questions as who, what, where, when, why, and how within the text.",
            "Provide questions and/or answers that show understanding of key details beyond the text (inferential).",
            "Ask and answer questions about the characters, setting, and plot (beginning, middle, end, problem, and solution) of a text.",
            "Record questions and answers in a variety of formats (e.g., graphic organizer, sticky notes, two-column notes, jotting on text)."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "prior knowledge",
        "schema",
        "think aloud",
        "infer",
        "inferential",
        "question",
        "visualize",
        "read closely",
        "reread",
        "use text features",
        "draw or write thinking"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.2.2",
      "description": "Recount stories, including fables and folktales from diverse cultures, and determine their central message, lesson, or moral. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: synthesize, mental images, background knowledge, recount, retell, fables, folktales, central message, lesson, moral, recount"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.2",
      "grade": null,
      "description": "Determine central ideas or themes of a text and analyze their development; summarize the key supporting details and ideas."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify the major characters, setting, problem, and solution in retelling a story.",
            "How to determine the importance of information within the text.",
            "How to utilize basic summarization strategies and generate a summary statement.",
            "How to make connections based on prior knowledge.",
            "How to utilize an organizational tool to demonstrate understanding of the central message, lesson, or moral characteristics of fables and folktales.",
            "Recount is to retell the important information in the story."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Growing readers reflect on the way the author introduces the characters, describes the setting, sets up the problem, and describes how the solution is achieved.",
            "Growing readers understand how characters' actions contribute to the plot throughout the course of the story.",
            "The moral is the lesson contained or learned in a story.",
            "The lesson is what the characters learn in a story.",
            "The central message is the big idea the author is trying to get across."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "After reading or listening to a story, retell the story, fable, or folktale by providing an identification and justification of the central message, lesson, or moral in a text.",
            "Read closely to synthesize key points made by the author to figure out the central message or theme.",
            "Determine the theme and describe the main character's experiences in relation to the theme through oral and written conversations.",
            "Give a summary of the important elements of the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "synthesize",
        "mental images",
        "background knowledge",
        "recount",
        "retell",
        "fables",
        "folktales",
        "central message",
        "lesson",
        "moral",
        "recount"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.2.3",
      "description": "Describe how characters in a story respond to major events and challenges. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: characters, describe, major events, challenges, draw conclusions, analyze, think critically"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.3",
      "grade": null,
      "description": "Analyze how and why individuals, events, or ideas develop and interact over the course of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to orally describe a character.",
            "A major event is where something important happens in the story.",
            "The setting is where and when a story takes place.",
            "How to use prior knowledge to predict what is coming next in the text.",
            "How to identify basic story elements as well as major events or challenges within a story.",
            "How to monitor thinking so that they understand when meaning is lost."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Growing readers describe a character by thinking about their feelings, actions, and thoughts.",
            "Thoughtful readers analyze and describe the details that impact the major events within the story.",
            "Readers utilize critical thinking skills to draw conclusions based on textual evidence to think about how characters respond to major events and challenges."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the characters in a story.",
            "Describe how characters in a story respond to challenges utilizing text-based evidence.",
            "Describe the major events that happen in the story and tell how the characters react to changes during the major events.",
            "Provide descriptions that represent the characters' thoughts, feeling, or actions based on textual evidence to complete reading activities such as a character map."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "characters",
        "describe",
        "major events",
        "challenges",
        "draw conclusions",
        "analyze",
        "think critically"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.2.4",
      "description": "Describe how word and phrases (e.g., regular beats, alliteration, rhymes, repeated lines) supply rhythm and meaning in a story, poem, or song. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: word choice, words and phrases, regular beats, alliteration, rhymes, repeated lines"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.4",
      "grade": null,
      "description": "Interpret words and phrases as they are used in a text, including determining technical, connotative, and figurative meanings, and analyze how specific word choices shape meaning or tone."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to use strategies to figure out unknown words.",
            "How to figure out words based on eight context clues (e.g., definition, restatement or synonym, contrast or antonym, comparison, list or series, cause and effect, example, inference).",
            "Word choice impacts meaning of text.",
            "How to identify literal and non-literal meanings of words including figurative language.",
            "Types of literary devices authors utilize such as alliteration, repetition, rhythm, and rhyme."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Readers actively look for the meaning of unknown words/ phrases to clarify meaning so they can deepen their understanding of text.",
            "Authors chose language that creates powerful images in the readers' mind as well as create meaning for their readers.",
            "Growing readers recognize types of literary devices (e.g., regular beats, alliteration, rhymes, repeated lines) authors use to convey their message and make writing more appealing to the reader."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Demonstrate the use of context clues to determine meanings of unknown words and phrases in text.",
            "Describe how language choice impacts and creates meaning in text.",
            "Explain how rhythmic words and phrases assist the reader in gaining deeper meaning in stories, poems, or songs.",
            "Describe how or why authors use repeated lines in text to create rhythm and meaning."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "word choice",
        "words and phrases",
        "regular beats",
        "alliteration",
        "rhymes",
        "repeated lines"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.2.5",
      "description": "Describe the overall structure of a story, including describing how the beginning introduces the story and the ending concludes the action. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.5",
      "grade": null,
      "description": "Analyze the structure of texts, including how specific sentences, paragraphs, and larger portions of the text (e.g., a section, chapter, scene, or stanza) relate to each other and the whole."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify basic story structure elements for literary text-beginning, middle, end, problem, and solution.",
            "Stories are usually told to entertain, teach a lesson, or send a message.",
            "Different types of literary text (e.g., poems, fables, fantasy, etc.) include a beginning, middle, and ending"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors often introduce the characters, settings, and plot in the beginning of the story.",
            "Authors usually reveal the important character(s) and the problem the character(s) has in the beginning of the story.",
            "Authors usually reveal how the character(s) solves the problem and/or responds to a challenge at the end of the story.",
            "Effective readers understand the layout of a literary text.",
            "Readers know there will be a beginning, middle, and end of a story.",
            "Authors of literary text utilize a variety of story structures.",
            "Effective readers analyze the text structures for fiction,"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Analyze multiple texts and identify common aspects of a beginning, middle, and ending of a story.",
            "Correctly complete a graphic organizer/chart which describes the details of the beginning, the middle, and the end of the story.",
            "Provide a verbal and/or written description of the overall structure of a story, including how the beginning introduces the characters, setting, problem, and plot and how the ending reveals the outcome of the character's problem and/or the character's response to a challenge."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.2.6",
      "description": "Acknowledge differences in the points of view of characters, including by speaking in a different voice for each character when reading dialogue aloud. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: point of view, characters, dialogue, voice, speaker, narrative, background knowledge, determine importance, synthesize"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.6",
      "grade": null,
      "description": "Assess how point of view or purpose shapes the content and style of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A narrator/speaker is person who tells a story.",
            "Characters are the people or creatures within the story.",
            "How to explain the difference between literary text and informational text.",
            "How to identify who is telling a story at various points within the text.",
            "Dialogue is when characters are speaking to each other in a story."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Thoughtful readers think critically to distinguish who is telling a story and how it affects what is told.",
            "Growing readers understand that the narrator or speaker in a story sometimes changes. They have to pay attention to whom is telling the story throughout the text.",
            "Authors write through the eyes of different characters. This helps them unfold the plot of the story for the reader."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the characters in the story.",
            "Identify the differences in the points of view of characters.",
            "Identify when a character is speaking.",
            "Identify when different characters are speaking.",
            "Identify changes in voice when reading to signal a change in characters speaking.",
            "Provide an explanation of an author's use of dialogue to show the difference in the points of view for different characters.",
            "Identify characters' feelings and emotions in the story."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "point of view",
        "characters",
        "dialogue",
        "voice",
        "speaker",
        "narrative",
        "background knowledge",
        "determine importance",
        "synthesize"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.2.7",
      "description": "Use information gained from the illustrations and words in a print or digital text to demonstrate understanding of its characters, setting, or plot. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: illustrations, details, describe, story elements, characters, setting, problem, solution, plot, visual images, predictions, inferences, draw conclusions, events"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.7",
      "grade": null,
      "description": "Integrate and evaluate content presented in diverse media and formats, including visually and quantitatively, as well as in words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify basic story details embedded in the story's structure.",
            "How to describe the individual story elements (e.g., character, setting, events, problem, solution).",
            "Illustrations are pictures, drawings, and photographs.",
            "How to describe illustrations, photographs, and short video clips."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Thoughtful readers utilize illustrations to gain information and enhance understanding from a variety of text types (print and digital).",
            "Growing readers analyze visual images/illustrations in stories. This helps them to gain a deeper understanding of the text.",
            "Readers use the visual images to assist in making predictions, inferences, and drawing conclusions about characters, settings, and events."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use illustrations to make predictions before and during reading.",
            "Use illustrations to answer questions or learn more about the characters, setting, and/or plot of the story.",
            "Use illustrations to give additional clues to help the reader infer or draw conclusions when reading.",
            "Use captions to gain understanding when reading.",
            "Use digital aids to gain more understanding when reading such as sidebars, information in text boxes, charts, etc."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "illustrations",
        "details",
        "describe",
        "story elements",
        "characters",
        "setting",
        "problem",
        "solution",
        "plot",
        "visual images",
        "predictions",
        "inferences",
        "draw conclusions",
        "events"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.2.8",
      "description": "Not applicable to literature. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.8",
      "grade": null,
      "description": "Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as the relevance and sufficiency of the evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": []
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": []
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": []
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.2.9",
      "description": "Compare and contrast two or more versions of the same story (e.g., Cinderella stories) by different authors or from different cultures. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: compare, contrast, similarities, differences, diverse, perspectives, adventures, experiences, characters, story elements, feelings, actions, thoughts"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify basic story structure elements (e.g., characters, setting, plot).",
            "How to identify and describe the settings in multiple texts.",
            "How to identify and describe character traits in multiple texts.",
            "How to determine the central message or lesson of multiple texts."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Thoughtful readers think about characters' feelings, actions, and how they solve their problems within each text they compare or contrast.",
            "Growing readers recognize similarities and differences in different versions of the same text.",
            "Authors write different versions of stories to convey cultural differences and diverse perspectives."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Read two or more versions of the same story.",
            "Identify the narrative elements in each version of the story.",
            "o Compare and contrast the characters.",
            "o Compare and contrast the settings.",
            "o Compare and contrast the plots."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "compare",
        "contrast",
        "similarities",
        "differences",
        "diverse",
        "perspectives",
        "adventures",
        "experiences",
        "characters",
        "story elements",
        "feelings",
        "actions",
        "thoughts"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Literature",
    "reporting_category": "Range of Reading and Level of Text Complexity",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.2.10",
      "description": "By the end of the year, read and comprehend literature, including stories and poetry, in the grades 2-3 text complexity band proficiently, with scaffolding as needed at the high end of the range. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: monitor thinking, utilize prior knowledge, ask questions, visualize information, determine importance, summarize, synthesize, just-right text, complex text, literary, informational, variety of genres, comprehension within/beyond the text"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.10",
      "grade": null,
      "description": "Read and comprehend complex literary and informational texts independently and proficiently."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to read text from a variety of text genres on a second grade reading level.",
            "How to choose just-right text for independent reading."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Read and discuss text on second or third grade level text complexity.",
            "Growing readers participate in rich, small- and whole- group readings where they focus on comprehending within and beyond the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Utilize comprehension strategies (e.g., activating relevant background knowledge, creating visual images, drawing inferences, asking questions, determining important ideas, and synthesizing) to gain deeper understanding of text independently and in small- and large-group settings."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "monitor thinking",
        "utilize prior knowledge",
        "ask questions",
        "visualize information",
        "determine importance",
        "summarize",
        "synthesize",
        "just-right text",
        "complex text",
        "literary",
        "informational",
        "variety of genres",
        "comprehension within/beyond the text"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.2.1",
      "description": "Ask and answer such questions as who, what, where, when, why, and how to demonstrate understanding of key details in a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: texts, predictions, inferences, literally, multi-paragraph selections, background knowledge, draw conclusions, text features, main Idea, key details, question stems"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.1",
      "grade": null,
      "description": "Read closely to determine what the text says explicitly and make logical inferences from it; cite specific textual evidence and when writing or speaking to support conclusions drawn from the text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify the genre of text to assist in setting a purpose for reading.",
            "How to ask and answer questions based on personal interest and general wonderings when reading informational text.",
            "How to utilize text features to help tell the difference between important and unimportant information",
            "How to understand the difference between main ideas and key details within specific paragraphs or multi-paragraph selections."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Growing readers use prior knowledge to gain understanding of information contained in a text.",
            "Readers make predictions and inferences before, during, and after reading.",
            "Growing readers ask and answer questions before, during, and after reading.",
            "Readers ask questions to clarify the information that doesn't make sense.",
            "Active readers make notes using symbols and words of questions they have while reading. Sometimes they find the answers to these questions in the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Generate questions using key words and answer questions about the topic (main idea) and key (supporting) details.",
            "Take notes based on reading with a question in mind.",
            "Demonstrate understanding orally or in writing about details in the text by asking questions such as who, what, where, when, why, or how.",
            "Use information from the text and background knowledge to make inferences and cite evidence from the text when asking and answering questions that are not literally given in the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "texts",
        "predictions",
        "inferences",
        "literally",
        "multi-paragraph selections",
        "background knowledge",
        "draw conclusions",
        "text features",
        "main Idea",
        "key details",
        "question stems"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.2.2",
      "description": "Identify the main topic of a multi-paragraph text as well as the focus of specific paragraphs within the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: main topic, key details, multi-paragraph, focus, paragraphs, inference, text feature, text structure, summarize, connection, synthesize information, clarify meaning, determine importance"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.2",
      "grade": null,
      "description": "Determine central ideas or themes of a text and analyze their development; summarize the key supporting details and ideas."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to understand types of informational text: expository, technical texts, literary nonfiction.",
            "How to locate the main topic in informational text.",
            "How to understand the difference between the main topic and key ideas.",
            "How to demonstrate the ability to understand the main topic one paragraph at a time."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors of informational text utilize text features to present key ideas to help their readers gain meaning.",
            "Authors of informational text utilize multiple paragraphs to provide information on a single topic to their readers.",
            "Good readers infer main ideas and key details from text.",
            "Growing readers connect key ideas to determine the main topic of text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine the main topic or main idea of an entire passage with multiple paragraphs.",
            "Identify the main idea of each paragraph within a multi-paragraph text.",
            "Summarize orally or in writing the main topic of multi-paragraph text utilizing supporting details and ideas."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "main topic",
        "key details",
        "multi-paragraph",
        "focus",
        "paragraphs",
        "inference",
        "text feature",
        "text structure",
        "summarize",
        "connection",
        "synthesize information",
        "clarify meaning",
        "determine importance"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.2.3",
      "description": "Describe the connection between a series of historical events, scientific ideas or concepts, or steps in technical procedures in a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: connection, historical events, scientific ideas, technical steps, text structure, text feature, literary nonfiction, nonfiction, expository, transition words"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.3",
      "grade": null,
      "description": "Analyze how and why individuals, events, or ideas develop and interact over the course of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to understand types of informational text: literary nonfiction, expository, technical, etc.",
            "How to use text features.",
            "How to make connections (self, text, world) within and across multiple texts.",
            "How simple transition words such as first, next, then, and that identify sequences that signal varying types of text structures and show connections of ideas."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors of informational text utilize varying text structures (e.g., cause/effect, sequence, chronology). This helps readers make connections between ideas, concepts, and steps in a process.",
            "Growing readers take notes to organize their thinking so they are able to logically describe connections within text.",
            "Readers recognize signal words and transitions that connect ideas (e.g., is, are, because, same, different, first, next, etc.) in different types of informational text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the main topic (idea) of a text.",
            "Establish a connection, link, or relationship to the events, ideas, or steps that relate to the main topic.",
            "Identify the description, cause and effect, or problem and solution of the actions, events, ideas, concepts, or steps and how they relate to the topic.",
            "o How do the events, ideas, concepts, or steps fit together to tell about the topic?",
            "o How did Martin Luther King, Jr.'s actions lead to his death?"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "connection",
        "historical events",
        "scientific ideas",
        "technical steps",
        "text structure",
        "text feature",
        "literary nonfiction",
        "nonfiction",
        "expository",
        "transition words"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.2.4",
      "description": "Determine the meaning of words and phrases in a text relevant to a grade 2 topic or subject area. Desired Student Performance A student should know (Prerequisite Knowledge) How to understand the signal or transition words association with the eight types of context clues (e.g., description, sequence, cause and effect, etc.). A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: dictionaries, glossaries, drop-down menus, words and phrases, strategies, context, affixes, root words, literal, nonliteral, figurative language, text features, clarify, background knowledge, mental images, transition words"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.4",
      "grade": null,
      "description": "Interpret words and phrases as they are used in a text, including determining technical, connotative, and figurative meanings, and analyze how specific word choices shape meaning or tone."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to utilize text features to determine and clarify meanings of words and phrases in informational texts.",
            "How to access background knowledge and experiences to determine and clarify meanings of unknown words and phrases. Read and reread other sentences and non-linguistic images in the text to identify context clues."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Often, authors put clues within a text to help readers determine the meanings of unknown words.",
            "Determine unknown words and phrases utilizing an array of strategies: sentence-level context, affixes, root words.",
            "Use dictionaries and glossaries in print or digital forms to determine or clarify meanings of words and phrases, when necessary.",
            "Recognize words have literal and nonliteral meanings.",
            "Identify simple, figurative language."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify unknown words when reading.",
            "Use vocabulary strategies to determine the meaning of a word in context.",
            "o Use context clues such as definitions, examples, synonyms, antonyms, etc., within the text.",
            "Ask for help from teachers or peers in determining the meaning of unknown vocabulary words.",
            "Determine the appropriate definitions of words with more than one meaning using context clues or reference materials when necessary."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "dictionaries",
        "glossaries",
        "drop-down menus",
        "words and phrases",
        "strategies",
        "context",
        "affixes",
        "root words",
        "literal",
        "nonliteral",
        "figurative language",
        "text features",
        "clarify",
        "background knowledge",
        "mental images",
        "transition words"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.2.5",
      "description": "Know and use various text features (e.g., captions, bold print, subheadings, glossaries, indexes, electronic menus, icons) to locate key facts or information in a text efficiently. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: text features, informational text, text structure, determine importance"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.5",
      "grade": null,
      "description": "Analyze the structure of texts, including how specific sentences, paragraphs, and larger portions of the text (e.g., a section, chapter, scene, or stanza) relate to each other and the whole."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The basic types of text features found in informational text (e.g., subheadings, photographs, captions, bold print, glossaries, electronic menus, icons).",
            "How to explain the purpose of text features in informational text.",
            "How to recognize that text features assist readers in locating information quickly."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors select the appropriate text feature for a given task or information they plan to share.",
            "Readers can tell the difference between the types of text features (e.g., print features, organizational and graphic aids) and their purposes used in informational text.",
            "Readers must utilize all parts of informational text (text features and words) in order to gain full understanding of the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify different types of text features within a text.",
            "Be able to explain the purpose of different types of text features within a text.",
            "Explain how various text features help readers learn new information from a text from text.",
            "Identify the information provided in the different types of text features used in the text.",
            "Use text features to answer questions about the main topic."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "text features",
        "informational text",
        "text structure",
        "determine importance"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.2.6",
      "description": "Identify the main purpose of a text, including what the author wants to answer, explain, or describe. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: purpose of type of text, author, answer, explain, describe, organizational structure, author's purpose, word choice, graphic representations, draw conclusions, make generalizations, infer, determine importance, use background knowledge, synthesize information, question the text, create visual images"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.6",
      "grade": null,
      "description": "Assess how point of view or purpose shapes the content and style of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to locate information provided by words or graphic representations in a text.",
            "How to identify the intended audience for a piece of informational writing.",
            "Words and pictures contained in a text convey the author's purpose for writing the text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Thoughtful readers examine the organization structure of an informational text to determine the author's purpose (e.g., offer an opinion, describe, inform, etc.)",
            "An author's purpose affects word choice and graphic representation presented to their readers.",
            "Readers draw conclusions and make generalizations from text to form new understanding from the information an author includes in their writing."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the author's purpose for writing the text.",
            "Identify the main topic (main idea) of the text.",
            "Identify the specific type of text (e.g., article, journal, newspaper article, brochure, etc.)",
            "Identify the key (supporting) details of the text.",
            "Use the information above to determine, infer, or draw a conclusion about the main purpose of the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "purpose of type of text",
        "author",
        "answer",
        "explain",
        "describe",
        "organizational structure",
        "author's purpose",
        "word choice",
        "graphic representations",
        "draw conclusions",
        "make generalizations",
        "infer",
        "determine importance",
        "use background knowledge",
        "synthesize information",
        "question the text",
        "create visual images"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.2.7",
      "description": "Explain how specific images (e.g., a diagram showing how a machine works) contribute to and clarify a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: images, clarify meaning, graphic images, print and digital formats, determine importance, prior knowledge, ask and answer questions"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.7",
      "grade": null,
      "description": "Integrate and evaluate content presented in diverse media and formats, including visually and quantitatively, as well as in words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to explain information gained from graphic images (e.g., photographs, illustrations, maps, charts, etc.)",
            "How to identify the main topic and key ideas presented in specific visual images.",
            "How to identify commonalities between text and text features. How do they support each other?"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors include Images (e.g., photographs, illustrations, short video clips, diagrams, etc.) to convey meaning for the reader.",
            "Growing readers identify and describe how graphic representations are used to facilitate understanding in print and digital formats of diverse media."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Provide an explanation of how specific images contribute to and/or clarify a text.",
            "Demonstrate the use of information attained from graphics/images and words to make meaning from informational text.",
            "Explain what illustrations describe in a text.",
            "Explain the purpose of specific illustrations in a text.",
            "Explain how the use of illustrations and details describe the key ideas in the text.",
            "Identify the relationship between text and illustrations and how they support one another."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "images",
        "clarify meaning",
        "graphic images",
        "print and digital formats",
        "determine importance",
        "prior knowledge",
        "ask and answer questions"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.2.8",
      "description": "Describe how reasons support specific points the author makes in a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: author, support, details, points, relevant, irrelevant, reasons, examples"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.8",
      "grade": null,
      "description": "Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as the relevance and sufficiency of the evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Informational authors write about topics, and they use key or supporting details to make their point.",
            "How to identify key details in text.",
            "How to determine relevant details an author uses to support their point."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors choose specific details to convey a particular message or share the accuracy of their information.",
            "Growing readers identify and explain reasons and examples an author uses to make their point in text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Provide a description of how reasons in a text support specific points made by the author."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "author",
        "support",
        "details",
        "points",
        "relevant",
        "irrelevant",
        "reasons",
        "examples"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.2.9",
      "description": "Compare and contrast the most important points presented by two texts on the same topic. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: compare, contrast, important points, informational texts, similarities, differences, patterns, connections, determine importance"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify a topic of a text.",
            "How to recognize texts with the same topic.",
            "How to discuss objects that are similar or different.",
            "Descriptions in informational text are words that describe ideas or things.",
            "Procedures are steps that happen in order to do or make something."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Growing readers determine importance of specific points authors make. They take notes to help them compare and contrast multiple texts.",
            "Readers have greater understandings when they connect new learning to previous experiences.",
            "Growing readers that identify similarities and differences between informational texts discover patterns and make connections."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Read two texts on the same topic.",
            "Identify the topic of both texts.",
            "Explain how the two texts on the same topic are alike.",
            "Explain how two texts on the same topic are different.",
            "Understand what the author says about the topic in both texts.",
            "Understand what can be learned about the topic in both texts."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "compare",
        "contrast",
        "important points",
        "informational texts",
        "similarities",
        "differences",
        "patterns",
        "connections",
        "determine importance"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Informational Text",
    "reporting_category": "Range of Reading and Level of Text Complexity",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.2.10",
      "description": "By the end of the year, read and comprehend informational texts, including history/social studies, science, and technical texts, in grades 2-3 text complexity band proficiently, with scaffolding as needed at the high end of the range. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: monitor thinking, utilize prior knowledge, ask questions, visualize information, determine importance, summarize, synthesize, just-right text, complex text, literary, informational, variety of genres, comprehension within/beyond the text"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.10",
      "grade": null,
      "description": "Read and comprehend complex literary and informational texts independently and proficiently."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to read text from a variety of text genres on a second grade reading level.",
            "How to choose grade appropriate text for independent reading."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Readers read and discuss text on a second or third grade level text complexity.",
            "Growing readers understand the characteristics of informational text.",
            "Growing readers participate in rich, small- and whole- group readings where they focus on comprehending within and beyond the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Utilize comprehension strategies to gain deeper understanding in small groups, whole groups, and independent readings.",
            "o activating relevant background knowledge",
            "o creating visual images, drawing inferences",
            "o asking questions",
            "o determining important ideas",
            "o summarizing",
            "o synthesizing"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "monitor thinking",
        "utilize prior knowledge",
        "ask questions",
        "visualize information",
        "determine importance",
        "summarize",
        "synthesize",
        "just-right text",
        "complex text",
        "literary",
        "informational",
        "variety of genres",
        "comprehension within/beyond the text"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.2.1",
      "description": "Not Applicable in grade 2. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD:"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.1",
      "grade": null,
      "description": "Demonstrate understanding of the organization and basic features of print."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": []
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": []
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": []
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.2.2",
      "description": "Not Applicable in grade 2. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD:"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.2",
      "grade": null,
      "description": "Demonstrate understanding of spoken words, syllables, and sounds (phonemes)."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": []
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": []
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": []
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.2.3a",
      "description": "Distinguish long and short vowels when reading regularly spelled one-syllable words. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: long vowel, short vowel, vowel sounds, one-syllable words"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.3",
      "grade": null,
      "description": "Know and apply grade-level phonics and word analysis skills in decoding words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Vowels make special sounds.",
            "Words are made of syllables.",
            "There are different syllable patterns."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understand that some letter combinations result in one sound.",
            "Understand that vowels can have long and short sounds.",
            "Decode regularly spelled one-syllable words. Identify and say the vowel sounds based on vowel patterns."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify when a vowel is short or long in a one-syllable word.",
            "Sort words into two categories: long, short.",
            "Use letter combinations to decode one-syllable words.",
            "Use the rules to decode words that should have a short vowel sound.",
            "Use the rules to decode words that should have a long vowel sound.",
            "Segment and blend words based on specific vowel patterns.",
            "Identify CVC, CVCe, CVVC, CCVVC, CVVCC pattern words.",
            "Identify open and closed syllables."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "long vowel",
        "short vowel",
        "vowel sounds",
        "one-syllable words"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.2.3b",
      "description": "Know spelling-sound correspondences for additional common vowel teams. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: vowel teams, spelling, vowel sounds, variant, diagraphs"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.3",
      "grade": null,
      "description": "Know and apply grade-level phonics and word analysis skills in decoding words"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Know final -e and common vowel team conventions for representing long vowel sounds.",
            "Recognize certain vowel combinations allow for a short or long vowel sound."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understand each sound in a given word also represents a letter or a group of letters.",
            "Understand vowel sounds in a word will possibly represent vowel teams.",
            "Have an understanding of how vowel teams are represented in writing."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify sounds for grade-level vowel teams (e.g., ay, ee, -e, igh, ie, ow, ue).",
            "Decode single-syllable words with grade-level vowel teams.",
            "Write the spelling representations for grade-level vowel teams.",
            "Identify sounds for vowel diagraphs.",
            "Decode single-syllable words with variant vowel digraphs.",
            "Write the spelling representations for variant vowel digraphs."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "vowel teams",
        "spelling",
        "vowel sounds",
        "variant",
        "diagraphs"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.2.3c",
      "description": "Decode regularly spelled two-syllable words with long vowels. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: decode, consonant, correspondences, two-syllable words, long vowel sounds, syllabication rules"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.3",
      "grade": null,
      "description": "Know and apply grade-level phonics and word analysis skills in decoding words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The spelling-sound correspondences for common consonant digraphs (two letters that represent one sound).",
            "How to decode regularly spelled one-syllable words.",
            "Final -e and common vowel team conventions for representing long vowel sounds.",
            "How to use knowledge that every syllable must have a sound to determine the number of syllables in a printed word.",
            "How to decode two-syllable words following basic patterns by breaking the words into syllables."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understand every syllable must have vowel.",
            "Use syllabication rules in determining vowel sounds.",
            "Apply vowel rules to determine whether a word has a long vowel sound."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use strategies to determine the syllables in a word with a long vowel sound.",
            "Circle syllables in two-syllable words with a long vowel sound.",
            "State each syllable in a word whether each syllable is said in part or in chunks (e.g., mon-key).",
            "State the syllables and blend the syllables together to form the word."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "decode",
        "consonant",
        "correspondences",
        "two-syllable words",
        "long vowel sounds",
        "syllabication rules"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.2.3d",
      "description": "Decode words with common prefixes and suffixes. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: affixes, prefixes, suffixes, root words"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.3",
      "grade": null,
      "description": "Know and apply grade-level phonics and word analysis skills in decoding words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Affixes are added to help add to a word's meaning."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Demonstrate an understanding that many words are made up of affixes (prefixes and suffixes).",
            "Understand that when an affix is added, it is added to a base word.",
            "How to read words with common affixes (prefixes: un-, re-, in-, dis-) (suffixes: -s, -ed, -ing, -er)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify a base word and then use the affix to help determine the meaning of the word."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "affixes",
        "prefixes",
        "suffixes",
        "root words"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.2.3e",
      "description": "Identify words with inconsistent but common spelling-sound correspondences. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: spelling rules, decoding"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.3",
      "grade": null,
      "description": "Know and apply grade-level phonics and word analysis skills in decoding words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Understand that letter sound correspondence can help determine the spelling of words.",
            "Individual phonemes have distinguished sounds.",
            "Individual sounds blend together to make a word."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understand that not all words follow the common spelling rules.",
            "Know grade-level high frequency words."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Apply spelling sound rules to determine an unknown word."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "spelling rules",
        "decoding"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.2.3f",
      "description": "Recognize and read grade-appropriate irregularly spelled words. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Irregularly, random"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.3",
      "grade": null,
      "description": "Know and apply grade-level phonics and word analysis skills in decoding words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The spelling of a word helps a reader to read the word."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Identify irregularly spelled words.",
            "Strategies for recognizing patterns and sounds of irregularly spelled words (e.g., -ough in tough, rough, enough)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Read grade-level words that have irregular spellings in random order on cards.",
            "Read grade-level words that have irregular spellings in texts."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Irregularly",
        "random"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.2.4a",
      "description": "Read on-level text with purpose and understanding. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: read on-level text, read with a purpose"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.4",
      "grade": null,
      "description": "Read with sufficient accuracy and fluency to support comprehension."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The different purposes for reading texts.",
            "How to participate in reading of different genres of text.",
            "Grade-level vocabulary."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Know the purpose for reading on-level text.",
            "Understand reading with a purpose will aid in checking for comprehension while reading."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Predict what a text may be about before reading.",
            "Check the predictions of text during reading.",
            "Check for understanding of comprehension before, during, and after reading."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "read on-level text",
        "read with a purpose"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.2.4b",
      "description": "Read on-level text orally with accuracy, appropriate rate, and expression on successive readings. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: read on-level text, read orally, expression"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.4",
      "grade": null,
      "description": "Read with sufficient accuracy and fluency to support comprehension."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Text needs to be read with accuracy to aid comprehension.",
            "Successive readings of a text help a reader read with accuracy, appropriate rate, and expression."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Strategies for how to read with accuracy.",
            "Strategies for how to adapt oral reading rate to fit the purpose and context of the reading.",
            "While reading, determine how to read grade-level words accurately and repeatedly.",
            "Use decoding strategies and skills when reading on-level words.",
            "Punctuation is used to help express the meaning of the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Read text aloud.",
            "Read text aloud with fluency.",
            "Read text aloud fluently with appropriate rate.",
            "Read text aloud fluently with appropriate rate and expression.",
            "Read fluently when reading a passage successively.",
            "Read fluently using punctuation to assist in reading with expression."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "read on-level text",
        "read orally",
        "expression"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.2.4c",
      "description": "Use context to confirm or self-correct word recognition and understanding, rereading as necessary. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: self-correct, monitor, reread, misread, context, meaning"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Reading Foundational Skills",
      "reporting_category": null,
      "id": "CCR.RF.4",
      "grade": null,
      "description": "Read with sufficient accuracy and fluency to support comprehension."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Word meaning can be gained from context around an unknown word."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Monitor one's reading to understand when comprehension is not taking place.",
            "Self-correct when a word is misread and reread the sentence."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use appropriate grade-level strategies to decode words.",
            "Use the context of a sentence, picture, or text to help with word recognition.",
            "Use the context of a sentence, picture, or text to assist in understanding word meaning."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "self-correct",
        "monitor",
        "reread",
        "misread",
        "context",
        "meaning"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.2.1",
      "description": "Write opinion pieces in which they introduce the topic or book they are writing about, state an opinion, supply reasons that support the opinion, use linking words (e.g., because, and, also) to connect opinion and reasons, and provide a concluding statement or section. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: topic, perspective, argument, opinion, schema, background knowledge, point of view, fact, reasons, evidence, composing, research, transition words, revise, edit"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The concepts of fact and opinion.",
            "How to form an opinion about a topic or text and provide reasons to support an opinion using evidence (e.g., facts, reasons, examples).",
            "How to utilize informational resources (e.g., text, multimedia).",
            "Transition words that connect their opinion to reasons (e.g., because, and also)",
            "How to utilize reference materials to check and correct spellings.",
            "Writers include a beginning, middle, and end when sharing their opinion."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Growing writers look at examples of writing to assist them when composing.",
            "Writers share reasons that support their opinion using facts, details, or text evidence.",
            "Writers revise their writing to add relevant details that strengthen their writing.",
            "Writers edit their writing to check for spelling and conventions to help their readers.",
            "Authors use the appropriate vocabulary including linking words and phrases to connect opinion and reasons."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Compose a piece of writing in which the student",
            "o Names the topic",
            "o States an opinion",
            "o Provides at least one reason to support the opinion",
            "o Provides a strong concluding statement or section",
            "Identify and explain an opinion that focuses on the relationships between ideas (e.g., cause and effect, examples) that support the opinion in a paragraph or multiple paragraph text.",
            "State an author's opinion about a topic based on evidence from the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "topic",
        "perspective",
        "argument",
        "opinion",
        "schema",
        "background knowledge",
        "point of view",
        "fact",
        "reasons",
        "evidence",
        "composing",
        "research",
        "transition words",
        "revise",
        "edit"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.2.2",
      "description": "Write informative/explanatory texts in which they introduce a topic, use facts and definitions to develop points, and provide a concluding statement or section. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: informative/explanatory writing, author's craft, reference materials, dictionaries, digital resources, topic, details, revise, word choice, vivid language, transition words, edit, grammar, spelling"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative/explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Types of informative writing.",
            "How to identify a topic and provide relevant information (e.g., facts, examples, definitions) that relate to the topic.",
            "The concept of beginning a new paragraph.",
            "How to review a repertoire of effective beginnings and conclusions.",
            "Varying types of transitions words depending on the text structure."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors of informative writing provide information to teach their reader about a topic using details that clarify meaning.",
            "Growing writers of informative/explanatory writing share information related to real-world topics and tasks.",
            "Writers utilize reference materials to gain information, revise text to help the reader make meaning then edit to correct capitalization, punctuation, and spelling."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Compose a piece of writing (paragraphs, essays, posters, etc.) that explains, informs, or describes in which the students",
            "o Introduce the topic",
            "o Supply some facts about the topic",
            "o Provide definitions to clarify and develop points",
            "o Provide concluding statement or section",
            "Use facts, definitions, and examples, personal experiences in the writing that elaborates and clarifies the subject."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "informative/explanatory writing",
        "author's craft",
        "reference materials",
        "dictionaries",
        "digital resources",
        "topic",
        "details",
        "revise",
        "word choice",
        "vivid language",
        "transition words",
        "edit",
        "grammar",
        "spelling"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.2.3",
      "description": "Write narratives in which they recount a well-elaborated event or short sequence of events, include details to describe actions, thoughts, and feelings, use temporal words to signal event order, and provide a sense of closure. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: narrative, temporal words and/or transition words, story grammar, planning, drafting, revising, editing, transitions, details, events, closure"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details and well-structured event sequences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Narratives entertain and inform the reader with real or imagined events.",
            "Narrative writing comes in different forms.",
            "An event is an activity or action that happens in a certain place during a specific period.",
            "How to orally recount an event with a beginning, middle, and end, on a focused topic that includes details.",
            "Temporal words that signal the passing of time (e.g., later, after a while, before bed)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Growing writers utilize prewriting strategies (e.g., oral, pictorial, written).",
            "Authors elaborate on relevant details/examples by incorporating thoughts, actions and, feelings of the subjects.",
            "Writers revise their work focusing on word choice to help their reader create mental images for their writing.",
            "Writers revise their text to help the reader make meaning then edit to correct capitalization, punctuation, and spelling."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Generate a narrative text recounting a person's experience sequencing the events that occurred.",
            "Provide specific details that explain and describe the actions that occurred.",
            "Recount a short sequence of events utilizing temporal words that signal the passage of time.",
            "Create a fictional story with a detailed sequence of events that includes narrative elements such as a character, setting, plot, problem, and solution.",
            "Generate multiple drafts before carrying one through the writing process."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "narrative",
        "temporal words and/or transition words",
        "story grammar",
        "planning",
        "drafting",
        "revising",
        "editing",
        "transitions",
        "details",
        "events",
        "closure"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.2.4",
      "description": "Begins in grade 3. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD:"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.4",
      "grade": null,
      "description": "Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": []
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": []
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": []
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.2.5",
      "description": "With guidance and support from adults and peers, focus on a topic and strengthen writing as needed by revising and editing. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: topic, plan, draft, revise, edit, descriptive language, conventions, grammar, proofreading, syntax, clarity, focus, word choice, synonyms, similes, metaphors, analyze, informative"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.5",
      "grade": null,
      "description": "Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Revising is making changes to a piece of writing to make it more effective for the reader (e.g., clarity, focus, description, word choice, content).",
            "Editing is correcting writing for mechanical errors in conventions and grammar (e.g., spelling, capitalization, punctuation).",
            "Revising and editing are two different processes.",
            "Proofreading is the final step before publishing.",
            "Planning for writing may be oral, drawn, or written."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Growing writers write multiple drafts. They work with peers and adults to revise the topic so it is clear, well-developed, and easy to understand.",
            "Authors use good word choice (e.g., descriptive language, synonyms, similes, metaphors), and appropriate sequencing to make writing more interesting for the reader.",
            "Writers edit their writing by correcting conventions and grammar."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Writing is focused on a specific topic.",
            "Utilize the steps of a writing process to plan, draft, revise, and edit prior to publishing to improve flow, description, and check for mechanical errors.",
            "Analyze suggestions provided by peers and adults to make decisions on what elements to revise to make the writing clear, informative, descriptive, or convincing.",
            "Analyze conventions and grammar to edit based on suggestions provided by peers and adults."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "topic",
        "plan",
        "draft",
        "revise",
        "edit",
        "descriptive language",
        "conventions",
        "grammar",
        "proofreading",
        "syntax",
        "clarity",
        "focus",
        "word choice",
        "synonyms",
        "similes",
        "metaphors",
        "analyze",
        "informative"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.2.6",
      "description": "With guidance and support from adults, use a variety of digital tools to produce and publish writing, including in collaboration with peers. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: digital tools, drop-down menus, word processing software, drawing programs, digital images, audio recordings, podcasts, blogging, emailing, social media, texting, presentations, backchanneling, audio tracks, produce, publish, collaborate, draft, revise, edit"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.6",
      "grade": null,
      "description": "Use technology, including the Internet, to produce and publish writing and to interact and collaborate with others."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Digital tools may be used to produce and publish writing.",
            "Digital tools may be used for communication (e.g., texting, emailing, blogging, using social media, and publishing digital images).",
            "Writers select the digital tool according to the task, audience, or purpose."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Writers use digital tools to enhance their writing (e.g., word processing software, drawing programs, cameras, audio recording tools, podcast tools). They determine which tool should be utilized to produce or publish writing.",
            "Authors determine the digital tools to be utilized based on the task or purpose (e.g., blogging, texting, creating presentations, backchanneling, creating audio tracks, etc.).",
            "Writers use peers and digital tools (e.g., drop-down menus with spelling/grammar check, thesaurus) to edit and enhance their work."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Compose and publish a writing product. Use a variety of digital tools (e.g., story- telling software, drawing software, voice recording software) to produce, share, and publish writing.",
            "Collaborate with peers to produce and publish writing, using a variety of digital tools.",
            "Students may demonstrate this standard in conjunction with writing standards 1, 2, 3, 5, 7, and 8 and/or reading standards."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "digital tools",
        "drop-down menus",
        "word processing software",
        "drawing programs",
        "digital images",
        "audio recordings",
        "podcasts",
        "blogging",
        "emailing",
        "social media",
        "texting",
        "presentations",
        "backchanneling",
        "audio tracks",
        "produce",
        "publish",
        "collaborate",
        "draft",
        "revise",
        "edit"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.2.7",
      "description": "Participate in shared research and writing projects (e.g., read a number of books on a single topic to produce a report; record science observations). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: research, data, facts, relevant information, resources, note taking, organize, inquiry, investigation"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.7",
      "grade": null,
      "description": "Conduct short as well as more sustained research projects based on focused questions, demonstrating understanding of the subject under investigation."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Research is the act of gathering data, facts, and information based on a focus question.",
            "How to determine which resources might provide information about a specific topic (e.g., books, photos, video clips, websites, personal experiences, interviews)",
            "How to record new information through note- taking methods.",
            "How to determine if information is relevant to a research topic.",
            "Writing should be organized in a logical manner."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Writers research information to learn more about their subject. Their information can be shared through a variety of methods (e.g., print, digital, text features, sequence of events, procedures).",
            "Authors investigate and read about their topic before they compose their writing.",
            "Growing writers decide which important information should be included in their research project."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Participate in shared research and writing projects.",
            "Listen to or read a variety of texts on a specific topic and use information gained from the reading when writing.",
            "Create an inquiry and writing project that demonstrates new understandings gained from an investigation.",
            "Utilize resources to gain information that will enhance the writing topic.",
            "Look at mentor text for inspiration in generating a variety of writing (e.g., \"how-tos\", lab reports, nonfiction chapter books)."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "research",
        "data",
        "facts",
        "relevant information",
        "resources",
        "note taking",
        "organize",
        "inquiry",
        "investigation"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.2.8",
      "description": "Recall information from experiences or gather information from provided sources to answer a question. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: recall, address, background knowledge, sources, question, answer, note taking, accurate"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.8",
      "grade": null,
      "description": "Gather relevant information from multiple print and digital sources, assess the credibility and accuracy of each source, and integrate the information while avoiding plagiarism."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Information can be found in a source (e.g., book, magazine, Internet, etc.) or from a person's experiences.",
            "A question is a statement that requests information.",
            "Answers provide the information to address a question.",
            "Background knowledge or past experiences may be important when answering questions."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors gather information from sources and use their background knowledge when answering research questions.",
            "Writers collect information by taking notes. This helps them to hold on to their new learning and use their own words when composing.",
            "Authors use and cite multiple sources to make sure they have accurate information."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write in response to a prompt or question.",
            "Recall information from personal experiences to answer a question in writing.",
            "Gather accurate information from provided print and digital sources to answer a question."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "recall",
        "address",
        "background knowledge",
        "sources",
        "question",
        "answer",
        "note taking",
        "accurate"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.2.9",
      "description": "Begins in grade 4. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD:"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.9",
      "grade": null,
      "description": "Draw evidence from literary or informational texts to support analysis, reflection, and research."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": []
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": []
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": []
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Writing",
    "reporting_category": "Range of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.2.10",
      "description": "Begins in grade 3. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD:"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.10",
      "grade": null,
      "description": "Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of tasks, purposes, and audiences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": []
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": []
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": []
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.2.1a",
      "description": "Follow agreed-upon rules for discussions (e.g., gaining the floor in respectful ways, listening to others with care, speaking one at a time about the topics and texts under discussion). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: discussions, rules, respectful, wait, appropriate, share, listen, prompted, participate"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Participate in collaborative conversations with diverse partners about grade 2 topics and texts with peers and adults in small and larger groups."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to participate in collaborative conversations with diverse partners about grade 2 topics and texts with peers and adults in small and larger groups.",
            "How to participate in collaborative conversations with diverse partners about grade 2 topics and texts with peers and adults in small and larger groups."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understand the class rules for discussions.",
            "Understand the proper expectations for following the agreed-upon rules for classroom discussions."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Follow the appropriate rules when participating in discussions.",
            "Listen to classmates share and discuss a topic.",
            "Provide information about a topic to peers in a group discussion.",
            "Wait the appropriate turn before speaking.",
            "Participate in discussion when prompted."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "discussions",
        "rules",
        "respectful",
        "wait",
        "appropriate",
        "share",
        "listen",
        "prompted",
        "participate"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.2.1b",
      "description": "Build on others' talk in conversations by linking their comments to the remarks of others. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: listen effectively, build on, add ideas, discussion, conversation, comments, remarks, linking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "LS",
      "reporting_category": null,
      "id": "CCR.LS.1",
      "grade": null,
      "description": "Participate in collaborative conversations with diverse partners about grade 2 topics and texts with peers and adults in small and larger groups."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to listen to a peer's comments on a given topic and then continue the discussion by providing more information.",
            "How to listen to a peer's comments on a given topic and topic and then continue the discussion by restating what has been shared.",
            "How to listen effectively to respond to others comments.",
            "How to listen effectively to others' comments to build on the provided information about a given topic of discussion."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understand how to build on others' talk in conversation by adding comments.",
            "Understand how to build on others' talk in conversation by linking comments to the remarks of others.",
            "Listen to others' discussion in a group and wait to respond when a turn arises."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Listen to peers' comments during a discussion.",
            "Consider what to share during the discussion.",
            "Share information about the topic during the discussion.",
            "Decide as the discussion continues if he/she can share more information.",
            "Link comments to others' remarks."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "listen effectively",
        "build on",
        "add ideas",
        "discussion",
        "conversation",
        "comments",
        "remarks",
        "linking"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.2.1c",
      "description": "Ask for clarification and further explanation as needed about the topics and texts under discussion. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: clarification, explain, explanation, discuss, topic, confusion"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Participate in collaborative conversations with diverse partners about grade 2 topics and texts with peers and adults in small and larger groups."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Collaborative conversations take place when partners work together to discuss a given topic.",
            "Questions will need to be asked when there is confusion in the conversation.",
            "Questions will need to be answered when there is confusion in the conversation."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understand when clarification is needed to better understand a topic or text under discussion.",
            "Understand how to ask for clarification to better understand a topic or text under discussion.",
            "Understand how to ask for more explanation to better understand a topic or text under discussion."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Discuss grade 2 topics with peers and/or adults in small- and large-group settings.",
            "Ask for clarification when confusion arises about the topics and texts under discussion.",
            "Ask for further explanations when confusion arises about the topics and texts under discussion."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "clarification",
        "explain",
        "explanation",
        "discuss",
        "topic",
        "confusion"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.2.2",
      "description": "Recount or describe key ideas or details from a text read aloud or information presented orally or through other media. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: recount, describe, key ideas, details, retell, important, major, media, orally"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.2",
      "grade": null,
      "description": "Integrate and evaluate information presented in diverse media and formats, including visually, quantitatively, and orally."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Key ideas help a reader understand a text.",
            "Details help support a key idea.",
            "Information can be gained from text read aloud or presented orally through other media."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understand how to recount key ideas or details from a text read aloud or information presented orally through other media.",
            "Understand how to describe key ideas or details from a text read aloud or information presented orally or through other media."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Listen to a story being read aloud and orally retell the events of the story.",
            "Watch a video and orally retell what was shared.",
            "Include important text elements when retelling a story.",
            "Describe key ideas or details from a text read aloud or information presented orally or through other media."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "recount",
        "describe",
        "key ideas",
        "details",
        "retell",
        "important",
        "major",
        "media",
        "orally"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.2.3",
      "description": "Ask and answer questions about what a speaker says in order to clarify comprehension, gather additional information, or deepen understanding of a topic or issue. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: ask, clarification, answer, questions, comprehension"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.3",
      "grade": null,
      "description": "Evaluate a speaker's point of view, reasoning, and use of evidence and rhetoric."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "When more information is needed to understand what a speaker has stated.",
            "How to ask questions about what a speaker says to gather additional information.",
            "How to ask questions about what a speaker says to clarify something that is not understood.",
            "How to answer questions about what a speaker says."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understand how to ask questions about what a speaker says to clarify comprehension, gather additional information, or deepen understanding of a topic or issue.",
            "Understand how to answer questions about what a speaker says to clarify comprehension, gather additional information, or deepen understanding of a topic or issue."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Ask others for help when clarification of a topic is needed.",
            "Ask others for more information to clarify when something is not understood.",
            "Ask for clarification when something is not understood.",
            "Answer others' questions when they request clarification."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "ask",
        "clarification",
        "answer",
        "questions",
        "comprehension"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.2.4",
      "description": "Tell a story or recount an experience with appropriate facts and relevant, descriptive details, speaking audibly in coherent sentences. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: tell, recount, facts, relevant, descriptive details, coherent, sentences, audibly, coherent sentences"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.4",
      "grade": null,
      "description": "Present information, findings, and supporting evidence such that listeners can follow the line of reasoning and the organization, development, and style are appropriate to task, purpose, and audience."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Learners' experience is an important part of the learning process.",
            "Learners can share personal experiences with others by orally telling others about the experiences.",
            "Descriptive language can refer to adjectives or adverbs that help explain what happened in the story or why something happened in a story."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understand how to tell a story with appropriate facts and relevant, descriptive details, speaking audibly in coherent sentences.",
            "Understand how to recount a story with appropriate facts and relevant, descriptive details, speaking audibly in coherent sentences."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Tell a story about a personal experience.",
            "Provide appropriate facts and relevant, descriptive details, speaking audibly in coherent sentences when telling about an experience.",
            "Use adjectives to help add descriptive details when retelling an experience.",
            "Include major key detail such as who was there, where the event took place, what happened, how or why it happened."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "tell",
        "recount",
        "facts",
        "relevant",
        "descriptive details",
        "coherent",
        "sentences",
        "audibly",
        "coherent sentences"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.2.5",
      "description": "Create audio recordings of stories or poems; add drawings or other visual displays to stories or recounts of experiences when appropriate to clarify ideas, thoughts, and feelings. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: create, audio, recordings, add, drawings, recounts, clarify, appropriate"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How and when to add drawings to descriptions to clarify ideas.",
            "How and when to add drawings to descriptions to clarify thoughts.",
            "How and when to add drawings to descriptions to clarify feelings.",
            "How and when to add other visual displays to descriptions to clarify ideas.",
            "How and when to add other visual displays to descriptions to clarify thoughts.",
            "How and when to add other visual displays to descriptions to clarify feelings."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understand how to create audio recordings of stories or poems.",
            "Understand how to add drawings to stories or recounts of experiences when appropriate to clarify ideas, thoughts, and feelings.",
            "Understand how to add other visual displays to stories or recounts of experiences when appropriate to clarify ideas, thoughts, and feelings."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Create audio recordings of stories or poems.",
            "Draw what is described in print.",
            "Add visuals to information described in print.",
            "Add drawings to stories or recounts of experiences to give more details to what has been described.",
            "Add drawings to clarify ideas.",
            "Add drawings to clarify thoughts.",
            "Add drawings to clarify feelings.",
            "Add other visual displays to clarify ideas, thoughts, and feelings."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "create",
        "audio",
        "recordings",
        "add",
        "drawings",
        "recounts",
        "clarify",
        "appropriate"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.2.6",
      "description": "Produce complete sentences when appropriate to task and situation in order to provide requested detail or clarification. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: produce, complete sentence, subject, predicate, complete thought, express"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.6",
      "grade": null,
      "description": "Adapt speech to a variety of contexts and communicative tasks, demonstrating command of formal English when indicated or appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That to express a thought to others, the thought will need to be spoken.",
            "When a complete sentence needs to be used to help others understand.",
            "The meaning and function of subjects and predicates."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understand how to produce complete sentences to provide requested details or clarifications.",
            "A complete sentence contains a subject and predicate and expresses a complete thought."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Verbally express thoughts to others.",
            "Verbally express thoughts, feelings, and ideas in a way for others to understand them.",
            "Uses complete sentences when speaking when making statements.",
            "Uses complete sentences when asking questions."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "produce",
        "complete sentence",
        "subject",
        "predicate",
        "complete thought",
        "express"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.1a",
      "description": "Use collective nouns (e.g., group). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: noun, collective noun, subject, verb, singular, plural, group, classify, demonstrate, command, conventions, standard English, grammar, usage, writing, speaking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Words in our language can be grouped into categories based on how we use the word.",
            "A noun names a person, place, or thing.",
            "Nouns are used as subjects in sentences.",
            "The subject and the verb must match."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Collective nouns name groups composed of members.",
            "Depending on the context, collective nouns can be considered singular or plural.",
            "When the members of the group do an action at the same time, the collective noun is considered singular.",
            "Examples of collective nouns are band, class, family, group, crowd, company, audience, etc."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify collective nouns.",
            "Select collective nouns in sentences.",
            "Use collective nouns correctly when writing or speaking sentences."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "noun",
        "collective noun",
        "subject",
        "verb",
        "singular",
        "plural",
        "group",
        "classify",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "grammar",
        "usage",
        "writing",
        "speaking"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.1b",
      "description": "Form and use frequently occurring irregular plural nouns (e.g., feet, children, teeth, mice, fish). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) Short a to short e (man, men) oo to ee (long e) Foot to feet A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: noun, singular, plural, regular, irregular, distinguish, form, use, demonstrate, command, conventions, standard English, grammar, usage, writing, speaking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A noun names a person, place, or thing.",
            "Some nouns can be made plural by adding /s/ or /es/ to the end."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Not all nouns are made plural by adding /s/ or /es/ to the end.",
            "There are many rules for irregular plurals.",
            "o Change f to v and add es (calf, calves)",
            "o Some words have no change (sheep, sheep)",
            "o Change the vowel sound:"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Distinguish between regular and irregular plural nouns.",
            "Form an irregular plural noun by starting with the singular form.",
            "Use frequently occurring irregular plural nouns in sentences."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "noun",
        "singular",
        "plural",
        "regular",
        "irregular",
        "distinguish",
        "form",
        "use",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "grammar",
        "usage",
        "writing",
        "speaking"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.1c",
      "description": "Use reflexive pronouns (e.g., myself, ourselves). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, reflexive pronouns, distinguish, purpose, singular, plural, demonstrate, command, conventions, grammar, usage, writing, speaking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Pronouns name a noun.",
            "Different types of pronouns can be used."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Pronouns can be used to refer back to the subject of the sentence.",
            "Pronouns can be singular or plural.",
            "Reflexive pronouns end in -self (singular) or -selves (plural).",
            "Reflexive pronouns are used to help sentences make sense."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Distinguish between different types of pronouns and their purposes.",
            "Identify the purpose of reflexive pronouns.",
            "Distinguish the difference between singular and plural reflexive pronouns.",
            "Use reflexive pronouns in sentences."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "reflexive pronouns",
        "distinguish",
        "purpose",
        "singular",
        "plural",
        "demonstrate",
        "command",
        "conventions",
        "grammar",
        "usage",
        "writing",
        "speaking"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.1d",
      "description": "Form and use the past tense of frequently occurring irregular verbs (e.g., sat, hid, told). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: form, use, frequently occurring, irregular verbs, regular verbs, tense, time, action, special, distinguish, sentences, demonstrate, command, conventions, standard English, grammar, usage, writing, speaking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Verbs express action.",
            "Verbs have different tenses.",
            "Verbs can be used to express time."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Verbs can be regular or irregular.",
            "Some but not all verbs can be formed into the past tense by adding -ed to the end of the verb.",
            "Irregular verbs are special verbs whose past tenses are formed using special rules."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Distinguish between regular and irregular verbs.",
            "Form the past tenses of frequently occurring irregular verbs.",
            "Use the past tenses of frequently occurring irregular verbs in sentences."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "form",
        "use",
        "frequently occurring",
        "irregular verbs",
        "regular verbs",
        "tense",
        "time",
        "action",
        "special",
        "distinguish",
        "sentences",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "grammar",
        "usage",
        "writing",
        "speaking"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.1e",
      "description": "Use adjectives and adverbs, and choose between them depending on what is to be modified. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD adjectives, adverbs, choose, modified, use, nouns, distinguish, sentence, demonstrate, command, conventions, standard English, grammar, usage, writing, speaking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Adjectives describe nouns."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Adverbs often tell when, where, why, or under what conditions something happens or happened.",
            "Adjectives and adverbs modify words."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Distinguish the difference between an adjective and an adverb depending upon what is modified in a sentence.",
            "Use adjectives and adverbs to give specific details about the words they modify.",
            "Use adjectives and adverbs in a sentence."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.1f",
      "description": "Produce, expand, and rearrange complete simple and compound sentences (e.g., The boy watched the movie; The little boy watched the movie; The action movie was watched by the little boy). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: produce, prepositions, prepositional phrases, expand, rearrange, complete, simple, compound, sentences, demonstrate, command, conventions, standard English, grammar, usage, writing, speaking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Complete simple sentences are different from compound sentences.",
            "Sentences can be expanded by the addition of words.",
            "A simple sentence contains a subject and verb and makes a complete thought.",
            "Conjunctions are joining words that are used to join words and sentences.",
            "Adjectives are words that describe nouns, pronouns.",
            "Adverbs are words that describe verbs or other adverbs.",
            "Prepositions are words that show how one noun relates to another noun in a sentence.",
            "Prepositional phrases begin with a preposition and end with a noun."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Sentences can be rearranged to form different types of sentences.",
            "Expanding sentences adds to the reader's interest.",
            "A compound sentence is formed by combining two simple sentences using a comma and conjunction.",
            "Adjectives and adverbs can be added to sentences to expand simple sentences.",
            "Sentences can be produced in typewritten, cursive, and printed form."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Create a complete simple sentence and a compound sentence.",
            "Expand a complete simple sentence and a compound sentence.",
            "Rearrange a complete simple sentence and a compound sentence.",
            "Create a compound sentence from two simple sentences.",
            "Identify the two sentences within a compound sentence.",
            "Add adjectives to expand sentences.",
            "Add adverbs to expand sentences.",
            "Add prepositional phrases to expand sentences."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "produce",
        "prepositions",
        "prepositional phrases",
        "expand",
        "rearrange",
        "complete",
        "simple",
        "compound",
        "sentences",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "grammar",
        "usage",
        "writing",
        "speaking"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.2a",
      "description": "Capitalize holidays, product names, and geographic names. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: capitalize, holidays, product names, geographic names, dates, names, first word, I, select, write, sentences, demonstrate, command, conventions, standard English, capitalization, punctuation, spelling, writing"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Dates, names of people, the first word in a sentence, and the pronoun should be capitalized."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Certain words should be capitalized and others should not.",
            "Holidays, product names, and geographic names are some of the words that should be capitalized."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Select sentences that are correctly capitalized (contains words that are holidays, product names, and geographic names).",
            "Write sentences containing words that are holidays, product names, and geographic names that are correctly capitalized."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "capitalize",
        "holidays",
        "product names",
        "geographic names",
        "dates",
        "names",
        "first word",
        "I",
        "select",
        "write",
        "sentences",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "capitalization",
        "punctuation",
        "spelling",
        "writing"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.2b",
      "description": "Use commas in greetings and closings of letters. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, commas, greetings, closings, letters, pauses, separate, write, after, select, demonstrate, command, conventions, standard English, capitalization, punctuation, spelling, writing"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Commas create pauses when a speaker reads a sentence containing them.",
            "Commas are used to separate the day from the year.",
            "Commas are used to separate single words in a series."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A comma should be used after a greeting when writing a letter.",
            "A comma should be used after the closing when writing a letter."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Select a greeting and closing within a letter that has commas placed correctly.",
            "Write a letter where commas are used in the greeting and closing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "commas",
        "greetings",
        "closings",
        "letters",
        "pauses",
        "separate",
        "write",
        "after",
        "select",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "capitalization",
        "punctuation",
        "spelling",
        "writing"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.2c",
      "description": "Use an apostrophe to form contractions and frequently occurring possessives. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, apostrophe, form, contractions, possessives, nouns, singular, plural, shortened, omit, letters, permissible, writing, speaking, select, demonstrate, command, conventions, standard English, capitalization, punctuation, spelling, writing"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Possessive pronouns show ownership.",
            "Nouns can be singular or plural.",
            "An apostrophe is shaped like a comma, but is used along the top of the letters in a contraction or possessive."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Contractions are shortened forms of a word created by omitting letters that are replaced with an apostrophe.",
            "Contractions are not commonly accepted as permissible words in formal writing.",
            "Contractions are commonly accepted as permissible words in speaking.",
            "Apostrophes can be used to make a noun possessive.",
            "The apostrophe's placement depends on whether the noun is singular or plural."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Select correctly written contractions.",
            "Select correctly written possessives.",
            "Use an apostrophe to form a contraction.",
            "Use an apostrophe to show possession in frequently occurring possessives."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "apostrophe",
        "form",
        "contractions",
        "possessives",
        "nouns",
        "singular",
        "plural",
        "shortened",
        "omit",
        "letters",
        "permissible",
        "writing",
        "speaking",
        "select",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "capitalization",
        "punctuation",
        "spelling",
        "writing"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.2d",
      "description": "Generalize learned spelling patterns when writing words (e.g., cagebadge; boyboil). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: generalize, learned, phonic, diphthongs, syllable, articulated, patterns, words, use, demonstrate, command, combinations, conventions, standard English, capitalization, punctuation, spelling, writing, correspondence"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Certain patterns in spelling exist.",
            "The sounds in words can help determine how words are spelled.",
            "Phonic patterns involve a correspondence of phoneme (sounds) to letter (s).",
            "Phonic patterns: vowels and vowel patterns, consonant blends, consonant and vowel digraphs, diphthongs, etc., are represented by specific letter or letter combinations to make each sound."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Some spelling patterns can help write other words.",
            "Most words follow specific syllable and vowel rules.",
            "A letter or combination of letters can represent one sound.",
            "The location of letters in words can affect the articulation of the sound.",
            "o Example: usually when e is written after c, the c makes the soft sound /s/ as in cent.",
            "o Syllable patterns affect how the vowel is articulated."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use spelling patterns that have been learned to write new words.",
            "Identify spelling or phonic pattern of spoken words.",
            "Blend spoken words and then spell the words based on the phonic patterns in the words.",
            "Write sound to letter(s) correspondence."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "generalize",
        "learned",
        "phonic",
        "diphthongs",
        "syllable",
        "articulated",
        "patterns",
        "words",
        "use",
        "demonstrate",
        "command",
        "combinations",
        "conventions",
        "standard English",
        "capitalization",
        "punctuation",
        "spelling",
        "writing",
        "correspondence"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.2e",
      "description": "Consult reference materials, including beginning dictionaries, as needed to check and correct spellings. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: alphabetical, consult, reference materials, beginning dictionaries, correct, check, use, demonstrate, command, conventions, standard English, capitalization, punctuation, spelling, writing"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Some words have a conventional spelling.",
            "A dictionary is book that contains a list words in alphabetical order and gives the meanings, spelling, articulation, and parts of speech for the words.",
            "Alphabetical order is when words are organized based on the first letter or more of a word placed in the order of the alphabet."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Reference materials contain correct spellings.",
            "Reference materials can be used to check and correct spellings.",
            "The words in a dictionary are listed in alphabetical order."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use a glossary to check the spelling of vocabulary words.",
            "Use a dictionary to check the spelling of selected words.",
            "Use sound patterns in a word to look the word up in the dictionary and to check the spelling of the word.",
            "Use principal of alphabetical order to find a word in a dictionary to check the spelling of the word."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "alphabetical",
        "consult",
        "reference materials",
        "beginning dictionaries",
        "correct",
        "check",
        "use",
        "demonstrate",
        "command",
        "conventions",
        "standard English",
        "capitalization",
        "punctuation",
        "spelling",
        "writing"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Knowledge of Language",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.3a",
      "description": "Compare formal and informal uses of English. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: compare, formal English, informal English, distinguish, comprehend, text, apply, govern, language knowledge, understand, language functions, contexts, effective choices, meaning, style, reading, listening, pronoun-antecedent agreement, conversations, grammar"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.3",
      "grade": null,
      "description": "Apply knowledge of language to understand how language functions in different contexts, to make effective choices for meaning or style, and to comprehend more fully when reading or listening."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Both formal and informal English language is used.",
            "Distinguish the difference between the way words are used at home and the way words are used at school.",
            "There are rules that govern language."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Formal and informal English are different.",
            "Formal English is used when writing.",
            "Informal English is used in informal conversations.",
            "Different contexts call for the choice of using formal or informal English."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Distinguish between formal and informal English to comprehend text.",
            "Use formal English when writing.",
            "Use informal English when speaking informally.",
            "Use correct subject-verb agreement when speaking and writing.",
            "Use correct pronoun-antecedent agreement when speaking and writing.",
            "Apply standard grammar rules when speaking and writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "compare",
        "formal English",
        "informal English",
        "distinguish",
        "comprehend",
        "text",
        "apply",
        "govern",
        "language knowledge",
        "understand",
        "language functions",
        "contexts",
        "effective choices",
        "meaning",
        "style",
        "reading",
        "listening",
        "pronoun-antecedent agreement",
        "conversations",
        "grammar"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.4a",
      "description": "Use sentence-level context as a clue to the meaning of a word or phrase. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, sentence, context, clue, meaning, word, phrase, determine, clarify, new, unknown words, multiple-meaning words, phrases, context clues, analyzing, word parts, consulting, reference materials, synonyms, antonyms"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "New meanings of familiar words can be determined.",
            "Often the author will give clues in the text to help the reader figure out the meaning of an unknown word.",
            "Context clues are clues in text that the reader can use to determine meaning."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The context of the sentence can serve as a clue to determine the meaning of a word or phrase.",
            "Readers can reread the sentence and look for clues that help determine the meaning of a word."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use vocabulary strategies to determine the meaning of unknown words in a text.",
            "Rereads the sentence to look for clues that help determine the meaning of the unknown word.",
            "o Look for synonyms or antonyms"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "sentence",
        "context",
        "clue",
        "meaning",
        "word",
        "phrase",
        "determine",
        "clarify",
        "new",
        "unknown words",
        "multiple-meaning words",
        "phrases",
        "context clues",
        "analyzing",
        "word parts",
        "consulting",
        "reference materials",
        "synonyms",
        "antonyms"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.4b",
      "description": "Determine the meaning of the new word formed when a known prefix is added to a known word (e.g., happy/unhappy, tell/retell). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: determine, meaning, new word, prefix, suffix, added, known, clarify, unknown words, multiple-meaning words, phrases, context clues, analyzing, word parts, consulting, reference materials"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Prefixes are word parts added to the beginning of a word that modify meaning.",
            "Suffixes are parts added to the end of a word that modify meaning.",
            "Affixes give a clue as to the meaning of a word."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Words can be built with a root word and affixes.",
            "Affixes give a clue to the meaning of a word.",
            "Prefixes and suffixes have meanings.",
            "When added to a word, prefixes and suffixes change the meaning of unknown words."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify grade appropriate prefixes and suffixes.",
            "Identify words with grade appropriate prefixes and suffixes.",
            "Determine words with and without affixes.",
            "Create new words using grade appropriate prefixes and suffixes.",
            "Determine the meaning of a word based on its prefix or suffix."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "determine",
        "meaning",
        "new word",
        "prefix",
        "suffix",
        "added",
        "known",
        "clarify",
        "unknown words",
        "multiple-meaning words",
        "phrases",
        "context clues",
        "analyzing",
        "word parts",
        "consulting",
        "reference materials"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.4c",
      "description": "Use a known root word as a clue to the meaning of an unknown word with the same root (e.g., addition, additional). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, known, root word, clue, meaning, determine, clarify, isolate, unknown words, multiple-meaning words, phrases, context clues, analyzing, word parts, consulting, reference materials"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Affixes are word parts that are added to a root word or base word.",
            "Prefixes and suffixes are affixes.",
            "Affixes change the meaning of the root or base word.",
            "A root word is the original word and cannot be broken into smaller words or word parts."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Knowing the meaning of a root word and inflections can help determine the meaning of a word.",
            "Readers must learn to identify inflectional endings and then determine when an inflectional ending is used with a root word."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Read a word and determine if the word has an affix (prefix or suffix).",
            "Identify the root word.",
            "Identify the affix (prefix or suffix).",
            "Create new words by adding affixes (prefixes or suffixes) to the root word.",
            "Isolate the root word from the affix."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "known",
        "root word",
        "clue",
        "meaning",
        "determine",
        "clarify",
        "isolate",
        "unknown words",
        "multiple-meaning words",
        "phrases",
        "context clues",
        "analyzing",
        "word parts",
        "consulting",
        "reference materials"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.4d",
      "description": "Use knowledge of the meaning of individual words to predict the meaning of compound words (e.g., birdhouse, lighthouse, housefly; bookshelf, notebook, bookmark). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, knowledge, meaning, individual words, predict, compound words, root words, determine, clarify, unknown words, multiple-meaning words, phrases, context clues, analyzing, word parts, consulting, reference materials"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Root words have meanings that are helpful in determining the meanings of unknown words.",
            "Compound words are formed when two words are joined to make a new word.",
            "Each word in a compound word has meaning."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Knowing the meaning of individual words can help determine the meaning of compound words."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Name the meanings of individual words.",
            "Combine these words and use knowledge of their individual meanings to determine the meaning of the newly formed word.",
            "Segment compound words into each individual word.",
            "Create a compound word from a list of words."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "knowledge",
        "meaning",
        "individual words",
        "predict",
        "compound words",
        "root words",
        "determine",
        "clarify",
        "unknown words",
        "multiple-meaning words",
        "phrases",
        "context clues",
        "analyzing",
        "word parts",
        "consulting",
        "reference materials"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.4e",
      "description": "Use glossaries and beginning dictionaries, both print and digital, to determine or clarify the meaning of words and phrases. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, glossaries, beginning dictionaries, print, digital, determine, clarify, meaning, words, phrases, reference materials, unknown words, multiple-meaning words, phrases, context clues, analyzing, word parts, consulting, reference materials"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "There is a difference between glossaries and dictionaries.",
            "Glossaries and dictionaries are used to find or clarify the meaning of words and phrases.",
            "There is a difference between print and digital text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Reference materials can be used to determine or clarify the meanings of words and phrases."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "When reading or writing, look up word(s) in glossaries and dictionaries to help determine the meanings of a word(s) or phrase(s)."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "glossaries",
        "beginning dictionaries",
        "print",
        "digital",
        "determine",
        "clarify",
        "meaning",
        "words",
        "phrases",
        "reference materials",
        "unknown words",
        "multiple-meaning words",
        "phrases",
        "context clues",
        "analyzing",
        "word parts",
        "consulting",
        "reference materials"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.5a",
      "description": "Identify real-life connections between words and their use (e.g., describe foods that are spicy or juicy). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: identify, real-life connections, words, use, shows, understanding, word relationships, nuances, word meanings, demonstrate, figurative language, word meanings"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Words are a part of our daily lives.",
            "Words are used to tell stories, describe feelings, etc.",
            "Words are a vital part of how we communicate.",
            "Words make up our personal vocabulary.",
            "Vocabulary refers to the words we know how to say and words that we know the meanings of."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Words are useful when describing things that we know about.",
            "Words should be used to tell about an experience.",
            "Words are used to explain how we feel, what we think, and what we want."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify if a word is known or unknown when it is read or heard.",
            "Tell about a time when the word was used by the student or when the student heard someone use the word.",
            "Tell about a real-life experience in which the word (and/its meaning) was experienced by the students.",
            "o I went to the park with my family. I saw trees at the park. I saw people walking at the park. I played with my sister at the park."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "identify",
        "real-life connections",
        "words",
        "use",
        "shows",
        "understanding",
        "word relationships",
        "nuances",
        "word meanings",
        "demonstrate",
        "figurative language",
        "word meanings"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.5b",
      "description": "Distinguish shades of meaning among closely related verbs (e.g., toss, throw, hurl) and closely related adjectives (e.g., thin, slender, skinny, scrawny). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: distinguish, shades of meaning, closely related, verbs, adjectives, demonstrate, understanding, show, word relationships, nuances, word meanings, figurative language"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Some words can have very similar meanings.",
            "Synonyms are words that have similar meanings.",
            "Some verbs and adjectives have synonyms."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Verbs that differ in manner have shades of meaning.",
            "Adjectives can differ in intensity.",
            "The shade of meaning of a verb and/or adjective will determine which verb and/or adjective a writer will select for a piece of writing."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Define the different shades of meaning among verbs differing in manner and/or adjectives differing in intensity.",
            "Determine how synonyms differ by acting out the meaning of each word.",
            "Choose the correct shade of meaning among verbs differing in manner and/or adjectives differing in intensity.",
            "Act out the meaning of the different synonyms (shades of meaning) among verbs and/or adjectives differing in intensity."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "distinguish",
        "shades of meaning",
        "closely related",
        "verbs",
        "adjectives",
        "demonstrate",
        "understanding",
        "show",
        "word relationships",
        "nuances",
        "word meanings",
        "figurative language"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "2",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.2.6",
      "description": "Use words and phrases acquired through conversations, reading and being read to, and responding to texts, including using adjectives and adverbs to describe (e.g., When other kids are happy that makes me happy). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: use, words, phrases, acquired, conversations, reading, being read to, responding to texts, adjectives, adverbs, newly, demonstrates, statement"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.6",
      "grade": null,
      "description": "Acquire and use accurately a range of general academic and domain-specific words and phrases sufficient for reading, writing, speaking, and listening at the college and career readiness level; demonstrate independence in gathering vocabulary knowledge when encountering an unknown term important to comprehension or expression."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Words and phrases, including frequently occurring conjunctions, should be used that were acquired through conversations, reading and being read to, and responding to text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Newly acquired words and phrases including adjectives and adverbs should be used to help with reading, writing, speaking, and listening."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "When writing or speaking, use words and phrases that have been learned, including adjectives and adverbs to describe."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "use",
        "words",
        "phrases",
        "acquired",
        "conversations",
        "reading",
        "being read to",
        "responding to texts",
        "adjectives",
        "adverbs",
        "newly",
        "demonstrates",
        "statement"
      ]
    }
  }
]