[
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.4.1",
      "description": "Refer to details and examples in a text when explaining what the text says explicitly and when drawing inferences from the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Details, examples, explicit and implicit, inferences, infer, questioning"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.1",
      "grade": null,
      "description": "Read closely to determine what the text says explicitly and to make logical inferences from it; cite specific textual evidence when writing or speaking to support conclusions drawn from the text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to ask questions before, during, and after reading.",
            "How to answer questions (who, what, when, where, why, and how) about specific details from the text.",
            "How to visualize key elements within the text.",
            "How to provide oral and written explanations that show understanding of a text, referring explicitly to the text.",
            "How to reference details and/or examples in a text when explaining the basis for the answers."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How authors include key details in literary texts, which may help a reader ask and answer questions.",
            "How readers use examples and details from the text to support their inferences.",
            "How readers use textual evidence and personal connections to make inferences and draw conclusions about what is read.",
            "How readers use details and examples in a text to make meaning."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Make and revise predictions.",
            "Answer questions during reading by using a combination of key details, background knowledge, and personal connections.",
            "Refer to details and examples in a text when explaining what the text says explicitly.",
            "Refer to details and examples from the text when drawing inferences."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Details",
        "examples",
        "explicit and implicit",
        "inferences",
        "infer",
        "questioning"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.4.2",
      "description": "Determine a theme of a story, drama, or poem from details in the text; summarize the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Recount, retell, determine, story, drama, poem, central idea, theme, key details, summarize,"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.2",
      "grade": null,
      "description": "Determine central ideas or themes of a text and analyze their development; summarize the key supporting details and ideas."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to know the characteristics of an effective retelling/recounting of events from a story.",
            "How to know the difference between a central idea and key details in a story.",
            "How to know that the theme is the lesson or moral that the writer wants to get across in his or her story."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How authors of literary texts include details that help readers determine the theme or central idea(s).",
            "How readers generate effective summaries that capture central idea(s) or theme of the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine the theme of literary text(s)",
            "Identify the difference between the theme and details in story.",
            "Identify characteristics of an effective summary for literary texts.",
            "Summarize literary text(s) by including the theme and how it is conveyed through key details."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.4.3",
      "description": "Describe in depth a character, setting, or event in a story or drama, drawing on specific details in the text (e.g., a character's thoughts, words, or actions). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Character, villain, hero, major/minor character, setting, plot, climax, resolution, conflict, drama, describe, in-depth, event, thoughts, words, actions, man vs. man, man vs. self, man vs. nature, turning point, scenes, dialogue"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.3",
      "grade": null,
      "description": "Analyze how and why individuals, events, or ideas develop and interact over the course of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That stories are written to include characters and characters roles (hero/villain, major/minor), setting, plot (e.g., events, climax/turning point, resolution), and conflict (man vs. man, man vs. self, man vs. nature).",
            "That authors include characters' traits, actions, feelings, and words when writing literary texts.",
            "That authors use elements of drama such as scenes, dialogue, and stage directions.",
            "That characters' traits, motivations, and feelings impact the events in the text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How authors use specific details in a story or drama to describe characters, settings, or events.",
            "How readers use specific details from a literary text to support their thinking about characters, settings, or events."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify important, specific details that support key ideas.",
            "Identify and describe the plot events in a story or drama.",
            "Describe the setting and characters of a story or drama, referring to specific details."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.4.4",
      "description": "Determine the meaning of words and phrases as they are used in a text, including those that allude to significant characters found in mythology (e.g., Herculean). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Context clues, determine, distinguish, interpret, clarify, mythology, figurative language, literary devices, word choice, antonym, synonym, fables, legends"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.4",
      "grade": null,
      "description": "Interpret words and phrases as they are used in a text, including determining technical, connotative, and figurative meanings, and analyze how specific word choices shape meaning or tone."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors use figurative language and literary devices to convey meaning.",
            "That authors use different types of context clues to convey meaning of unknown words (e.g., definition, example, antonym, synonym).",
            "That authors use words/phrases that reference well-known characters or stories (e.g., from mythology, fairy tales, fables, legends)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How authors make purposeful language choices to create meaning in literary text(s).",
            "How readers seek the meaning of unknown words/phrases to clarify understanding of literary text(s)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use context clues to help unlock the meaning of unknown words/phrases",
            "Determine the appropriate definition of words with more than one meaning.",
            "Differentiate between literal and non-literal language.",
            "Interpret figurative language and literary devices.",
            "Describe how figurative language, literary devices, and other language choices enhance meaning.",
            "Determine the meaning of words and phrases used within literary texts, including those that allude to significant characters found in mythology."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.4.5",
      "description": "Explain major differences between poems, drama, and prose, and refer to the structural elements of poems (e.g., verse, rhythm, meter) and drama (e.g., casts of characters, settings, descriptions, dialogue, stage directions) when writing or speaking about a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Genre, drama, prose, poem, structural elements, verse, rhythm, meter, casts, settings, descriptions, dialogue, stage directions, text structure, stanza"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.5",
      "grade": null,
      "description": "Analyze the structure of texts, including how specific sentences, paragraphs, and larger portions of the text (e.g., a section, chapter, scene, or stanza) relate to each other and the whole."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors use different characteristics when writing poems, dramas, and prose.",
            "That authors organize texts using different types of structures (e.g., sentences, paragraph, chapter, section, stanza, scenes).",
            "How to understand the relationship between parts of text and the whole text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors' choices of text structures vary according to genre.",
            "That authors' choices of text structures vary according to the purpose of the text.",
            "How readers understand the structure of a text and use this information to make sense of what they read.",
            "How readers understand the structure of a literary text varies by genre."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the genre of a literary text.",
            "Describe the structural elements of prose, poems, and drama when writing or speaking about a text.",
            "Explain major differences between poems, drama, and prose referring to their specific structural elements when writing or speaking about a text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.4.6",
      "description": "Compare and contrast the point of view from which different stories are narrated, including the difference between first- and third-person narrations. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Compare, contrast, point of view, narration, first-person, third-person, author's purpose"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.6",
      "grade": null,
      "description": "Assess how point of view or purpose shapes the content and style of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify similarities and differences among literary texts.",
            "That author's write from different points of view.",
            "That author's write for a variety of purposes.",
            "How to identify characteristics of first-person point of view and third-person point of view within literary text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The author's purpose for writing affects how he or she organizes the text.",
            "The author's purpose for writing affects the narrator's point of view.",
            "How readers recognize similarities and differences between first- and third-person's point of view."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the author's purpose for writing a literary text.",
            "Identify the point of view from which different stories are narrated.",
            "Differentiate between first-person and third-person narration.",
            "Determine similar and different characteristics among different stories' points of view."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.4.7",
      "description": "Make connections between the text of a story or drama and a visual or oral presentation of the text, identifying where each version reflects specific descriptions and directions in the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Connections, story, drama, visual presentation, oral presentation, version, descriptions, visual tools, oral tools, illustrations"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.7",
      "grade": null,
      "description": "Integrate and evaluate content presented in diverse media and formats, including visually and quantitatively, as well as in words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That connections exist when a person, thing, or idea is associated with something else.",
            "How to identify similarities and differences between characteristics of literary texts.",
            "That authors include illustrations to enhance the reader's understanding of literary text.",
            "That authors use different versions of texts (e.g., written, print, digital, visual).",
            "That visual and oral tools are used to enhance the viewer's experience of the drama."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How authors/directors make purposeful choices, which may result in multiple interpretations of the same text.",
            "How readers make connections among the written, visual or oral presentations of literary texts to enhance understanding.",
            "How authors/directors use visual and/or oral presentations of the text to enhance the understanding of the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Recognize the tools used in visual and oral versions of a text.",
            "Compare and contrast the written version of text to the visual or oral presentation of the same text.",
            "Make connections between the text of a story or drama and a visual or oral presentation of the text, identifying where each version reflects specific descriptions and directions in the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.4.8",
      "description": "Not applicable to literature. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.8",
      "grade": null,
      "description": "Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as the relevance and sufficiency of the evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": []
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": []
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": []
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.4.9",
      "description": "Compare and contrast the treatment of similar themes and topics (e.g., opposition of good and evil) and patterns of events (e.g., the quest) in stories, myths, and traditional literature from different cultures. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Compare, contrast, genre, theme, opposition of good and evil, pattern of events, quest, stories, myths, traditional literature, author's purpose, point of view, different cultures, conflict"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to compare and contrast elements of the text to enhance understanding.",
            "That authors write stories, myths, and traditional literature, which include a theme, characters, setting, and plot of events.",
            "That authors make purposeful choices when outlining patterns of events (e.g., reveal conflict, draw attention to an issue/event, predict the future, understand the past)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "An author's approach to a theme/topic is influenced by his or her point of view.",
            "How readers compare and contrast various texts to deepen understanding of themes/topics."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify characteristics of various genres.",
            "Identify the theme of a text.",
            "Identify and explain the author's purpose and point of view.",
            "Identify, cite, and explain textual evidence (examples of author's choices), which reveal the author's intentions/purposes.",
            "Compare/contrast the treatment of similar themes and topics and patterns of events in stories, myths, and traditional literature from different cultures."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Literature",
    "reporting_category": "Range of Reading and Level of Text Complexity",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.4.10",
      "description": "By the end of the year, read and comprehend literature, including stories, dramas, and poetry, in the grades 4-5 text complexity band proficiently, with scaffolding as needed at the high end of the range. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.10",
      "grade": null,
      "description": "Read and comprehend complex literary and informational texts independently and proficiently."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors write a variety of literary texts (e.g. stories, dramas, poetry).",
            "How to read text from a variety of text genres.",
            "How to choose \"just right\" text for independent reading."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That through independent, small, and whole group opportunities, readers focus on comprehending within and beyond the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Utilize comprehension strategies such as activating relevant background knowledge to gain deeper understanding independently and in small and large group settings.",
            "Utilize comprehension strategies such as creating visual images to gain deeper understanding independently and in small and large group settings.",
            "Utilize comprehension strategies such as drawing inferences to gain deeper understanding independently and in small and large group settings.",
            "Utilize comprehension strategies such as asking questions to gain deeper understanding independently and in small and large group settings.",
            "Utilize comprehension strategies such as determining important ideas to gain deeper understanding independently"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.4.1",
      "description": "Refer to details and examples in a text when explaining what the text says explicitly and when drawing inferences from the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Questioning, ask, answer, text, summarize, text evidence, explicitly stated, details, examples, drawing inferences, predict, explanation"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.1",
      "grade": null,
      "description": "Read closely to determine what the text says explicitly and to make logical inferences from it; cite specific textual evidence when writing or speaking to support conclusions drawn from the text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to ask questions before, during, and after reading.",
            "How to make, test, and revise predictions before, during, and after reading.",
            "How to use background knowledge to enhance understanding of informational text.",
            "How to answer questions (who, what, when, where, why, and how) about specific details from the text.",
            "That authors make purposeful decisions when organizing informational text (e.g., paragraphs, quotations, formatting)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How authors include key details, which help the reader ask and answer questions.",
            "How readers use examples and details to support their inferences.",
            "How readers use textual evidence and background knowledge to make inferences and draw conclusions.",
            "How readers make meaning using details and examples in informational text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Make, test, and revise predictions.",
            "Use textual evidence, background knowledge, and text-to-self connections to answer questions when reading or writing.",
            "Refer to details and examples from the text when explaining what the text says.",
            "Make inferences about author's decisions and the content of a text.",
            "Refer to details and examples from the text when drawing inferences."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.4.2",
      "description": "Determine the main idea of a text and explain how it is supported by key details; summarize the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Main idea, key details, text structure, recount, explain, summarize, support"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.2",
      "grade": null,
      "description": "Determine central ideas or themes of a text and analyze their development; summarize the key supporting details and ideas."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That informational text types may include literary nonfiction and expository/technical texts.",
            "The main idea of a text is the central thought or the point the author is trying to make.",
            "That readers use informational text features and/or text structures to help determine the main idea.",
            "That readers know how to participate in discussions when explaining their understanding of the texts.",
            "That summaries are a brief statement or account of the main points of a text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors of informational text(s) include key details to enhance the reader's understanding.",
            "How readers use key details in an informational text to identify the main topic.",
            "That informational texts have a structure, as well as details, which may help a reader determine the main ideas.",
            "How readers develop effective summaries that include main ideas of informational text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine the main idea of an informational text.",
            "Recognize how ideas are organized in an informational text.",
            "Explain orally or in writing how the main idea is supported by key details.",
            "Summarize orally or in writing the main idea, including the most important parts of the piece."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.4.3",
      "description": "Explain events, procedures, ideas, or concepts in a historical, scientific, or technical text, including what happened and why, based on specific information in the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Explain, analyze, relationships, series, historical events, ideas, concepts, technical procedure, steps, text structure, sequence, cause/effect, description, compare/contrast, problem/solution, signal words, scientific text"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.3",
      "grade": null,
      "description": "Analyze how and why individuals, events, or ideas develop and interact over the course of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That informational text types can include literary nonfiction and expository/technical texts.",
            "How to teach or explain to others information learned from informational text.",
            "That authors of informational texts may include key ideas/concepts, events, or steps in a process.",
            "That authors use various text structures when writing informational texts (e.g, time, sequence, cause/effect, steps).",
            "How to recognize connections and relationship among key ideas, people, events, or steps.",
            "That authors use transition words (e.g., therefore, because, as a result) to show relationships."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How authors include specific information to explain events, procedures, ideas and concepts in scientific, technical and historical texts and why they occur.",
            "The relationships between and among events, ideas/concepts or steps/procedures and use the information to synthesize what is read."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify events, key ideas/concepts, or steps in informational texts.",
            "Distinguish between key ideas and details from informational text that explain what happened and why.",
            "Identify and describe text structures the author uses in informational text.",
            "Identify signal words used to determine text structure.",
            "Explain how ideas, events, and steps are connected.",
            "Use specific information to support what and why events, ideas, procedures, events happened."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.4.4",
      "description": "Determine the meaning of general academic and domain-specific words or phrases in a text relevant to a Grade 4 topic or subject area. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD General academic words vs. domain-specific words/phrases (Tier II and Tier III words), context clues, figurative language, literal and nonliteral language"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.4",
      "grade": null,
      "description": "Interpret words and phrases as they are used in a text, including determining technical, connotative, and figurative meanings, and analyze how specific word choices shape meaning or tone."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors use figurative language to convey meaning.",
            "That authors use different types of context clues to convey meaning of unknown words (e.g., definition, example, antonym, synonym).",
            "How to employ strategies for identifying and using context clues.",
            "How to distinguish the literal and nonliteral meanings of words and phrases to make meaning."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How authors make purposeful language choices to create meaning in informational text(s).",
            "How readers actively seek the meaning of unknown words/phrases to clarify understanding.",
            "How readers use textual clues to develop an understanding of the meaning of unknown words/phrases."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use context clues to help unlock the meaning of unknown words/phrases.",
            "Determine the definition of words with multiple meanings.",
            "Describe how word choice creates and clarifies meaning.",
            "Differentiate between literal and nonliteral language.",
            "Identify and interpret figurative language."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.4.5",
      "description": "Describe the overall structure (e.g., chronology, comparison, cause/effect, problem/solution) of events, ideas, concepts, or information in a text or part of a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Describe, structure, chronological, comparison/contrast, cause/effect, problem/solution, signal words, text features"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.5",
      "grade": null,
      "description": "Analyze the structure of texts, including how specific sentences, paragraphs, and larger portions of the text (e.g., a section, chapter, scene, or stanza) relate to each other and the whole."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to describe text structure by teaching others certain features of informational text.",
            "That authors of informational text use different types of text structures to organize information.",
            "How to use the structure of the text (e.g., chronology, comparison, cause/effect, problem/solution) to make sense of the information that is presented and develop a deeper understanding of the informational presented in the text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That readers are aware of signal words to determine various text structures.",
            "How readers use text features to support understanding of informational texts.",
            "How authors present their ideas in an organizational pattern to achieve a particular purpose in the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine the text structures used by the author to organize information, events, ideas, or concepts in a text or part of a text.",
            "Provide a description of the overall structure of events, ideas, concepts, or information in a text or part of a text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.4.6",
      "description": "Compare and contrast a firsthand and secondhand account of the same event or topic; describe the differences in focus and the information provided. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Compare/contrast, account, firsthand, secondhand, primary source, secondary source, point of view, perspective, focus, style, author's purpose"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.6",
      "grade": null,
      "description": "Assess how point of view or purpose shapes the content and style of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors write for a variety of purposes (e.g., to inform, to persuade, to entertain, to describe, to explain).",
            "That authors write from different points of view.",
            "A firsthand account (primary source) is told from the perspective of a participant in the described event.",
            "A secondhand account (secondary source) is told from the perspective of someone who was not a participant in the described event.",
            "That there may be similarities and differences between firsthand and secondhand accounts of the same event."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The author's point of view affects the choices made when writing informational text.",
            "How readers research firsthand and secondhand accounts of the same event or topic to gather different information.",
            "How readers understand the same event or topic can be viewed differently when told from different perspectives."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify important details from the text that reveal the author's purpose.",
            "Identify the focus of both firsthand and secondhand accounts of an event or topic.",
            "Describe the similarities and differences between the information provided in different accounts of the same event or topic."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.4.7",
      "description": "Interpret information presented visually, orally, or quantitatively (e.g., in charts, graphs, diagrams, time lines, animations, or interactive elements on Web pages) and explain how the information contributes to an understanding of the text in which it appears. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Interpret, compare/contrast, explain, visually, orally, quantitatively, media, features, Internet, Web page, charts, graphs, diagrams, time lines, animations"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.7",
      "grade": null,
      "description": "Integrate and evaluate content presented in diverse media and formats, including visually and quantitatively, as well as in words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors use different forms of media to present information (e.g., visual, oral, quantitative).",
            "That authors use charts, graphs, diagrams, time lines, animations, or interactive elements on Web pages to provide more information for the reader.",
            "That authors use charts, graphs, diagrams, time lines, animations, or interactive elements on Web pages to describe and clarify key ideas from the text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How authors choose details and illustrations purposefully in an informational text to convey meaning.",
            "How readers use details and illustrations in informational text to make meaning."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Interpret information from charts, graphs, diagrams, time lines, animations, or interactive Web pages.",
            "Compare and contrast information from charts, graphs, diagrams, time lines, animations, or interactive Web pages.",
            "Evaluate why information is included or is not included in informational text.",
            "Explain how information contributes or improves understanding of the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.4.8",
      "description": "Explain how an author uses reasons and evidence to support particular points in a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Explain, reasons, evidence, key points, persuasive techniques, argument, support, relevant vs. irrelevant information, point of view"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.8",
      "grade": null,
      "description": "Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as the relevance and sufficiency of the evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors include main ideas and important points in informational text.",
            "That authors include supporting details to reinforce his or her main ideas.",
            "That authors use persuasive techniques (e.g., emotional words, repetition, name calling) to support his or her claim and/or purpose for writing.",
            "That relevant information is important and irrelevant information is not important."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That reasons and evidence are pieces of information that support particular points within a text.",
            "How readers identify reasons and evidence an author uses to support key ideas to build upon their understanding."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify key points within an informational text.",
            "Differentiate between relevant and irrelevant information.",
            "Provide a written or oral explanation of how an author uses reasons to support particular points in a text.",
            "Provide a written or oral explanation of how an author uses evidence to support particular points of view."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.4.9",
      "description": "Integrate information from two texts on the same topic in order to write or speak about the subject knowledgeably. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Integrate, synthesize, key points, relevant information, irrelevant information, topic, research, purposes for reading, graphic organizers, write, compose, speak, present, knowledgeably"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to compare and contrast elements of the text to enhance understanding.",
            "That authors include main ideas and important points in informational text.",
            "That authors include supporting details to reinforce his or her main ideas.",
            "How to set a purpose for researching and gathering information.",
            "How to manage information gathered from text using various graphic organizers.",
            "That information from two texts can be combined to create a more complete understanding of a topic."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors of informational texts provide information and key details on topics in different ways.",
            "How readers construct meaning by integrating important information included in two texts."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify key and relevant details on a single topic between two texts.",
            "Categorize key details from two texts.",
            "Differentiate between relevant information and irrelevant information.",
            "Combine information from two texts on the same topic.",
            "Speak knowledgeably about a topic, integrating information from two texts.",
            "Compose a piece of writing about a topic, integrating information from two texts."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Reading Informational Text",
    "reporting_category": "Range of Reading and Level of Text Complexity",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.4.10",
      "description": "By the end of year, read and comprehend informational texts, including history/social studies, science, and technical texts, in the grades 4-5 text complexity band proficiently, with scaffolding as needed at the high end of the range. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.10",
      "grade": null,
      "description": "Read and comprehend complex literary and informational texts independently and proficiently."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors write a variety of informational texts, including history/social studies, science, and technical texts.",
            "How to read text from a variety of text genres.",
            "How to choose \"just right\" text for independent reading."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Through independent, small, and whole group opportunities, how to focus on comprehending within and beyond the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Utilize comprehension strategies such as activating relevant background knowledge to gain deeper understanding independently and in small and large group settings.",
            "Utilize comprehension strategies such as creating visual images to gain deeper understanding independently and in small and large group settings.",
            "Utilize comprehension strategies such as drawing inferences to gain deeper understanding independently and in small and large group settings.",
            "Utilize comprehension strategies such as asking questions to gain deeper understanding independently and in small and large group settings."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.1a",
      "description": "Write opinion pieces on topics or texts, supporting a point of view with reasons and information. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Opinion pieces, topics, texts, supporting, point of view, reasons, information, introduce, writing, clearly, state an opinion, create organizational structure, related ideas are grouped, writer's purpose, view point, coherent, purposes, prove, analyze"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That opinion pieces are written to share a viewpoint about a text or topic.",
            "An introduction starts the opinion piece with a clear viewpoint about a topic or text.",
            "That opinions about topics or texts read are supported with reasons from the text.",
            "That reasons are organized in a logical way to create coherence."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That opinion writings are written to express a point about a topic or text.",
            "The introduction states the point the author is trying to make or prove about a text or topic.",
            "How using specific words or phrases enables writers to clearly communicate an opinion.",
            "That writers use specific words or phrases when composing opinion pieces (e.g., has an important lesson, knowledgeable, sensible/senseless).",
            "The author's opinion is supported with reasons from the text.",
            "That ideas are grouped in a logical way to give the reader an understanding of the authors' purpose for writing."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Read a mentor text or research a topic.",
            "Form an opinion based upon a text or topic.",
            "Determine the purpose for the opinion piece.",
            "Utilize a planning map or graphic organizer in order to group ideas to support the purpose for writing.",
            "State an opinion using specific words or phrases to clearly communicate the opinion."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.1b",
      "description": "Write opinion pieces on topics or texts, supporting a point of view with reasons and information. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Opinion, provide reasons, supported by facts and details, topic, text, researching, multiple sources, writing, note taking, reasoning, support"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A writer uses reasons from text to support opinions about a text or topic."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A writer develops the opinion about a text by providing reasons from the text read.",
            "That facts and details from the text are used to support the opinion."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify how an author uses facts to support the reasoning in an opinion piece in a mentor text.",
            "Choose facts and details from the text to support the opinion."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.1c",
      "description": "Write opinion pieces on topics or texts, supporting a point of view with reasons and information. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Opinion piece, linking words, linking phrases, connect, opinion, reasons, also, however, also, for instance, in order to, in addition, signal, direction, natural flow, organization, identifies, transitions, appropriate writing"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify linking words (e.g., because, therefore, since, for example).",
            "That linking words are used to connect the opinion and reasons."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How linking words and phrases signal the direction the writing is taking to the reader.",
            "How linking words and phrases connect the opinions and reasons within the paper for a natural flow for organization."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the places in the writing where transitions need to take place.",
            "Identify the appropriate linking words and phrases to use in the writing.",
            "Use linking words to connect and forward the opinion.",
            "Use linking phrases to connect and forward the opinion."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.1",
      "description": "Write opinion pieces on topics or texts, supporting a point of view with reasons and information. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Opinion piece, provide, concluding statement, concluding section, close, organization, recognize, ending, thoughts, related to the opinion presented"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That a writing piece must be organized.",
            "That a concluding statement or section brings a piece of writing to a close.",
            "That closings techniques for an opinion piece can vary (e.g., reinforcement, quotation, question)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A conclusion provides an ending to a piece written.",
            "A conclusion leaves the reader with something to think about.",
            "How conclusions act as a way for readers to clearly understand the opinion stated.",
            "The conclusion statement or section relates directly to the opinion made in the introduction."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Analyze how mentor texts close.",
            "Identify thought(s) to leave the reader with before writing the conclusion.",
            "Choose a closing technique (e.g., summarize information, quote, encourage action, restate the opinion).",
            "Write a concluding statement or section that relates directly to the opinion made in the introduction."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.2a",
      "description": "Write informative/explanatory texts to examine a topic and convey ideas and information clearly. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Informative text, explanatory text, develop, topic, facts, definition, concrete details, research, close read, paraphrase, convey ideas clearly, convey information clearly, point of view, sources, notes, reference sources, include, primary sources, secondary sources, organizational structure grouping related information, examples, quotations, writing, plagiarism, attribution"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That facts and definitions from the text are supplied in order to develop details.",
            "That facts, and definitions are extracted from a text in order to develop details."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How utilizing facts, definitions, concrete details, quotations, or examples from the text allow for elaboration on a topic.",
            "That concrete details are specific facts within the text.",
            "That quotations are group of words taken directly from the text.",
            "How quotations taken from the text should be punctuated with commas and quotation marks in order to avoid plagiarism.",
            "That plagiarism is the act of taking another's words, thoughts, or ideas with attribution."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Choose facts, definitions, concrete details, quotations, or examples from the text to develop the topic.",
            "Use facts, definitions, details, and quotations to develop the topic.",
            "Use commas and quotation marks to attribute words, thoughts, or ideas to the author."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.2b",
      "description": "Write informative/explanatory texts to examine a topic and convey ideas and information clearly. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Informative text, explanatory text, linking words, linking phrases, link ideas, categories of information, using, progress, signal, direction, writing, linking words"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How linking words and phrases connect ideas within categories of information (e.g., also, another, and, more, but, in addition to, for example).",
            "How linking words and phrases help the writer communicate ideas clearly to the reader"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How linking words and phrases connect ideas within categories of information (e.g., another, for example, also, because).",
            "How linking words and phrases help the writer communicate ideas clearly to the reader"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use linking words (e.g., also, another, and, more, but) to connect and progress from one idea to the next within categories of information.",
            "Use linking phrases (e.g., in addition to, for example) to connect and progress from one idea to the next within categories of information."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.2c",
      "description": "Write informative/explanatory texts to examine a topic and convey ideas and information clearly. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Informative text, explanatory text, provide, precise language, domain-specific vocabulary, explain, topic, related, information, explanation"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That writers choose specific words and phrases for effect.",
            "That writers acquire and use domain-specific words and phrases to inform or explain a topic."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How writers choose specific nouns, adjectives, and/or verbs in order to make ideas understandable."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Analyze how authors use precise language and domain-specific vocabulary in mentor texts.",
            "Choose specific nouns, adjectives, and/or verbs in order to make ideas understandable.",
            "Include specific nouns, adjectives, and/or verbs in order to make ideas understandable in ideas to inform or explain the topic."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.2d",
      "description": "Write informative/explanatory texts to examine a topic and convey ideas and information clearly. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Provide, concluding statement, concluding section, related, information, explanation, presented, sentence, paragraph, informative text, explanatory text"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A writing piece must be organized.",
            "A concluding statement or section brings a piece of writing to a close.",
            "That closings for an informative/explanatory piece can vary (e.g., summary, reaction or feeling, image description, quotation)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How conclusions act as a way for readers to clearly understand the topic stated.",
            "The conclusion statement or section relates directly to the information or explanation presented in the introduction."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Analyze how mentor texts close.",
            "Identify thought(s) to leave the reader with before writing the conclusion.",
            "Choose a closing technique (e.g., summary, reaction or feeling, image description, quotation).",
            "Write a conclusion statement or section that relates directly to the information or explanation presented in the introduction."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.3a",
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, descriptive details, and clear event sequences. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Narrative, develop, real experiences, imagine experiences, forms, introduction, establishes a situation, plot, event sequence, narrator, character(s), point of view, audience, style, form, structure, appropriate, compare/contrast, descriptive, problem/solution, cause/effect, chronology, organize, unfolds naturally, enlightens, smooth progression, events, time, setting, location, mood, tone, analyze, mentor text, teacher model, author's craft, prompt, beginning, middle, end, writing"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That narratives can be written to inform, instruct, persuade, or entertain.",
            "That narratives can be written to express real or imagined experiences or events.",
            "That writers utilize a variety of techniques (e.g., direct statement, draw-in question, snapshot, observation from the senses) for developing real or imagined experiences.",
            "That writers utilize a variety of planning strategies (e.g., sketch the sequence, narrative map, sticky notes with events) for creating a coherent event sequence.",
            "That a narrator and/or character(s) can be introduced a variety of ways (e.g., in the beginning, as the story progresses)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How narratives can be written to express real or imagined experiences or events.",
            "How writers utilize a variety of techniques (e.g., direct statement, draw-in question, snapshot, observation from the senses) for establishing a situation.",
            "How writers utilize a variety of planning strategies (e.g., sketch the sequence, narrative map, sticky notes with events) for creating a coherent event sequence.",
            "A narrator and/or character(s) can be introduced a variety of ways (e.g., in the beginning, as the story progresses)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Analyze mentor texts.",
            "Choose a purpose for writing.",
            "Choose a form of writing.",
            "Implement a planning strategy for creating an event sequence (e.g., sketch the sequence, narrative map, sticky notes with events).",
            "Choose a technique for establishing the situation or focal point of the story to engage the reader (e.g., direct statement, draw-in question, snapshot, observation from the senses).",
            "Introduce a real or imaginative narrator and/or character(s) in the narrative."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.3b",
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, descriptive details, and clear event sequences. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Narrative, dialogue, conversation, characters, quotation marks, character traits, descriptive, vivid verbs, writer, created, thoughts, internal monologue, vivid details, feels, emotions, reactions, situations, develop, descriptions, actions, feelings, show, response, motivates, plot, writing"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That dialogue and description of actions, thoughts, and feelings are used to develop a character.",
            "That a character's internal narrative (thoughts), when balanced with dialogue, actions, and feelings, can provide an inside look at what motivates the character.",
            "That showing the character's response to situations further develops the plot.",
            "That more time given in writing to developing the character will develop the experiences and events in the story."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That dialogue and description are used to develop a character.",
            "A character's internal narrative (thoughts), when balanced with dialogue, actions, and feelings, can provide an inside look at what motivates the character.",
            "How showing the character's response to situations further develops the plot.",
            "That the more time given in writing to developing the character will develop the experiences and events in the story."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use dialogue in the narrative to develop experiences and events.",
            "Use descriptions of actions in the narrative to develop experiences and events.",
            "Use descriptions of thoughts in the narrative to develop experiences and events.",
            "Use descriptions of feelings in the narrative to develop experiences and events.",
            "Show response of characters to situations."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.3c",
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, descriptive details, and clear event sequences. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Narrative, transitional words, transitional phrases, signal, event order, effectively, naturally, writing, identify, moves, guide, temporal words, temporal phrases"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That Appropriate places in a narrative text where temporal words and phrases are necessary in order to signal changes in events.",
            "That temporal words effectively signal event order in a writing (e.g., first, next, last, finally, then, after, afterwards, following).",
            "That temporal phrases effectively to signal event order in a writing (e.g., a long time ago, one day, in the morning, after several minutes)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How transitional words and phrases help guide the reader through the story to signal an order of events in the writing.",
            "How prepositions and prepositional phrases often function as transitional words or phrases."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use transitional words in the writing to signal event order and structure.",
            "Use transitional phrases in the writing to signal event order."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.3d",
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, descriptive details, and clear event sequences. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Narrative, concrete words, concrete phrases, sensory details, convey experiences precisely, convey events precisely, touch, taste, smell, hear, see, show, telling"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That writers choose specific words and phrases for effect.",
            "That writers acquire and use conversational and general academic words."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How writers choose specific nouns, adjectives, and/or verbs in order to make ideas understandable.",
            "That concrete words and phrases are things one can touch, taste, smell, hear, and see.",
            "That concrete words and phrases stimulate sensory responses.",
            "How using concrete words, concrete phrases, and sensory details is a way for the writer to describe to the reader the story instead of just telling about it."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Include concrete words.",
            "Include concrete phrases.",
            "Include sensory details.",
            "Convey experiences precisely using concrete words, concrete phrases, and sensory details.",
            "Convey events precisely using concrete words, concrete phrases, and sensory details."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.3e",
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, descriptive details, and clear event sequences. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Narrative, provide, conclusion, follows, narrated experiences, events, close, writing, final impressions, organization"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A narrative piece must be organized.",
            "How providing a sense of closure brings everything together for the reader.",
            "That conclusions for a narrative piece can vary (e.g., visual or sensory image, statement of personal development, audience connection, surprise)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A narrative piece must be organized.",
            "How providing a sense of closure brings everything together for the reader.",
            "How conclusions for a narrative piece can vary (e.g., visual or sensory image, statement of personal development, audience connection, surprise).",
            "How conclusions must follow the sequence of experiences or events in the writing."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Analyze how mentor texts close.",
            "Write a conclusion that follows the narrated experiences or events."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.4",
      "description": "Produce clear and coherent writing in which the development and organization are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1-3 above.) Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Produce, clear, coherent, writing, development, organization, appropriate, task, purpose, audience, organizational structure, compare/contrast, descriptive, problem/solution, cause/effect, chronology, techniques, strategies, distribution, production, prewrite, organize, intentional"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The audience, or reader, must be considered when composing each of the three writing tasks.",
            "That content chosen for each of the three writing tasks should be on topic, engaging, and interesting for the chosen audience.",
            "That content that is off-topic, disengaging, or uninteresting for the audience should be omitted from the writing piece.",
            "How to determine the most important information and details in a text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The audience, or reader, must be considered when composing each of the three writing tasks.",
            "How content chosen for each of the three writing tasks should be clear and coherent."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write for a specific task as referenced in standards 1-3 above.",
            "Write for a specific purpose as referenced in standards 1-3 above.",
            "Produce a writing piece that that follows an organization structure as referenced in standards 1-3 above.",
            "Choose content that is on-topic, engaging, and interesting for the audience being considered.",
            "Omit content that is off-topic, disengaging, or uninteresting for the audience being considered."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.5",
      "description": "With guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, and editing. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That adults and peers provide guidance and feedback when revising and editing a piece of writing.",
            "That guidance and feedback from adults and peers strengthen and ensure that a piece of writing is focused on a specific topic."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How adults and peers provide guidance and feedback when revising and editing a piece of writing.",
            "How guidance and feedback from adults and peers strengthen and ensure that a piece of writing is focused on a specific topic.",
            "How moving a piece of writing through planning, revising, and editing ensures that a piece of writing is fully developed.",
            "How planning a piece of writing involves the identification of a topic, genre or format, purpose and audience. Writers may use a variety of strategies to plan their writing piece (e.g. drawing, talking, using a map, jotting down notes).",
            "How revising a piece of writing involves the sharing"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Plan a piece of writing by implementing a specific strategy (e.g., drawing, talking, using a map, jotting down notes).",
            "Share a piece writing with an adult or peer for the purpose of receiving feedback about specific sentences or sections that need to be revised for clarity, coherence, and appropriateness to task, purpose, and/or audience.",
            "Share a piece of writing with an adult or peer for the purpose of receiving feedback about specific conventions related to Language Standard 2 (e.g., capitals, punctuation, spelling)."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.6",
      "description": "With some guidance and support from adults, use technology, including the Internet, to produce and publish writing as well as to interact and collaborate with others; demonstrate sufficient command of keyboarding skills. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to utilize various types of devices (e.g., computer, iPad, iTouch, tablet) to produce and publish writing.",
            "How to utilize a variety of digital tools (e.g., Story Buddy 2, Story Kit, Popplet, Story Builder, Story Patch) to produce and publish writing.",
            "How to utilize a variety of technological tools (e.g., document projectors, interactive white board, web-based sharing platforms, student-centered websites and web page) to collaborate with peers to produce and publish writing.",
            "How to utilize a variety of word processing programs (e.g., OpenOffice and Microsoft Word) for mapping, planning, revising, and publishing a piece of writing.",
            "How to utilize a variety of publishing programs (e.g., Canvastic, ReadWriteThink"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How technological advances in the twenty-first century have challenged writers to move beyond paper and pencils when formatting writing pieces.",
            "The Internet is a twenty-first century source for producing and publishing writing.",
            "How various types of devices (e.g., computer, iPad, iTouch, tablet) can be used to produce and publish writing.",
            "A variety of digital tools (e.g., Story Buddy 2, Story Kit, Popplet, Story Builder, Story Patch) can be used to produce and publish writing.",
            "A variety of technological tools (e.g., document projectors, interactive white board, web-based sharing platforms, student-centered websites and web page) can be used to collaborate with peers to produce and publish writing.",
            "A variety of word processing programs (e.g., OpenOffice and"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use various types of devices to produce and publish writing",
            "Use a digital tool to produce and publish writing.",
            "Use a word processing program (using keyboarding skills) to produce and publish writing.",
            "Use technology to interact and collaborate with others to produce and publish writing.",
            "Utilize technology and keyboarding skills."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.7",
      "description": "Conduct short research projects that build knowledge through investigation of different aspects of a topic. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That research allows writers to build knowledge about a topic.",
            "That research projects have a set of parameters and procedures that must be followed.",
            "That research projects have topic parameters that narrow the focus of the project.",
            "That research projects have collaboration parameters that state how students will be working together on the project.",
            "That research projects have research parameters that state whether the project will utilize print and/or observation based research.",
            "That research projects have publishing parameters that state a specific format (e.g.,"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How research allows writers to build knowledge about a topic.",
            "That research projects have a set of parameters and procedures that must be followed.",
            "That research projects have topic parameters that narrow the focus of the project.",
            "That research projects have collaboration parameters that state how students will be working together on the project.",
            "That research projects have research parameters that state whether the project will utilize print and/or observation based research.",
            "That research projects have publishing parameters that state a specific format (e.g.,"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Conduct research for a short period of time.",
            "Generate a focused question for the research project.",
            "Choose print and/or observation based research as a source for research.",
            "Determine multiple aspects of a topic to investigate.",
            "Work collaboratively with peers to research the answer to the focused research question.",
            "Record facts, details, and definitions to answer the research question.",
            "Choose a publishing format to present findings.",
            "Present findings."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.8",
      "description": "Recall information from experiences or gather information from print and digital sources; take notes and categorize information, and provide a list of sources. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That past experiences can provide a foundation for answering questions about a topic.",
            "How gathering information from multiple sources, both print and digital, supports the writing.",
            "How note-taking keeps the research focused and allows the student the opportunity to go back to the notes to actually use in the writing.",
            "That researchers use various techniques (e.g., note-taking forms, marking print sources, marking digital sources) for taking meaningful notes.",
            "That note-taking forms allow the researcher to record the question or topic and document supporting information. Information on note-taking forms can be"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How past experiences can provide a foundation for answering questions about a topic.",
            "How gathering information from multiple sources, both print and digital, supports the writing.",
            "How note-taking keeps the research focused and allows the student the opportunity to go back to the notes to actually use in the writing.",
            "How researchers use various techniques (e.g., note-taking forms, marking print sources, marking digital sources) for taking meaningful notes.",
            "How note-taking forms allow the researcher to record the question or topic and document supporting information. Information on note-taking forms can be"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Recall experiences from their past to be used as a source.",
            "Gather information from print and digital sources.",
            "Utilize a note-taking technique to take meaningful notes about a topic.",
            "Sort information from notes into categories.",
            "Provide a list of sources."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.9a",
      "description": "Draw evidence from literary or informational texts to support analysis, reflection, and research. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) Analysis Reflection A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That evidence is defined as facts, details, definitions, quote, examples found in the text.",
            "That dialogue and description of actions, thoughts, and feelings are used to describe a character.",
            "That writers use specific word choice to describe a character, setting, or event."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "An analysis can be done on different types of literary texts (i.e., story, drama).",
            "Specific details from the literary texts are used in the analysis.",
            "An analysis can be about more than one literary text.",
            "An analysis has structure.",
            "A reflection can be done on different types of literary texts (i.e., story, drama).",
            "Specific details from the literary texts are used in the reflection.",
            "A reflection can be about more than one literary text.",
            "A reflection has structure.",
            "A reflection includes the student's personal thoughts,"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write a literary analysis using evidence from literary texts.",
            "Write a reflection using evidence from literary texts.",
            "Write a research piece using evidence from literary texts."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.9b",
      "description": "Draw evidence from literary or informational texts to support analysis, reflection, and research. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) Analysis Reflection A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That evidence is defined as facts, details, definitions, quote, examples found in the text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Specific details from the informational texts are used in the analysis.",
            "An analysis can be about more than one informational text.",
            "An analysis has structure.",
            "A reflection can be done on different types of informational texts (e.g.., articles, brochure, Encyclopedia entry).",
            "Specific details from the informational texts are used in the reflection.",
            "A reflection can be about more than one informational text.",
            "A reflection has structure."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write an informative analysis using evidence from informational texts.",
            "Write a reflection using evidence from informational texts.",
            "Write a research piece using evidence from informational texts."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Writing",
    "reporting_category": "Range of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.4.10",
      "description": "Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Write routinely, extended time frames, research, reflection, revision, shorter time frames, single setting or day or two, range, discipline-specific tasks, purposes, audiences, experiences, math, ELA, science, social studies, multiple opportunities, on demand writing, short constructed response, text based questions, content knowledge, aspect of a text or texts, sophisticated understandings of vocabulary, text structure, analysis"
    },
    "anchor_standard": null,
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That routine writing is repeated experiences with writing.",
            "How to write for extended time frames for research, reflection, and revision.",
            "How to write for shorter time frames that are done in a single setting or a day or two.",
            "How to write for a range of discipline-specific tasks (e.g., math, science, social studies, ELA).",
            "How to write for a range of discipline-specific purposes.",
            "How to write for a range of discipline-specific audiences (i.e., teacher, parent, legislator, online audience, editor)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How writers need multiple opportunities to write for extended time frames and shorter time frames for different purposes throughout the entire school year (in every nine weeks).",
            "How on demand writing requires different processes than extended process writings."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write daily.",
            "Write for extended time frames when research, reflection, and revision is required.",
            "Write for shorter time frames in a single setting or day or two.",
            "Write to address range of discipline-specific tasks.",
            "Write to address range of purposes.",
            "Write to address range of audiences."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.4.1a",
      "description": "Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher led) with diverse partners on Grade 4 topics and texts, building on others' ideas and expressing their own clearly. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Prepare, participate, conversations, collaborations, diverse, engage, effectively, explicitly, information, explore, discussion, expressing, clearly, preparation, appropriate, main idea, supporting details, key ideas, evidence, paraphrasing, connections, direct quotes"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to read texts to gather information about a topic for discussion.",
            "How to sort information and details into important and unimportant information.",
            "How to keep notes in an organized manner."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How collaborative discussions are more productive when participants have read and studied material prior to the discussion.",
            "How participants use prior knowledge about a topic to add ideas to a collaborative discussion.",
            "How participants use evidence from the information read and studied in order to add ideas to a discussion."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Read or study material prior to collaborative discussion.",
            "Share prior knowledge about topic with peers and/or adults.",
            "Share knowledge read and studied about a topic with peers and adults."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.4.1b",
      "description": "Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on Grade 4 topics and texts, building on others' ideas and expressing their own clearly. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to participate in collaborative discussions with peers and adults in small or large groups.",
            "That rules are important when having discussions.",
            "o Make eye contact with the speaker.",
            "o Wait until others finish speaking.",
            "o Listen for the speaker to pause before speaking.",
            "o Be empathic towards others' ideas.",
            "o Respectfully agree or disagree."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That collaborative discussions are conversations with peers and adults in small or large groups.",
            "Rules are important when having discussions.",
            "o Make eye contact with the speaker.",
            "o Wait until others finish speaking.",
            "o Listen for the speaker to pause before speaking.",
            "o Be empathic towards others' ideas.",
            "o Respectfully agree or disagree.",
            "That rules and assigned roles should be reflected upon/evaluated to ensure engaging and effective discussions.",
            "o Assigned roles have specific criteria to follow.",
            "o Roles could be, but not limited to lead facilitator,"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Know that rules are important when having discussions.",
            "o Make eye contact with the speaker.",
            "o Wait until others finish speaking.",
            "o Listen for the speaker to pause before speaking.",
            "o Be empathic towards others' ideas.",
            "o Agree or disagree, respectfully.",
            "o Carry out assigned roles with the collaborative discussion."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.4.1c",
      "description": "Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on Grade 4 topics and texts, building on others' ideas and expressing their own clearly. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Engage, effective, collaborate, discussion, diverse, pose, respond, clarify, remark, participants, ensure, responses, linking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas, and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to ask questions during collaborative discussion can enable participants to understand information being presented.",
            "How to offer comments about others' remarks of the topic promote extended thinking"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How posing questions during collaborative discussion can enable participants to monitor and understand information being presented.",
            "How questions provoke inquiry and investigations of the topic and/or promote extended thinking.",
            "How specific questions reference the material presented.",
            "How offering comments about others' remarks of the topic promote extended thinking."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Pose questions to monitor comprehension of the topic presented and discussed.",
            "Listen to others' ideas and be able to \"piggy back\" or connect their ideas to those in the discussion."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.4.1d",
      "description": "Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on grades 4 topics and texts, building on others' ideas and expressing their own clearly. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Prepare, participate, effectively, range, conversations, collaboration, diverse, clearly, persuasively, review, key ideas, understanding, discussion"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That effective discussions relate information that has been read or read or studied prior to the collaborative discussion.",
            "That students explain a topic using personal ideas, opinions, and reasoning based on topics and text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That speakers explain the topic using personal ideas, opinions, and reasoning.",
            "o Explain the topic by reviewing key ideas.",
            "o Personal ideas are based upon prior knowledge of the topic, feelings towards the topic, or thoughts formulated.",
            "o Opinions should be concrete with evidence to support the speaker's thoughts.",
            "o Reasoning of the topic should be supported with evidence."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Listen to others remarks about a text or topic.",
            "Express ideas using personal ideas, opinions, and reasoning based on topics and text.",
            "Link comments to the remarks of others to extend the discussion."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.4.2",
      "description": "Paraphrase portions of a text read aloud or information presented in diverse media and formats, including visually, quantitatively, and orally. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Paraphrase, portions, main idea, supporting details, information, diverse media, visually, quantitatively, orally"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.2",
      "grade": null,
      "description": "Integrate and evaluate information presented in diverse media and formats, including visually, quantitatively and orally."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That information can be presented visually, quantitatively, and orally.",
            "The supporting details of the information presented should prove the main idea of the text or diverse media to be true.",
            "The main idea of the text read aloud or the information presented is the key idea."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How paraphrasing involves the restating of information presented in diverse media and formats, including visually, quantitatively, and orally to clarify meaning."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Listen and/or observe text or information presented visually, quantitatively, and/or orally.",
            "Paraphrase portions of information presented in order to clarify meaning orally and in writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.4.3",
      "description": "Identify the reasons and evidence a speaker provides to support particular points. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Evaluate, point of view, reasoning, evidence, rhetoric, identify, reasons, provide, points, clarify, diverse media"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.3",
      "grade": null,
      "description": ". Evaluate a speaker's point of view, reasoning, and use of evidence and rhetoric."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to ask and answer questions about information to clarify comprehension.",
            "How to ask and answer questions to gather additional information about a topic."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How reasons should support points a speaker makes.",
            "How evidence should support points a speaker makes."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Listen and/or observe text or information presented visually, quantitatively, and/or orally.",
            "Identify the main points a speaker makes.",
            "Identify reasons and evidence a speaker provides to support particular points."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.4.4",
      "description": "Report on a topic or text, tell a story, or recount an experience in an organized manner, using appropriate facts and relevant, descriptive details to support main ideas or themes; speak clearly at an understandable pace. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Finding, evidence, line of reasoning, report, topic, recount, experience, facts, relevant, descriptive, details, main idea, themes, pace"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.4",
      "grade": null,
      "description": "Present information, findings, and supporting evidence such that listeners can follow the line of reasoning and the organization, development, and style are appropriate to task, purpose, and audience."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That good presenters deliver information to the audience in a clearly understandable pace.",
            "That presenters beforehand know the topic, facts, and descriptive details.",
            "How to presenting information requires delivering the information with clear and enunciated words.",
            "That facts are true statements that can be supported with concrete evidence.",
            "That evidence is used to support the main idea through phrases and/quotations."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A logical sequence of events is used when reporting on a topic, or text, or recounting an experience.",
            "How recounting an experience should be in presented in an organized manner.",
            "o Sequential",
            "o Chronological",
            "o Compare/Contrast",
            "o Problem/Solution",
            "o Cause/Effect",
            "How determining the appropriate facts that support main ideas or themes and organizing them by using graphic organizers lends itself to an effective reporting of the topic or text.",
            "o Important/Unimportant facts",
            "o Relevant descriptive details",
            "o Visual Organization to enhance understanding of topic"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Report on a topic or text in an organized manner.",
            "Tell a story in an organized manner.",
            "Recount an experience in an organized manner.",
            "Use appropriate facts and relevant, descriptive details to support the main idea or theme.",
            "Speak clearly at an understandable pace."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.4.5",
      "description": "Add audio recordings and visual displays to presentations when appropriate to enhance the development of main ideas or themes. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Strategic, digital media, visual, displays, enhance, understanding, audio, presentations, development, main idea, details, determine"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.5",
      "grade": null,
      "description": "Make strategic use of digital media and visual displays of data to express information and enhance understanding of presentations."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That audio recordings of stories or poems that have drawings or other visual displays make strategic use of digital media.",
            "That audio recordings recounting an experiences that area appropriate help clarify ideas, thoughts, and feelings.",
            "That engaging auto recordings demonstrate fluid reading and facts and details are easily recognized.",
            "That audio recordings created for presentations clarify meaning of the information presented.",
            "That visual displays enhance the presenter's presentation by making strategic use of data."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How audio recordings and visual displays should enhance the information presented, not repeat it.",
            "How fluent reading is an essential element to ensure an engaging recording.",
            "The audio recording and visual display should enhance the main idea and theme.",
            "How using supporting evidence contributes to the understanding of the main idea and theme.",
            "A theme is the central idea the author is trying to convey.",
            "How understanding the characters' actions, interactions, and motivations and events contribute to the theme of the story."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Read stories or poems fluently for audio recordings.",
            "Create presentations using audio recordings to enhance the main idea or theme.",
            "Create or construct visual displays to enhance the development of the main idea or theme."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.4.6",
      "description": "Differentiate between contexts that call for formal English (e.g., presenting ideas) and situations where informal discourse is appropriate (e.g., small-group discussion); use formal English when appropriate to task and situation. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Differentiate, context, situations, formal English, informal English, discourse, task, situation, polysyllabic, colloquial"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.6",
      "grade": null,
      "description": "Adapt speech to a variety of contexts and communicative tasks, demonstrating command of formal English when indicated or appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That formal or informal language can be present in reading and writing.",
            "That formal language is less personal and is often factual and straight-to-the-point.",
            "That informal language is friendly and conversational."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How formal or informal language can be present in reading and writing.",
            "That formal language is less personal and is often factual and straight-to-the-point.",
            "That informal language is friendly and conversational.",
            "That both formal and informal language are considered acceptable in certain situations.",
            "That formal English should be used when presenting ideas to an audience.",
            "That informal language or discourse should be used when small groups meet to discuss a topic."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the situation in which language is being utilized.",
            "Choose formal English if factual ideas are being presented to an audience.",
            "Choose informal discourse if small groups are meeting to discuss a topic."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Differentiate",
        "context",
        "situations",
        "formal English",
        "informal English",
        "discourse",
        "task",
        "situation",
        "polysyllabic",
        "colloquial"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.1a",
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing or speaking. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How using standard grammar and usage when writing and speaking lends itself to more effective products and understanding of the product.",
            "A pronoun is a part of speech that replaces a noun or another pronoun.",
            "A pronoun must agree with the noun, or antecedent it refers to."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A relative pronoun is a pronoun that introduces a relative or dependent clause.",
            "A relative clause modifies a word, phrase, or idea, in the independent clause.",
            "The word, phrase, or idea in the independent clause is called the antecedent.",
            "That some common relative pronouns are who, whose, whom, which, and that.",
            "That the word who functions as a subject and refers to people.",
            "That the word whose functions as a possessive and refers to people, things, or concepts.",
            "That the word whom functions as an object and refers to people.",
            "That the word which can function as a subject, object, or possessive.",
            "That the word which refers to things or concepts."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify relative pronouns and adverbs in mentor text.",
            "State the antecedent being modified.",
            "Discern if the information in the relative clause is restrictive or nonrestrictive.",
            "Discern whether the relative clause should or should not have a comma."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.1b",
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing or speaking. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, verbs, differentiate, present progressive, past progressive, future progressive"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How using standard grammar and usage when writing and speaking lends itself to more effective products and understanding of the product.",
            "A verb is a part of speech that expresses actions or states of being.",
            "o The word be is different from other verbs in many ways but still can be thought of as a verb",
            "That verb tense tells when the action happens.",
            "o Present tense is the original verb form.",
            "o Past tense has a few patterns.",
            "o Future tense needs will (shall) + verb"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How verbs show a relationship with time. (Simple verb tenses)",
            "o A verb must agree with its subject.",
            "o Understand that some verbs are in irregular form and will be in the form of past-tense or past-participle.",
            "The present progressive is used to describe an action that is taking place at the time you are writing about it.",
            "The past progressive tense is used to describe a past continuing action or to describe an action that takes place simultaneously with any past action.",
            "The future progressive tense is used to describe a continuing action in the future."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify progressive verb tense in a mentor text.",
            "State whether the action is occurring in the present, past, or future.",
            "Use a form of \"to be\" plus the present participle (an -ing verb) when writing or speaking."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.1c",
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing or speaking. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, modal auxiliaries, verbs, communicate, expresses, conditions, convey"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How using standard grammar and usage when writing and speaking lends itself to more effective products and understanding of the product.",
            "A verb is a part of speech that expresses actions or states of being."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That auxiliary verbs such as will, shall, may, might, can, could, must, ought to, should, would, used to, need are used in conjunction with main verbs to express shades of time and mood.",
            "That modal auxiliary verbs never change form.",
            "o The use of -ed, -ing, or -s cannot be added to these words.",
            "o They can be used to indicate a necessity, an obligation, or a possibility.",
            "o They can also show willingness or ability."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify a modal auxiliary in a mentor text.",
            "Identify the degree of necessity, obligation, or possibility.",
            "Discern whether the modal auxiliary being used matches the context or condition being described.",
            "Use a model auxiliary that matches the condition being described. Students should be able to use modal auxiliaries to communicate clearly through writing or speaking."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.1d",
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing or speaking. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How using standard grammar and usage when writing and speaking lends itself to more effective products and understanding of the product.",
            "An adjective is a part of speech that describes, identifies or quantifies a noun (modify a noun)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That adjectives follow typical order patterns such as opinion, size, age, shape, color, origin, material, and purpose.",
            "An opinion adjective explains what you think about something. (silly, beautiful)",
            "A size adjective tells you how big or small something is. (enormous, miniature)",
            "An age adjective tells how young or old something is. (ancient, young)",
            "A shape adjective describes the shape of something. (square, round, flat)",
            "A color adjective describes the color of something. (blue, reddish)",
            "An origin adjective describes where something comes from. (French, lunar, Greek)"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify adjectives in mentor text.",
            "Identify the pattern order being used.",
            "Compose a sentence with correct pattern order.",
            "Utilize correct pattern order or adjectives when speaking."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.1e",
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing or speaking. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, prepositions, structures, temporal, spatial, logical, direct object, links, relationship"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How using standard grammar and usage when writing and speaking lends itself to more effective products and understanding of the product.",
            "A preposition describes a relationship between other words in a sentence.",
            "That prepositions are nearly always combined with other words in structures called"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A preposition links",
            "The word or phrase that the preposition introduces is called the",
            "o Direct Object is a noun or pronoun answering \"whom\" or \"what\" after an",
            "A prepositional phrase identifies a spatial, directional, or temporal relationship of one or more people of things to other people or things."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify prepositional phrases in mentor text.",
            "Form a prepositional phrase to show a spatial, directional, or temporal relationship when writing.",
            "Use a preposition phrase to show a spatial, directional, or temporal relationship when speaking."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.1f",
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing or speaking. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, produce, sentence, recognize, comma splices, fragments, run-ons"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How using standard grammar and usage when writing and speaking lends itself to more effective products and understanding of the product.",
            "A complete sentence consists of a subject and a predicate.",
            "A sentence fragment cannot stand by itself.",
            "A run-on sentence occurs when no punctuation at all separates independent sentences."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That run on sentences are often referred to as comma splices.",
            "A comma splice occurs when only a comma separates two independent sentences."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Recognize complete sentences in mentor text.",
            "Recognize complete sentences when peer editing.",
            "Recognize fragments and run-ons in mentor text.",
            "Recognize fragments and run-ons when peer editing.",
            "Produce complete sentences when writing and speaking.",
            "Correct fragments by adding appropriate information.",
            "Correct run-ons by adding appropriate punctuation."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.1g",
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing or speaking. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, frequently, confused, determine, homophones, homonyms"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That homonyms, or homophones, are words that are spelled differently, have different meanings, but are pronounced alike."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That context clues are helpful when determining the meaning of frequently confused words.",
            "That the word to functions as a preposition.",
            "That the word too means very or also.",
            "That the word two refers to the number 2.",
            "That the word there refers to a place.",
            "That the word their is a possessive pronoun."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify frequently confused words in mentor text.",
            "Identify frequently confused words when peer editing.",
            "Choose the correct form of a frequently confused word when writing or speaking."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.2a",
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, capitalization"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to capitalize means to begin a word with a capital letter.",
            "The first word in a sentence should always be capitalized.",
            "The pronoun I should always be capitalized.",
            "How to apply various rules for correct capitalization:",
            "o Dates",
            "o Names of people",
            "o Holidays",
            "o Product names",
            "o Geographic names",
            "o Words in titles"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to capitalize means to begin a word with a capital letter.",
            "The first word in a sentence should always be capitalized.",
            "The pronoun I should always be capitalized.",
            "How to apply various rules for correct capitalization:",
            "o Dates",
            "o Names of people",
            "o Holidays",
            "o Product names",
            "o Geographic names",
            "o Words in titles"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Apply and use correct capitalization when writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.2b",
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, quotations, commas, direct quote"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That commas and quotation marks are used to punctuate dialogue.",
            "That dialogue is a written or spoken conversation exchanged between two or more people.",
            "How to use a comma between the dialogue and the tag line (the words used to identify the speaker: \"he said/she said\").",
            "That periods and commas go inside the quotation marks in.",
            "That other punctuation such as semicolons, question marks, dashes, and exclamation points go outside of the quotation marks unless it directly pertains to the material within the quotes."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That Writers use quotation marks when citing explicit evidence from a text.",
            "How using quotation marks with explicit evidence give credit to the author or original source."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify direct speech in a mentor text.",
            "Differentiate the direct speech from the tag line.",
            "Identify the correct usage of commas, periods, and/or other punctuation marks.",
            "Use commas and quotation marks to mark direct speech when writing.",
            "Identify a quote from a text when peer editing.",
            "Identify correct usage of commas and quotation marks when citing explicit evidence from a text.",
            "Use commas and quotation marks when citing explicit evidence from text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.2c",
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, conjunction, coordinating conjunctions, expresses, compound sentence"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A compound sentence is made up of two or more independent clauses.",
            "A comma is a punctuation mark typically indicating a pause between parts of a sentence.",
            "A conjunction is a word that joins other words or parts of a sentence together.",
            "o Coordinating conjunction joins words, phrases, and sentences (independent clauses) together."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A comma and a conjunction join two independent clauses in a compound sentence.",
            "An independent clause is a group of words that contains a subject and verb and expresses a complete thought."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify a compound sentence in a mentor text.",
            "Identify a compound sentence when peer editing.",
            "Identify the structure of a compound sentence.",
            "Identify the coordinating conjunction in a compound sentence.",
            "Identify the correct placement of the comma in a compound sentence.",
            "Use a comma before a coordinating conjunction in a compound sentence when writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.2d",
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, spell, references, consult"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That writers use reference materials to check and correct spellings.",
            "o A dictionary is a reference material that lists words in alphabetical order and gives the meaning of the word.",
            "o Glossaries and digital dictionaries are used to clarify the correct spelling of words."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That writers should carefully consider the meaning of the word when deciding upon the correct spelling."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Recognize words that are not spelled correctly.",
            "Clarify the correct spelling of the word by using a dictionary or other appropriate reference material (Glossary, Digital dictionary)."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Knowledge of Language",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.3a",
      "description": "Use knowledge of language and its conventions when writing, speaking, reading, or listening. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Apply, language, understand, function, contexts, effective, style, comprehend, phrases, precise,"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.3",
      "grade": null,
      "description": "Apply knowledge of language to understand how language functions in different contexts, to make effective choices for meaning or style, and to comprehend more fully when reading or listening."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That language can be awkward, vague, or unclear when writing, speaking, reading, or listening.",
            "How utilizing specific word choice ensures that an idea or topic will be expressed clearly."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How students should apply knowledge of language conventions when writing, reading, and listening.",
            "How during writing and speaking, words and phrases that are precise are more effective and create a better understanding."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Recognize awkward, vague, or unclear language when writing, speaking, reading, or listening.",
            "Choose specific words or phrases to express and idea or topic more clearly."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Knowledge of Language",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.3b",
      "description": "Use knowledge of language and its conventions when writing, speaking, reading, or listening. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.3",
      "grade": null,
      "description": "Apply knowledge of language to understand how language functions in different contexts, to make effective choices for meaning or style, and to comprehend more fully when reading or listening."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That there are different types of punctuation to use when writing.",
            "o Apostrophes",
            "o Commas",
            "o Exclamation Points",
            "o Periods",
            "o Question Marks",
            "o Quotation Marks"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That punctuation marks let readers know such things as when to stop, when to pause, and what the exact words of a speaker are.",
            "That punctuation can be used to show emotion or to create a desired tone.",
            "How to use parentheses ( ) around material that is added to a sentence but is not important to the meaning of the sentence [e.g., I will perform in my first school play tonight. (Yikes!)]",
            "How to use a dash to add emphasis to your writing. A dash is a mark of separation. It is stronger than a comma and more relaxed than parentheses (e.g., I'm not looking forward to going to the dentist-especially if she finds a cavity.)",
            "How to use an interjection to show an emotion.",
            "How to use a comma to separate interjections from the"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify sentences in mentor text that communicate emotion.",
            "Identify the punctuation.",
            "Identify the purpose for utilizing a specific type of punctuation.",
            "Identify sentences that communicate emotion when peer editing.",
            "Identify the punctuation used.",
            "Identify the peer's purpose for utilizing a specific type of punctuation.",
            "Compose sentences that convey emotion.",
            "Choose appropriate punctuation to communicate a particular emotion."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Knowledge of Language",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.3c",
      "description": "Use knowledge of language and its conventions when writing, speaking, reading, or listening. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Apply, language, understand, function, contexts, effective, style, comprehend, phrases, effect"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.3",
      "grade": null,
      "description": "Apply knowledge of language to understand how language functions in different contexts, to make effective choices for meaning or style, and to comprehend more fully when reading or listening."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That formal or informal language can be present in reading and writing.",
            "That formal language is less personal and is often factual and straight-to-the-point.",
            "That informal language is friendly and conversational.",
            "How speaking in complete sentences clarifies understanding of the ideas presented or collaborative discussions.",
            "The audience is the group of listeners being targeted for the presentation or collaborative discussion."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That formal or informal language can be present in reading and writing.",
            "That formal language is less personal and is often factual and straight-to-the-point.",
            "That informal language is friendly and conversational.",
            "That both formal and informal language are considered acceptable in certain situations.",
            "How formal English should be used when presenting ideas to an audience.",
            "How informal language or discourse should be used when small groups meet to discuss a topic."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the situation in which language is being utilized.",
            "Choose formal English if factual ideas are being presented to an audience.",
            "Choose informal discourse if small groups are meeting to discuss a topic."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.4a",
      "description": "Determine or clarify the meaning of unknown and multiple-meaning word and phrases based on Grade 4 reading and content, choosing flexibly from a range of strategies. Desired Student Performance A student should know (Prerequisite Knowledge) Homographs are words that are spelt the same, but have different pronunciations and meanings. A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Determine, clarify, multiple-meaning, phrases, analyzing, determine, definitions, examples, restatements, investigate"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That context clues help determine the meaning or unknown or multiple meaning words.",
            "That multiple meaning words have more than one meaning.",
            "o Homonyms are words that have the same spelling and pronunciation, but have different meanings.",
            "o Homophones are words that have the same pronunciation, but different spellings and meanings."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How investigating the text closer is an effective strategy to deterring the meanings of unknown words or phrases.",
            "How clues to unfamiliar words can often be determined by definitions.",
            "o Definition context clues: writer uses an unfamiliar word and then explains what it means in the next sentence or two.",
            "o Some context clues restate the meaning of a word in another way.",
            "o Restatements are often introduced by commas or dashes and by words and phrases such as or, that is, or in other words."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify an unknown or multiple-meaning word in a mentor text.",
            "Read the text closely to understand the context.",
            "Look for a definition, example, or restatement clue.",
            "Using the clue, state the meaning of the unknown word."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.4b",
      "description": "Determine or clarify the meaning of unknown and multiple-meaning word and phrases based on Grade 4 reading and content, choosing flexibly from a range of strategies. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Determine, clarify, multiple-meaning, phrases, analyzing, determine, affix, suffix, strategies, understand, commonly, root word"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A basic word to which affixes (prefixes and suffixes) are added is called a root word because it forms the basis of a new word.",
            "A word root is a part of the word that carries meaning."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to recognize common Greek and Latin affixes and roots.",
            "A prefix the prefix does one of three things: it gives a word direction, negates a word by meaning \"not,\" or intensifies the meaning of a word by adding the notion of \"very.",
            "A suffix comes at the end of the word."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify an unknown and/or a multiple-meaning word in a mentor text.",
            "Break a word into parts: prefix, root, suffix.",
            "Identify the meaning of the Greek and/or Latin affix and/or root.",
            "Apply the meaning of the Greek and/or Latin affix and/or root to the unknown word.",
            "State the meaning of the unknown word."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.4",
      "description": "Determine or clarify the meaning of unknown and multiple-meaning word and phrases based on Grade 4 reading and content, choosing flexibly from a range of strategies. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Determine, consult, digital, thesaurus, glossary, clarify, precise, reference, pronunciation"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That glossaries or beginning dictionaries, both print and digital, aid students with determining or clarifying the precise meaning of key words and phrases.",
            "That glossaries and beginning dictionaries come in print or digital form on the computer.",
            "A glossary is a list of specialized terms with definitions.",
            "That glossaries are commonly found at the backs of books to help readers understand terms, which may be unfamiliar.",
            "A beginning dictionary offers early readers definitions and illustrative sentences."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How glossaries or beginning dictionaries, both print and digital, aid students with determining or clarifying the precise meaning of key words and phrases.",
            "That glossaries and beginning dictionaries come in print or digital form on the computer.",
            "A glossary is a list of specialized terms with definitions.",
            "How glossaries are commonly found at the backs of books to help readers understand terms, which may be unfamiliar.",
            "A beginning dictionary offers early readers definitions and illustrative sentences.",
            "A thesaurus is a"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify an unknown or multiple-meaning word and/or phrase.",
            "Use a print or digital glossary to determine or clarify the meaning of an unknown word and/or phrase.",
            "Use a print or digital beginning dictionary to determine or clarify the meaning of an unknown word and/or phrase.",
            "Use a thesaurus to find a word that has a similar and/or contrasting meaning."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.5a",
      "description": "Demonstrate understanding of word relationships and nuances in word meanings. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, figurative, simile, metaphors, explain, context, comparison, vivid, entertaining"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That literal language means exactly what it says.",
            "That nonliteral language or figurative language refers to words, and groups of words, that exaggerate or alter the usual meanings of the component words."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How writers use similes and metaphors to explain things, to express emotion, and to make their writing more vivid and entertaining.",
            "A simile is a comparison between two things that are generally not alike.",
            "o Usually introduced by like or as",
            "A metaphor is a figurative comparison, but these are implied rather than introduced by like or as."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify nonliteral language in a mentor text.",
            "Identify the type of nonliteral language as functioning as a simple simile or a metaphor.",
            "Explain the meaning of the simple simile or metaphor.",
            "Use a simple simile or metaphor in writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.5b",
      "description": "Demonstrate understanding of word relationships and nuances in word meanings. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, relationship, nuance, recognize, explain, idioms, adage, proverb, synonymous"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That literal language means exactly what it says.",
            "That nonliteral language or figurative language refers to words, and groups of words, that exaggerate or alter the usual meanings of the component words."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How authors use nonliteral language to improve their writing.",
            "That idioms, adages, and proverbs are types of common expressions and sayings.",
            "o An idiom is a phrase that means something different from its literal meaning (e.g., After he was cut by the team, he turned over a new leaf and started working out.).",
            "o An adage is a well-known proverb that has been used for a long time (e.g., If the shoe fits, wear it).",
            "o A proverb is a statement of practical wisdom expressed in a simple way (e.g. An apple a day keeps the doctor away)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify nonliteral language in a mentor text.",
            "Identify the type of nonliteral language as an idiom, adage, or proverb.",
            "Explain the meaning of the idiom, adage, or proverb.",
            "Use an idiom, adage, or proverb in writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.5c",
      "description": "Demonstrate understanding of word relationships and nuances in word meanings. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, understanding, nuances, meanings, opposites, alike, relate, antonyms, synonyms, context, identical, thesaurus"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That synonyms are words that have the same or very similar meaning",
            "That antonyms are words that have opposite meanings.",
            "That a thesaurus is a reference sourcel that is useful to consult when identifying a synonym or antonym.",
            "That words can have similar meanings.",
            "That words can be grouped or sorted based on meanings.",
            "That says in which words are grouped or sorted can be based on state of mind or mood.",
            "That ways in which words are grouped or sorted can be based on degrees of certainty or opinion."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How nouns, verbs, adjectives, adverbs and prepositions can have a synonym as long as both words are the same part of speech.",
            "That often words will have more than one antonym but, as with synonyms, it depends on the context.",
            "That synonyms are words that have the same or very similar meaning",
            "That antonyms are words that have opposite meanings.",
            "That a thesaurus is a reference source that is useful to consult when identifying a synonym or antonym."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify a noun, verb, adjective, adverb, or preposition in a mentor text.",
            "Utilize a thesaurus to identify a synonym or antonym for the word.",
            "Compose a sentence to demonstrate an understanding of two words that have a similar meaning (synonym).",
            "Compose a sentence to demonstrate an understanding of two words that have opposite meanings (antonyms)."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "4",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.4.6",
      "description": "Acquire and use accurately grade-appropriate general academic and domain-specific words and phrases, including those that signal precise actions, emotions, or states of being (e.g., quizzed, whined, stammered) and that are basic to a particular topic (e.g., wildlife, conservation, and endangered when discussing animal preservation). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Acquire, use, precise, signal, connect, time and process, compare and contrast, classification, cause and effect, conversational, academic, temporal, spatial, prepositions,"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.6",
      "grade": null,
      "description": "Acquire and use accurately grade-appropriate general academic and domain-specific words and phrases, including those that signal precise actions, emotions, or states of being (e.g., quizzed, whined, stammered) and that are basic to a particular topic (e.g., wildlife, conservation, and endangered when discussing animal preservation)."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How using grade-appropriate words and creates clarity and coherence in writing.",
            "That conversational words and phrases are words in everyday speech.",
            "That general academic words are words that are found more often in written texts across disciplines. These words can appear in informational, technical, or literary text.",
            "That domain-specific words are words found more often in written texts within a specific discipline.",
            "That prepositions are used to signal spatial and/or temporal relationships.",
            "That spatial relationships refer to the physical relationship between things.",
            "That temporal relationships involve space and time."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That general academic words are words that are found more often in written texts across disciplines. These words can appear in informational, technical, or literary text.",
            "That general academic words signal precise actions, emotions, or states of being (e.g., quizzed, whined, stammered).",
            "That domain-specific words are words found more often in written texts within a specific discipline.",
            "That domain-specific words are basic to a particular topic (e.g., wildlife, conservation, and endangered when discussing animal preservation.)"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify general academic and domain specific words in mentor text.",
            "Acquire and use general academic words.",
            "Acquire and use domain specific words."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  }
]