[
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.5.1",
      "description": "Quote accurately from a text when explaining what the text says explicitly and when drawing inferences from the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Details, examples, quotes, explicit and implicit, inferences, infer, questioning, predicting, drawing conclusions, accurately"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.1",
      "grade": null,
      "description": "Read closely to determine what the text says explicitly and to make logical inferences from it; cite specific textual evidence when writing or speaking to support conclusions drawn from the text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to use evidence from the text to support their thinking.",
            "How to use specific details and examples from the text when explaining their thinking and to show understanding of the text.",
            "How to make predictions before, during, and after reading.",
            "That explicit information can be found \"right there\" in the text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors include key details in literary texts, which can help a reader ask and answer questions.",
            "How to use examples, details, and quotes from the text to support their inferences.",
            "How to use textual evidence, personal connections, and background knowledge to make inferences and draw conclusions based on what they read."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine appropriate textual support.",
            "Use quotes from the text when explaining what the text says.",
            "Use quotes from the text when drawing inferences.",
            "Use quotes from the text to support inferences."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.5.2",
      "description": "Determine a theme of a story, drama, or poem from details in the text, including how characters in a story or drama respond to challenges or how the speaker in a poem reflects upon a topic; summarize the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Recount, retell, determine, story, drama, poem, characters' reactions, challenges, speaker, central idea, theme, key details, summarize"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.2",
      "grade": null,
      "description": "Determine central ideas or themes of a text and analyze their development; summarize the key supporting details and ideas."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The role characters or speakers play in stories, drama, or poems.",
            "The characteristics of an effective retelling/recounting of events from a story.",
            "The difference between a central idea and key details in a story."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors of literary texts include details that help readers determine the theme or central idea(s).",
            "How to generate effective summaries that capture central idea(s) or theme of the text.",
            "That authors reveal the theme of a text by how characters respond to the events they encounter in the text.",
            "That authors reveal the theme of a poem by how the speaker reflects on a topic."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine the theme of a literary text(s).",
            "Determine characters' or speakers' roles in stories, dramas, and poems (e.g., actions and reactions).",
            "Explain how particular details (e.g., characters' or speakers' actions and reactions) reveal a theme.",
            "Summarize the text, including the theme in the original piece."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.5.3",
      "description": "Compare and contrast two or more characters, settings, or events in a story or drama, drawing on specific details in the text (e.g., how characters interact). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Compare, contrast, character, villain, hero, major/minor character, setting, plot, climax, resolution, conflict, drama, describe"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.3",
      "grade": null,
      "description": "Analyze how and why individuals, events, or ideas develop and interact over the course of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify similarities and differences to enhance understanding of literary elements.",
            "That stories are written to include characters and characters roles (hero/villain, major/minor), setting, plot (e.g., events, climax/turning point, resolution), and conflict (man vs. man, man vs. self, man vs. nature).",
            "That authors include characters' traits, actions, feelings, and words when writing literary texts.",
            "That authors use drama elements such as scenes, dialogue, and stage directions."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors use specific details in a story or drama to describe characters, settings, or events.",
            "How to use specific details from a literary text to support their thinking about characters, settings, or events."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify important, specific details that support key ideas in a story or drama.",
            "Identify and describe the plot events in a story or drama.",
            "Describe the setting and characters of a story or drama, referring to specific details.",
            "Compare and contrast characters, settings, and events using appropriate graphic or written representations, and using specific details from the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.5.4",
      "description": "Determine the meaning of words and phrases as they are used in a text, including figurative language such as metaphors and similes. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Context clues, determine, distinguish, interpret, clarify, figurative language, metaphors, similes, literary devices, word choice"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.4",
      "grade": null,
      "description": "Interpret words and phrases as they are used in a text, including determining technical, connotative, and figurative meanings, and analyze how specific word choices shape meaning or tone."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors use figurative language and literary devices to convey meaning.",
            "That authors use different types of context clues to convey meaning of unknown words (e.g., definition, example, antonym, synonym).",
            "That authors use different types of figurative language (e.g., simile, metaphor, personification, irony) to convey meaning and to help the reader get a clearer picture of what is happening in the text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors make purposeful language choices to enhance the meaning of literary text(s).",
            "How to seek the meaning of unknown words/phrases to clarify understanding of literary text(s)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use context clues to help unlock the meaning of unknown words/phrases",
            "Determine the appropriate definition of words with more than one meaning.",
            "Differentiate between literal and non-literal language.",
            "Interpret figurative language and literary devices.",
            "Describe how figurative language, literary devices, and other language choices enhance meaning."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.5.5",
      "description": "Explain how a series of chapters, scenes, or stanzas fits together to provide the overall structure of a particular story, drama, or poem. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Genre, drama, prose, poem, structural elements, verse, rhythm, meter, casts, settings, descriptions, dialogue, stage directions, text structure, series of chapters, series of scenes, series of stanzas"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.5",
      "grade": null,
      "description": "Analyze the structure of texts, including how specific sentences, paragraphs, and larger portions of the text (e.g., a section, chapter, scene, or stanza) relate to each other and the whole."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors use different characteristics when writing poems, dramas, and prose.",
            "That authors organize texts using different types of structures (e.g., sentences, paragraph, chapter, section, stanza, scenes).",
            "How to understand the relationship between parts of text and the whole text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors' choices of text structures vary according to genre.",
            "How to understand the structure of a text and use this information to make sense of what they read."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the genre of a literary text.",
            "Identify text structures of stories, dramas, and poems.",
            "Explain how a series of scenes/chapters fit together to provide the overall structure of a story.",
            "Explain how a series of scenes fit together to provide the overall structure of a drama.",
            "Explain how a series of stanzas fit together to provide the overall structure of a poem."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.5.6",
      "description": "Describe how a narrator's or speaker's point of view influences how events are described. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Describe, influences, point of view, narration, first-person, third-person, author's purpose"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.6",
      "grade": null,
      "description": "Assess how point of view or purpose shapes the content and style of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors write for a variety of purposes (e.g., to inform, to persuade, to entertain, to describe, to explain how).",
            "That authors write from different points of view.",
            "How to identify characteristics of first-person point of view and third-person point of view within literary text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors develop texts by choosing a point of view to achieve his or her purpose.",
            "That authors use the narrator's or speaker's point of view to develop plot, character, and central message or theme.",
            "That authors can influence how events are described based on their feelings about events.",
            "How to recognize the narrator's or speaker's point of view influences how events are described."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Describe the author's overall purpose for writing a text.",
            "Describe how point of view affects a literary text.",
            "Describe how a narrator's or speaker's point of view influences the description of events in a story."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.5.7",
      "description": "Analyze how visual and multimedia elements contribute to the meaning, tone, or beauty of a text (e.g., graphic novel, multimedia presentation of fiction, folktale, myth, poem). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Analyze, story, drama, visual and multimedia elements, graphics, sound, photos, animations, audio, digital, genres, descriptions"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.7",
      "grade": null,
      "description": "Integrate and evaluate content presented in diverse media and formats, including visually and quantitatively, as well as in words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors use visual and multimedia elements such as text, graphics, sound, photos, pictures, animations, audio, and video.",
            "That authors use different versions of text such as written, audio, visual, live, print, and digital to convey a message.",
            "That literary genres include graphic novels, multimedia presentations, fiction, folktales, myths, and poetry."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors'/directors' choices of visual and multimedia elements convey meaning.",
            "How to analyze the visual and oral elements to enhance understanding of the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify visual and multimedia elements in a literary text.",
            "Determine the meaning and tone of a literary text.",
            "Explain how authors'/directors' choices of visual and multimedia elements contribute to the meaning of a literary text.",
            "Analyze how visual and multimedia elements contribute to the meaning, tone, or beauty of a text and support the author's message."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.5.8",
      "description": "Not applicable to literature. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.8",
      "grade": null,
      "description": "Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as the relevance and sufficiency of the evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": []
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": []
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": []
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.5.9",
      "description": "Compare and contrast stories in the same genre (e.g., mysteries and adventure stories) on their approaches to similar themes and topics. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Compare, contrast, genre, theme, mysteries, adventure stories, author's purpose, point of view"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to compare and contrast elements of the text to enhance understanding.",
            "That authors write stories such as mysteries and adventures that include a theme, characters, setting, and plot of events."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "An author's approach to a theme/topic is influenced by his or her point of view.",
            "How to compare and contrast various texts to deepen understanding of themes/topics."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify characteristics of various genres.",
            "Identify the theme of two texts with similar themes and topics.",
            "Identify and explain the author's purpose and point of view of two texts with similar themes and topics.",
            "Compare/contrast the approach of similar themes and topics from stories of the same genre."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Literature",
    "reporting_category": "Range of Reading and Level of Text Complexity",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.5.10",
      "description": "By the end of the year, read and comprehend literature, including stories, dramas, and poetry, at the high end of the grades 4-5 text complexity band independently and proficiently. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.10",
      "grade": null,
      "description": "Read and comprehend complex literary and informational texts independently and proficiently."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors write a variety of literary texts (e.g. stories, dramas, poetry).",
            "How to read text from a variety of text genres.",
            "How to choose \"just right\" text for independent reading."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to focus on comprehending within and beyond the text through independent, small, and whole group opportunities."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Activate relevant background knowledge to gain deeper understanding independently and in small and large group settings.",
            "Create visual images to gain deeper understanding independently and in small and large group settings.",
            "Draw inferences to gain deeper understanding independently and in small and large group settings.",
            "Ask questions to gain deeper understanding independently and in small and large group settings.",
            "Determine important ideas to gain deeper understanding"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.5.1",
      "description": "Quote accurately from a text when explaining what the text says explicitly and when drawing inferences from the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Quote, quotation, explicit information, inferences, text evidence, background knowledge, synthesize, summarize, paraphrase"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.1",
      "grade": null,
      "description": "Read closely to determine what the text says explicitly and to make logical inferences from it; cite specific textual evidence when writing or speaking to support conclusions drawn from the text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A quote is a word, phrase, sentence, or paragraph taken directly from the text.",
            "That explicit information is information stated directly in the text.",
            "An inference is a logical assumption based on details and examples from the text.",
            "That authors make purposeful decisions when organizing information text (e.g., paragraphs, quotations, formatting).",
            "How to use background knowledge to enhance understanding of informational text.",
            "How to make, test, and revise predictions before, during, and after reading."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors include key details, which help the reader ask and answer questions.",
            "How to use examples and details to support their inferences.",
            "How to use textual evidence and background knowledge to make inferences and draw conclusions.",
            "How to synthesize ideas using details and examples in informational text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Summarize what the text says, citing evidence from the text and including a relevant quote.",
            "Draw inferences from the text, citing evidence from the text and including a relevant quote.",
            "Justify the choice of a quote and how it supports an explanation of the text.",
            "Paraphrase information from the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.5.2",
      "description": "Determine two or more main ideas of a text and explain how they are supported by key details; summarize the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Analyze, main ideas, details, summarize, text evidence"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.2",
      "grade": null,
      "description": "Determine central ideas or themes of a text and analyze their development; summarize the key supporting details and ideas."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The main idea of a text is the central thought or the point the author is trying to make.",
            "That key details from the text are used to help determine the main idea.",
            "How to use informational text features and/or text structures to help determine the main idea.",
            "That authors may include more than one main idea.",
            "A summary contains only the most important details of the text.",
            "How to participate in discussions when explaining their understanding of the texts."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors of informational texts include key details in order to help readers make meaning of the text.",
            "How to use key details in an informational text to identify the main topic.",
            "How to develop effective summaries that include main ideas of informational text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine when a text has two or more main ideas.",
            "Identify all of the main ideas or points presented by the author.",
            "Identify key details from the text and explain how they support each of the main ideas.",
            "Use details and the main idea to give an oral or written summary of the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.5.3",
      "description": "Explain the relationships or interactions between two or more individuals, events, ideas, or concepts in a historical, scientific, or technical text based on specific information in the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.3",
      "grade": null,
      "description": "Analyze how and why individuals, events, or ideas develop and interact over the course of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors of informational texts may include key ideas/concepts, events, or steps in a process.",
            "That authors use transition words and phrases (e.g., therefore, because, as a result) to signal relationships or interactions between pieces of informational text.",
            "That authors use various text structures when writing informational texts (e.g., time, sequence, cause/effect, steps).",
            "How to teach or explain to others information learned from informational text.",
            "That authors may include relationships and interactions between pieces of informational text (e.g., one piece of text \"explains\" another or stands in"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors include specific information to explain events, procedures, ideas, and concepts in scientific, technical and historical texts and why they occur.",
            "The relationships between and among events, ideas/concepts or steps/procedures and use the information to synthesize what is read."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify two or more individuals, events, ideas, or concepts in an informational text.",
            "Distinguish between key ideas and details from informational text that explain what happened and why.",
            "Identify transition words (e.g., therefore, because, as a result) to find information about relationships/interactions between pieces of information in a text.",
            "Identify and describe text structures the author uses in a text.",
            "Explain orally or in writing the relationships between two or more individuals,"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.5.4",
      "description": "Determine the meaning of general academic and domain-specific words and phrases in a text relevant to a grade 5 topic or subject area. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD General academic words vs. domain-specific words/phrases (Tier II and Tier III words), context clues, figurative language, literal and non-literal language"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.4",
      "grade": null,
      "description": "Interpret words and phrases as they are used in a text, including determining technical, connotative, and figurative meanings, and analyze how specific word choices shape meaning or tone."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors use figurative language to convey meaning.",
            "That authors use different types of context clues to convey meaning of unknown words (e.g., definition, example, antonym, synonym).",
            "How to employ strategies for identifying and using context clues.",
            "How to distinguish the literal and nonliteral meanings of words and phrases to make meaning."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors make purposeful language choices to create meaning in informational text(s).",
            "How to actively seek the meaning of unknown words/phrases to clarify understanding.",
            "How to use textual clues to develop an understanding of the meaning of unknown words/phrases."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use context clues to help unlock the meaning of unknown words/phrases.",
            "Determine the definition of words with multiple meanings.",
            "Describe how word choice creates and clarifies meaning.",
            "Differentiate between literal and non-literal language.",
            "Identify and interpret figurative language."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.5.5",
      "description": "Compare and contrast the overall structure (e.g., chronology, comparison, cause/effect, problem/solution) of events, ideas, concepts, or information in two or more texts. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Compare, contrast, text structure, chronological, sequence, problem/solution, cause/effect, descriptive, text features"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.5",
      "grade": null,
      "description": "Analyze the structure of texts, including how specific sentences, paragraphs, and larger portions of the text (e.g., a section, chapter, scene, or stanza) relate to each other and the whole."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors of informational text use different types of text structures to organize information.",
            "How to synthesize ideas by combining what they know with new information gained from the text(s).",
            "How to use common signal words and transition words to determine the structure of a text.",
            "How to use the structure of the text (e.g., chronology, comparison, cause/effect, problem/solution) to make sense of the information that is presented and develop a deeper understanding of the informational presented in the text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to use signal words to determine various text structures.",
            "How to use text features to support understanding of informational texts.",
            "That authors present their ideas in an organizational pattern to achieve a particular purpose in the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the overall structure of two or more texts.",
            "Describe similarities and differences in the development of events in two or more texts.",
            "Describe similarities and differences in the development of ideas in two or more texts.",
            "Describe similarities and differences in the development of concepts in two or more texts.",
            "Describe similarities and differences in the development of information in two or more texts."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.5.6",
      "description": "Analyze multiple accounts of the same event or topic, noting important similarities and differences in the point of view they represent. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.6",
      "grade": null,
      "description": "Assess how point of view or purpose shapes the content and style of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors write for a variety of purposes (e.g., to inform, to persuade, to entertain, to describe, to explain).",
            "That authors may describe an event or topic in various ways.",
            "That authors write from different points of view.",
            "A firsthand account (primary source) is told from the perspective of a participant in the described event.",
            "A secondhand account (secondary source) is told from the perspective of someone who was not a participant in the described event.",
            "That there may be similarities and differences between"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The author's account of an event or topic is influenced by his or her point of view.",
            "That multiple accounts of the same event or topic can share similarities and differences based on each author's personal point of view.",
            "The same event or topic can be viewed differently when told from different perspectives."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Describe authors' overall purpose for writing a text.",
            "Identify the intended audience.",
            "Describe how author's choices reflect his or her point of view, focus, attitude, or bias when reading multiple accounts of the same topic or event.",
            "Explain how the point of view is conveyed in texts of the same event or topic.",
            "Analyze different points of view used in multiple accounts of the same event or topic.",
            "Determine similarities and differences between multiple accounts of the same event or topic.",
            "Explain orally or through writing how an author's point of view affects his or her account of an event or topic."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.5.7",
      "description": "Draw on information from multiple print or digital sources, demonstrating the ability to locate an answer to a question quickly or to solve a problem efficiently. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Analyze, determine, distinguish, integrate, synthesize, print/digital sources, media formats, efficiently, key words, text features, relevant/irrelevant information, reliable/unreliable sources"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.7",
      "grade": null,
      "description": "Integrate and evaluate content presented in diverse media and formats, including visually and quantitatively, as well as in words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That digital sources include multimedia and interactive elements.",
            "That authors use graphics, images, and illustrations (e.g., pictures, photographs, charts, graphs, diagrams, time lines, animations) to present information.",
            "That authors use different media formats (e.g., visual, oral, quantitative) to present information."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors use both print and digital formats when writing informational text.",
            "How to use strategies to locate key information from print and digital sources.",
            "How to make purposeful choices when locating information from print and digital sources.",
            "How to use information from print and digital sources to answer questions and solve problems."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify information from multiple sources.",
            "Differentiate between relevant and irrelevant information.",
            "Differentiate between reliable and unreliable sources.",
            "Analyze information needed from print and digital source to answer a question or solve a problem.",
            "Determine the most effective and efficient method for answering a question or solving a problem.",
            "Use a variety of media sources to answer a question or solve a problem."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.5.8",
      "description": "Explain how an author uses reasons and evidence to support particular points in a text, identifying which reasons and evidence support which point(s). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Explain, determine, evaluate, reasons, evidence, key points, persuasive techniques, argument, support, relevant vs. irrelevant information"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.8",
      "grade": null,
      "description": "Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as the relevance and sufficiency of the evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors include main ideas and important points in informational text.",
            "That authors include reasons to support his or her points in an informational text.",
            "That authors include evidences throughout informational text to support his or her key points.",
            "That authors use persuasive techniques (e.g., emotional words, repetition, name calling) to support his or her purpose for writing.",
            "That relevant information is important and irrelevant information is not important."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to identify reasons and evidence an author uses to support key ideas to build upon their understanding.",
            "How to understand that reasons explain \"why I think this,\" and evidence explains \"how I know that this is the case.\""
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the author's key points.",
            "Identify reasons or evidences that support the author's key points.",
            "Determine which reasons support which key points made by the author.",
            "Determine which evidences support which key points made by the author.",
            "Evaluate and explain, orally or in writing, the connection between reasons and key points in an informational text.",
            "Evaluate and explain, orally or in writing, the connection between evidences and key points in an informational text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.5.9",
      "description": "Integrate information from several texts on the same topic in order to write or speak about the subject knowledgeably. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Integrate, synthesize, key points, relevant information, irrelevant information, topic, research, purposes for reading, graphic organizers, write, compose, speak, present, knowledgeably"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That information about a topic may be learned from more than one source.",
            "How to compare and contrast elements of the text to enhance understanding.",
            "That authors include main ideas and important points in informational text.",
            "That authors include supporting details to reinforce his or her main ideas.",
            "How to set a purpose for researching and gathering information.",
            "How to manage information gathered from text using various graphic organizers.",
            "That information from two texts can be combined to create a more complete understanding of a topic."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors of informational texts provide information and key details on topics in different ways.",
            "How to construct meaning by integrating important information presented in several texts."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify key and relevant details about a single topic from several informational texts.",
            "Categorize key details from several informational texts.",
            "Differentiate between relevant information and irrelevant information.",
            "Combine information from several informational texts about the same topic.",
            "Speak knowledgeably about a topic, integrating information from several informational texts.",
            "Compose a piece of writing about a topic, integrating information from several texts."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Informational Text",
    "reporting_category": "Range of Reading and Level of Text Complexity",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.5.10",
      "description": "By the end of the year, read and comprehend informational texts, including history/social studies, science, and technical texts, at the high end of the grades 4-5 text complexity band independently and proficiently. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.10",
      "grade": null,
      "description": "Read and comprehend complex literary and informational texts independently and proficiently."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors write a variety of informational texts, including history/social studies, science, and technical texts.",
            "How to read text from a variety of text genres.",
            "How to choose \"just right\" text for independent reading."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to focus on comprehending within and beyond the text through independent, small, and whole group opportunities."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Utilize comprehension strategies such as activate relevant background knowledge to gain deeper understanding independently and in small and large group settings.",
            "Utilize comprehension strategies such as create visual images to gain deeper understanding independently and in small and large group settings.",
            "Utilize comprehension strategies such as draw inferences to gain deeper understanding independently and in small and large group settings.",
            "Utilize comprehension strategies such as ask questions to gain deeper"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.5.3",
      "description": "Know and apply grade-level phonics and word analysis skills in decoding words. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Know, apply, phonics, word analysis, decoding, affix, prefix, suffix, multi-syllable, irregularly spelled words"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.3",
      "grade": null,
      "description": "Evaluate a speaker's point of view, reasoning, and use of evidence and rhetoric."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to recognize common letter patterns in words.",
            "How to recognize common affixes.",
            "How to recognize common root/base words.",
            "How to recognize common syllable patterns in words.",
            "How to recognize common syllable types in words."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A reader's ability to break a word into meaningful parts impacts their ability to read.",
            "How to use knowledge of phonics and morphology to become proficient readers.",
            "A reader's ability to apply phonics and word analysis skills provides anchors to help learn about words' meanings, spelling, and sound.",
            "That phonics is the understanding that there is a predictable relationship between the sounds of spoken language and the letters and spellings that represent those sounds."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use common spelling patterns to help read words.",
            "Use common syllable patterns to read syllables in words.",
            "Pronounce a syllable using its syllable type.",
            "Break a word into its affixes and root/base word to pronounce it."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.5.3a",
      "description": "Use combined knowledge of all letter-sound correspondences, syllabication patterns, and morphology (e.g., roots and affixes) to read accurately unfamiliar multisyllabic words in context and out of context. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Letter-sound correspondence, syllable, syllable pattern, multisyllabic, morphology, root word, affix, prefix, suffix, in context, out of context"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.3",
      "grade": null,
      "description": "Evaluate a speaker's point of view, reasoning, and use of evidence and rhetoric."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That there are six types of syllables (e.g., closed, open, vowel-consonant-e, vowel team, r-controlled, consonant-le) found in words.",
            "How to use four different syllable division patterns (e.g., VC/CV, V/CV, VC/V, V/V) to decode words.",
            "A prefix is a type of affix, or group of letters, placed before the root/base word.",
            "A suffix is a type of affix, or group letters, placed after the root/base word."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to use knowledge of phonics and word structure to help develop strategies for reading multisyllabic words.",
            "How to apply multiple strategies to decode multisyllabic words."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Demonstrate letter-sound correspondences.",
            "Use syllabication patterns to decode words.",
            "Determine the meanings of roots and affixes to decode multisyllabic words in context and out of context."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.5.4",
      "description": "Read with sufficient accuracy and fluency to support comprehension. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Accuracy, fluency, fluent, expression, intonation, tone, comprehension, word recognition"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.4",
      "grade": null,
      "description": "Present information, findings, and supporting evidence such that listeners can follow the line of reasoning and the organization, development, and style are appropriate to task, purpose, and audience."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That fluency is the ability to read smoothly and accurately.",
            "That fluent readers read with expression.",
            "That fluency is important because it provides a bridge between word recognition and reading comprehension."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That readers who read fluently are able to attend to comprehension.",
            "The more readers read, the better their fluency will become."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Read accurately to support understanding of literary and informational text.",
            "Read fluently to support understanding of literary and informational text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.5.4a",
      "description": "Read grade-level text with purpose and understanding. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Grade-level text, setting a purpose for reading, author's purpose, comprehension, understanding, meaning"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.4",
      "grade": null,
      "description": "Present information, findings, and supporting evidence such that listeners can follow the line of reasoning and the organization, development, and style are appropriate to task, purpose, and audience."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That readers read for different purposes.",
            "That authors write for different purposes."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How reading grade-level text is a foundational step in reading increasingly complex text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine the purpose for reading a literary or informational text.",
            "Read fifth grade text orally or silently with understanding.",
            "Explain orally or in writing what was read."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.5.4b",
      "description": "Read grade-level prose and poetry orally with accuracy, appropriate rate, and expression on successive readings. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Prose, poetry, accuracy, appropriate rate, automaticity, expression, fluency, phrasing"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.4",
      "grade": null,
      "description": "Present information, findings, and supporting evidence such that listeners can follow the line of reasoning and the organization, development, and style are appropriate to task, purpose, and audience."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That prose writing consists of ideas contained in sentences that are arranged in paragraphs",
            "That most everyday writing is in prose form.",
            "That poetry consists of lines that may or may not be sentences and are arranged in stanzas.",
            "That poetry tends to include more expressive language with literary and sound devices.",
            "That fluency includes reading with few errors and at an appropriate rate.",
            "That fluent readers read with automaticity and expression."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How reading fluently allows the reader to attend to comprehension.",
            "That fluent readers read poetry differently than prose."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine whether a text is prose or poetry.",
            "Adjust the rate of reading to match the purpose.",
            "Determine appropriate phrasing when reading poetry.",
            "Orally read prose and poetry with automaticity (accuracy and rate).",
            "Orally read prose and poetry with expression."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Reading Foundational Skills",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RF.5.4c",
      "description": "Use context to confirm or self-correct word recognition and understanding, rereading as necessary. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Context, confirm, self-correct, reread, decoding strategies, pronunciation, word recognition, monitor"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.4",
      "grade": null,
      "description": "Present information, findings, and supporting evidence such that listeners can follow the line of reasoning and the organization, development, and style are appropriate to task, purpose, and audience."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to use strategies to decode unknown words."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to monitor and self-correct when comprehension is interrupted.",
            "How to reread words, sentences, and parts of the text to improve understanding."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use context to confirm the pronunciation of a word.",
            "Use context to change the pronunciation of a word.",
            "Use context to confirm what is read makes sense.",
            "Reread if something does not make sense.",
            "Make corrections while reading silently or orally."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.1a",
      "description": "Introduce a topic or text clearly, state an opinion, and create an organizational structure in which ideas are logically grouped to support the writer's purpose. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Opinion pieces, topics, texts, supporting, point of view, reasons, information, introduce, writing, clearly, state an opinion, create organizational structure, ideas are logically grouped, writer's purpose, view point, coherent, purposes, prove, analyze"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts, using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That opinion writings are written to express a point about a topic or text.",
            "The introduction states the point the author is trying to make or prove about a text or topic.",
            "How using specific words or phrases enables writers to clearly communicate an opinion.",
            "That writers use specific words or phrases when composing opinion pieces (e.g., has an important lesson, knowledgeable, sensible/senseless).",
            "The author's opinion is supported with reasons from the text.",
            "That ideas are grouped in a logical way to give the reader an understanding of the authors' purpose for writing."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That opinion writings are written to express a point about a topic or text.",
            "The introduction states the point the author is trying to make or prove about a text or topic.",
            "How using specific words or phrases enables writers to clearly communicate an opinion.",
            "That writers use specific words or phrases when composing opinion pieces (e.g., has an important lesson, knowledgeable, sensible/senseless).",
            "The author's opinion is supported with reasons from the text.",
            "That ideas are grouped in a logical way to give the reader an understanding of the authors' purpose for writing."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Read a mentor text or researches a topic.",
            "Form an opinion based upon a text or topic.",
            "Determine the purpose for the opinion piece.",
            "Utilize a planning map or graphic organizer in order to group ideas to support the purpose for writing.",
            "State an opinion using specific words or phrases to clearly communicate the opinion."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.1b",
      "description": "Provide logically ordered reasons that are supported by facts and details. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Opinion, provide logically ordered reasons, supported by facts and details, topic, text, researching, multiple sources, writing, note taking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts, using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A writer develops the opinion about a text by providing reasons from the text read.",
            "That facts and details from the text are used to support the opinion."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A writer develops the opinion about a text by providing reasons from the text read.",
            "That facts and details from the text are used to support the opinion.",
            "That reasons are logically ordered create a sense structure for the reader."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Choose facts and details from the text to support the opinion.",
            "Determine the relationship between reasons.",
            "Choose a logical order for reasons."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.1c",
      "description": "Link opinion and reasons using words, phrases, and clauses (e.g., consequently, specifically). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Opinion piece, link, words, phrases, clauses, connect, opinion, reasons, also, however, also, for instance, in order to, in addition, when the book ended, we considered both sides, signal, direction, natural flow, organization, identifies, transitions, appropriate, writing"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts, using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That linking words and phrases signal the direction the writing is taking to the reader.",
            "That linking words and phrases connect the opinions and reasons within the paper for a natural flow for organization."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That linking words and phrases signal the direction the writing is taking to the reader.",
            "That linking words and phrases connect the opinions and reasons within the paper for a natural flow for organization.",
            "That dependent clauses are used to link opinions and reasons.",
            "That dependent clauses can function as an adjective or adverb.",
            "That writers must evaluate the idea being expressed in order to choose which type of clause to employ."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the places in the writing where transitions need to take place.",
            "Identify the appropriate linking words and phrases to use in the writing.",
            "Use linking words to connect and forward the opinion.",
            "Use linking phrases to connect and forward the opinion.",
            "Identify the appropriate clauses to link opinion and reasons.",
            "Use clauses to link opinion and reasons."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.1d",
      "description": "Provide a concluding statement or section related to the opinion presented. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Opinion piece, provide, concluding statement, concluding section, close, organization, recognize, ending, thoughts, related to the opinion presented"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts, using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A conclusion provides an ending to a piece written.",
            "A conclusion leaves the reader with something to think about.",
            "That conclusions act as a way for readers to clearly understand the opinion stated.",
            "The conclusion statement or section relates directly to the opinion made in the introduction."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A conclusion provides an ending to a piece written.",
            "A conclusion leaves the reader with something to think about.",
            "That conclusions act as a way for readers to clearly understand the opinion stated.",
            "The conclusion statement or section relates directly to the opinion made in the introduction."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify thought(s) to leave the reader with before writing the conclusion.",
            "Choose a closing technique e.g., summarize information, quote, encourage action, restate the opinion).",
            "Write a concluding statement or section that relates directly to the opinion made in the introduction."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.2a",
      "description": "Introduce a topic clearly, provide a general observation and focus, and group related information logically; include formatting (e.g., headings), illustrations, and multimedia when useful to aiding comprehension. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Informative text, explanatory text, research, comprehension, aid, introduction, provide a general observation, provide a general focus, topic, audience, form of writing, purpose, compare, contrast, descriptive, problem/solution, cause/effect, chronology, organizational structure, illustrations, mentor texts, teacher model, paragraphs, sections, multimedia, headings, inform, why, how, writing"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative/explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How utilizing facts, definitions, concrete details, quotations, or examples from the text allow the elaborate on a topic.",
            "That concrete details are specific facts within the text.",
            "That quotations are group of words taken directly from the text.",
            "That quotations taken from the text should be punctuated with commas and quotation marks in order to avoid plagiarism.",
            "That plagiarism is the act of taking another's words, thoughts, or ideas with attribution."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How using specific words, phrases, or clauses enables writers to clearly communicate a topic.",
            "An introduction has a central focus or a topic/idea that has been observed in the text.",
            "That information is grouped in a logical way to give the reader an understanding of the author's purpose for writing.",
            "That surface features such as headings, illustrations, and multimedia are utilized to further aid the reader with understanding the structure of the content."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use specific words, phrases, or clauses to clearly communicate a topic.",
            "State an introduction that has a central focus or a topic/idea.",
            "Group information in a logical way to give the reader an understanding of the author's purpose for writing.",
            "Choose surface features such as headings, illustrations, and multimedia to further aid the reader with understanding the structure of the content."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.2b",
      "description": "Develop the topic with facts, definitions, and concrete details, quotations, or other information and examples related to the topic. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Informative text, explanatory text, develop, topic, facts, definition, concrete details, research, close read, paraphrase, convey ideas clearly, convey information clearly, point of view, sources, notes, reference sources, include, primary sources, secondary sources, organizational structure grouping related information, examples, quotations, writing"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative/explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How utilizing facts, definitions, concrete details, quotations, or examples from the text allow the elaborate on a topic.",
            "That concrete details are specific facts within the text.",
            "That quotations are group of words taken directly from the text.",
            "That quotations taken from the text should be punctuated with commas and quotation marks in order to avoid plagiarism.",
            "That plagiarism is the act of taking another's words, thoughts, or ideas without attribution."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How utilizing facts, definitions, concrete details, quotations, or examples from the text allow the elaborate on a topic.",
            "That concrete details are specific facts within the text.",
            "That quotations are group of words taken directly from the text.",
            "That quotations taken from the text should be punctuated with commas and quotation marks in order to avoid plagiarism.",
            "That plagiarism is the act of taking another's words, thoughts, or ideas with attribution."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Choose facts, definitions, concrete details, quotations, or examples from the text to develop the topic.",
            "Use commas and quotation marks to attribute words, thoughts, or ideas to the author."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.2c",
      "description": "Link ideas within and across categories of information using words, phrases, and clauses (e.g., in contrast, especially). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Informative text, explanatory text, linking words, linking phrases, linking clauses, link ideas, categories of information, using, progress, signal, direction, writing"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative/explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That linking words and phrases connect ideas within categories of information (e.g., another, for example, also, because).",
            "That linking words and phrases help the writer communicate ideas clearly to the reader"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That linking words and phrases signal the direction the writing is taking to the reader.",
            "That linking words and phrases connect the opinions and reasons within the paper for a natural flow for organization.",
            "That dependent clauses are used to link opinions and reasons.",
            "That dependent clauses can function as an adjective or adverb.",
            "That writers must evaluate the idea being expressed in order to choose which type of clause to employ."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the places in the writing where transitions need to take place.",
            "Identify the appropriate linking words and phrases to use in the writing.",
            "Use linking words to connect and forward the opinion.",
            "Use linking phrases to connect and forward the opinion.",
            "Identify the appropriate clauses to link opinion and reasons.",
            "Use clauses to link opinion and reasons."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.2d",
      "description": "Use precise language and domain-specific vocabulary to inform about or explain the topic. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Informative text, explanatory text, provide, precise language, domain-specific vocabulary, express, inform about the topic, explain the topic"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative/explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That writers choose specific words and phrases for effect.",
            "That writers acquire and use domain-specific words and phrases to inform or explain a topic."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That writers choose specific nouns, adjectives, and/or verbs in order to make ideas understandable."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Choose specific nouns, adjectives, and/or verbs in order to make ideas understandable.",
            "Include specific nouns, adjectives, and/or verbs in order to make ideas understandable in ideas to inform or explain the topic."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.2e",
      "description": "Provide a concluding statement or section related to the information or explanation presented. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Informative text, explanatory text, provide, concluding statement, concluding section, close, demonstrates, related, information, explanation"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative/explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A writing piece must be organized.",
            "A concluding statement or section brings a piece of writing to a close.",
            "That closings for an informative/explanatory piece can vary (e.g., summary, reaction or feeling, image description, quotation)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That conclusions act as a way for readers to clearly understand the topic stated.",
            "The conclusion statement or section relates directly to the information or explanation presented in the introduction."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify thought(s) to leave the reader with before writing the conclusion.",
            "Choose a closing technique (e.g., summary, reaction or feeling, image description, quotation).",
            "Write a conclusion statement or section that relates directly to the information or explanation presented in the introduction."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.3a",
      "description": "Orient the reader by establishing a situation and introducing a narrator and/or characters; organize an event sequence that unfolds naturally. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Narrative, develop, real experiences, imagine experiences, forms, introduction, establishes a situation, plot, event sequence, narrator, character(s), point of view, audience, style, form, structure, appropriate, compare/contrast, descriptive, problem/solution, cause/effect, chronology, organize, unfolds naturally, enlightens, smooth progression, events, time, setting, location, mood, tone, analyze, mentor text, teacher model, author's craft, prompt, beginning, middle, end, writing"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well- chosen details, and well-structured event sequences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That narratives can be written to express real or imagined experiences or events.",
            "That writers utilize a variety of techniques (e.g., direct statement, draw-in question, snapshot, observation from the senses) for establishing a situation.",
            "That writers utilize a variety of planning strategies (e.g., sketch the sequence, narrative map, sticky notes with events) for creating a coherent event sequence.",
            "A narrator and/or character(s) can be introduced a variety of ways (e.g., in the beginning, as the story progresses)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That narratives can be written to express real or imagined experiences or events.",
            "That writers utilize a variety of techniques (e.g., direct statement, draw-in question, snapshot, observation from the senses) for establishing a situation.",
            "That writers utilize a variety of planning strategies (e.g., sketch the sequence, narrative map, sticky notes with events) for creating a coherent event sequence.",
            "A narrator and/or character(s) can be introduced a variety of ways (e.g., in the beginning, as the story progresses)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Analyze mentor texts.",
            "Choose purpose for writing.",
            "Choose form of writing.",
            "Implement a planning strategy for creating an event sequence (e.g., sketch the sequence, narrative map, sticky notes with events).",
            "Choose a technique for establishing the situation or focal point of the story to engage the reader (e.g., direct statement, draw-in question, snapshot, observation from the senses).",
            "Introduce a real or imaginative narrator and/or character(s) in the narrative."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.3b",
      "description": "Use narrative techniques, such as dialogue, description, and pacing to develop experiences and events or show the responses of characters to situations. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well- chosen details, and well-structured event sequences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That dialogue and description are used to develop a character.",
            "A character's internal narrative (thoughts), when balanced with dialogue, actions, and feelings, can provide an inside look at what motivates the character.",
            "How showing the character's response to situations further develops the plot.",
            "The more time given in writing to developing the character will develop the experiences and events in the story."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That writers utilize several techniques in order to elaborate.",
            "That dialogue and description of actions, thoughts, and feelings are used to develop a character.",
            "How pacing occurs when the narrative is broken up with specific examples, descriptions, scenes, and dialogue so that it does not become flat.",
            "A character's internal narrative (thoughts), when balanced with dialogue, actions, and feelings, can provide an inside look at what motivates the character."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use dialogue in the narrative to develop experiences and events.",
            "Use descriptions of actions, thoughts, and feelings in the narrative to develop experiences and events.",
            "Write a narrative where the events are well-paced.",
            "Show response of characters to situations."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.3c",
      "description": "Use a variety of transitional words, phrases, and clauses to manage the sequence of events. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Narrative, transitional words, transitional phrases, clauses, signal, event order, effectively, naturally, writing, identify, moves, guide"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well- chosen details, and well-structured event sequences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That appropriate places in a narrative text where temporal words and phrases are necessary in order to signal changes in events.",
            "That temporal words effectively signal event order in a writing (e.g., first, next, last, finally, then, after, afterwards, following).",
            "That temporal phrases effectively to signal event order in a writing (e.g., a long time ago, one day, in the morning, after several minutes)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That transitional words and phrases help to guide the reader through the story to signal an order of events in the writing.",
            "That prepositions and prepositional phrases often function as transitional words or phrases."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use transitional words in the writing to signal event order.",
            "Use transitional phrases in the writing to signal event order."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.3d",
      "description": "Use concrete words and phrases and sensory details to convey experiences and events precisely. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Narrative, concrete words, concrete phrases, sensory details, convey experiences precisely, convey events precisely, touch, taste, smell, hear, see, show, telling"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well- chosen details, and well-structured event sequences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That writers choose specific nouns, adjectives, and/or verbs in order to make ideas understandable.",
            "That concrete words and phrases are things you can touch, taste, smell, hear, and see.",
            "That concrete words and phrases stimulate sensory responses.",
            "How using concrete words, concrete phrases, and sensory details is a way for the writer to show the reader the story instead of just telling about it."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That writers choose specific nouns, adjectives, and/or verbs in order to make ideas understandable.",
            "That concrete words and phrases are things you can touch, taste, smell, hear, and see.",
            "That concrete words and phrases stimulate sensory responses.",
            "How using concrete words, concrete phrases, and sensory details is a way for the writer to show the reader the story instead of just telling about it."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Include concrete words.",
            "Include concrete phrases.",
            "Include sensory details.",
            "Convey experiences precisely using concrete words, concrete phrases, and sensory details.",
            "Convey events precisely using concrete words, concrete phrases, and sensory details."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.3e",
      "description": "Provide a conclusion that follows from the narrated experiences or events. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Narrative, provide, conclusion, follows, narrated experiences, events, close, writing, final impressions, organization"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well- chosen details, and well-structured event sequences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to bring a paper to a close by writing an ending to the narrative.",
            "The conclusion written is not separate from the story or a summary of what happened.",
            "The conclusion is a continuation of the narrated experience or event written about."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A narrative piece must be organized.",
            "How providing a sense of closure brings everything together for the reader.",
            "That conclusions for a narrative piece can vary (e.g., visual or sensory image, statement of personal development, audience connection, surprise).",
            "That conclusions must follow the sequence of experiences or events in the writing."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write a conclusion that follows the narrated experiences or events."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.4",
      "description": "Produce clear and coherent writing in which the development and organization are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1-3 above.) Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Produce, clear, coherent, writing, development, organization, appropriate, task, purpose, audience, organizational structure, compare/contrast, descriptive, problem/solution, cause/effect, chronology, techniques, strategies, distribution, production, prewrite, organize"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.4",
      "grade": null,
      "description": "Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The audience, or reader, must be considered when composing each of the three writing tasks.",
            "That content chosen for each of the three writing tasks should be on topic, engaging, and interesting for the chosen audience.",
            "How to omit content that is off-topic, disengaging, or uninteresting for the audience."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The audience, or reader, must be considered when composing each of the three writing tasks.",
            "That content chosen for each of the three writing tasks should be clear and coherent.",
            "That content that is clear and coherent is on topic, engaging, and interesting for the chosen audience.",
            "How to omit content that is off-topic, disengaging, or uninteresting for the audience."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write for a specific task as reference in standards 1-3 above.",
            "Write for a specific purpose as referenced in standards 1-3 above.",
            "Produce a writing piece that that follows an organization structure as referenced in standards 1-3 above.",
            "Choose content that is on-topic, engaging, and interesting for the audience being considered.",
            "Omit content that is off-topic, disengaging, or uninteresting for the audience being considered."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.5",
      "description": "With guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.5",
      "grade": null,
      "description": "Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That adults and peers provide guidance and feedback when revising and editing a piece of writing.",
            "That guidance and feedback from adults and peers strengthen and ensure that a piece of writing is focused on a specific topic.",
            "How moving a piece of writing through planning, revising, and editing ensures that a piece of writing is fully developed.",
            "How planning a piece of writing involves the identification of a topic, genre or format, purpose and audience. Writers may use a variety of strategies to plan their writing piece (e.g. drawing, talking, using a map, jotting down notes)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That adults and peers provide guidance and feedback when revising and editing a piece of writing.",
            "That guidance and feedback from adults and peers strengthen and ensure that a piece of writing is focused on a specific topic.",
            "How moving a piece of writing through planning, revising, and editing ensures that a piece of writing is fully developed.",
            "How planning a piece of writing involves the identification of a topic, genre or format, purpose and audience. Writers may use a variety of strategies to plan their writing piece (e.g. drawing, talking, using a map, jotting down notes)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Plan a piece of writing by implementing a specific strategy (e.g., drawing, talking, using a map, jotting down notes).",
            "Share a piece writing with an adult or peer for the purpose of receiving feedback about specific sentences or sections that need to be revised for clarity, coherence, and appropriateness to task, purpose, and/or audience.",
            "Share a piece of writing with an adult or peer for the purpose of receiving feedback about specific conventions related to Language Standard 2 (e.g., capitals, punctuation, spelling).",
            "Recognize that a writing piece may need to be rewritten."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.6",
      "description": "With some guidance and support from adults, use technology, including the Internet, to produce and publish writing as well as to interact and collaborate with others; demonstrate sufficient command of keyboarding skills. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.6",
      "grade": null,
      "description": "Use technology, including the Internet, to produce and publish writing and to interact and collaborate with others."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That technological advances in the twenty-first century have challenged writers to move beyond paper and pencils when formatting writing pieces.",
            "The Internet is a twenty-first century source for producing and publishing writing.",
            "That various types of devices (e.g., Computer, iPad, iTouch, tablet) can be used to produce and publish writing.",
            "A variety of digital tools (e.g., Story Buddy 2, Story Kit, Popplet, Story Builder, Story Patch) can be used to produce and publish writing.",
            "A variety of technological tools (e.g., document projectors, interactive white board, web-based sharing platforms, student-centered websites and web page) can be used to collaborate with peers to produce and publish writing."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That technological advances in the twenty-first century have challenged writers to move beyond paper and pencils when formatting writing pieces.",
            "The Internet is a twenty-first century source for producing and publishing writing.",
            "That various types of devices (e.g., Computer, iPad, iTouch, tablet) can be used to produce and publish writing.",
            "A variety of digital tools (e.g., Story Buddy 2, Story Kit, Popplet, Story Builder, Story Patch) can be used to produce and publish writing.",
            "A variety of technological tools (e.g., document projectors, interactive white board, web-based sharing platforms, student-centered websites and web page) can be used to collaborate with peers to produce and publish writing."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use various types of devices to produce and publish writing",
            "Use a digital tool to produce and publish writing.",
            "Use a variety of technological tools to produce and publish writing.",
            "Use a word processing program (using keyboarding skills) to produce and publish writing).",
            "Use technology to interact and collaborate with others to produce and publish writing.",
            "Utilize technology and keyboarding skills."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.7",
      "description": "Conduct short research projects that use several sources to build knowledge through investigation of different aspects of a topic. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.7",
      "grade": null,
      "description": "Conduct short as well as more sustained research projects based on focused questions, demonstrating understanding of the subject under investigation."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That research allows writers to build knowledge about a topic.",
            "That research projects have a set of parameters and procedures that must be followed.",
            "That research projects have topic parameters that narrow the focus of the project.",
            "That research projects have collaboration parameters that state how students will be working together on the project.",
            "That research projects have research parameters that state whether the project will utilize print and/or observation based research.",
            "That research projects have publishing parameters that state a specific format (e.g., book review, how-to piece, biography) writers will use to present findings."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That research allows writers to build knowledge about a topic.",
            "That research projects have a set of parameters and procedures that must be followed.",
            "That research projects have topic parameters that narrow the focus of the project.",
            "That research projects have collaboration parameters that state how students will be working together on the project.",
            "That research projects have research parameters that state whether the project will utilize print and/or observation based research.",
            "That research projects have publishing parameters that state a specific format (e.g., book review, how-to piece, biography) writers will use to present findings."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Research in a shorter time span.",
            "Research a topic.",
            "Research different aspects of the topic.",
            "Research using several sources to gain understanding of the topic under investigation through focused questions.",
            "Gather and take notes on information from several sources.",
            "Decide on how the writing project will be organized.",
            "Write about the topic in a way that best conveys the knowledge built while researching to complete the project."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.8",
      "description": "Recall relevant information from experiences or gather relevant information from print and digital sources; summarize or paraphrase information in notes and finished work, and provide a list of sources. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.8",
      "grade": null,
      "description": "Gather relevant information from multiple print and digital sources, assess the credibility and accuracy of each source, and integrate the information while avoiding plagiarism."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That past experiences can provide a foundation for answering questions about a topic.",
            "How gathering information from multiple sources, both print and digital, supports the writing.",
            "How note-taking keeps the research focused and allows the student the opportunity to go back to the notes to actually use in the writing.",
            "That researchers use various techniques (e.g., note-taking forms, marking print sources, marking digital sources) for taking meaningful notes.",
            "That note-taking forms allow the researcher to record the question or topic and document supporting"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": []
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Recall experiences from their past to be used as a source.",
            "Gather information from print and digital sources.",
            "Utilize a note-taking technique to take meaningful notes about a topic.",
            "Summarize notes.",
            "Paraphrase notes.",
            "Sort information from notes into categories.",
            "Provide a list of sources."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.9a",
      "description": "Apply grade 5 Reading standards to literature (e.g., \"Compare and contrast two or more characters, settings, or events in a story or a drama, drawing on specific details in the text [e.g., how characters interact]\"). Desired Student Performance A student should know (Prerequisite Knowledge) Analysis Reflection A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.9",
      "grade": null,
      "description": "Draw evidence from literary or informational texts to support analysis, reflection, and research."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "An analysis can be done on different types of literary texts (e.g., story, drama).",
            "That specific details from the literary texts are used in the analysis.",
            "An analysis can be about more than one literary text.",
            "An analysis has structure.",
            "A reflection can be done on different types of literary texts (e.g., story, drama).",
            "That specific details from the literary texts are used in the reflection.",
            "A reflection can be about more than one literary text.",
            "A reflection has structure."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors use specific details in a story or drama to describe characters, settings, or events.",
            "How to use specific details from a literary text to support their thinking about characters, settings, or events."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write a literary analysis using evidence from a story or drama.",
            "Write a reflection using evidence from a story or drama.",
            "Write a research piece using evidence from a story or drama."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.9b",
      "description": "Apply grade 5 Reading standards to informational texts (e.g., \"Explain how an author uses reasons and evidence to support particular points in a text, identifying which reasons and evidence support which point[s]\"). Desired Student Performance A student should know (Prerequisite Knowledge) Analysis Reflection A student should understand (Conceptual Understanding) Analysis Reflection A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.9",
      "grade": null,
      "description": "Draw evidence from literary or informational texts to support analysis, reflection, and research."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That specific details from the informational texts are used in the analysis.",
            "An analysis can be about more than one informational text.",
            "An analysis has structure.",
            "A reflection can be done on different types of informational texts (i.e., articles, brochure, Encyclopedia entry).",
            "That specific details from the informational texts are used in the reflection.",
            "A reflection can be about more than one informational text.",
            "A reflection has structure.",
            "A reflection includes the student's personal thoughts,"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That specific details from the informational texts are used in the analysis.",
            "That informational text contains explicit reasons and evidence to support points.",
            "An analysis can be about more than one informational text.",
            "An analysis has structure.",
            "A reflection can be done on different types of informational texts (i.e., articles, brochure, Encyclopedia entry).",
            "That specific details from the informational texts are used in the reflection.",
            "That informational text contains explicit reasons and evidence to support points."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write an informational analysis using evidence from informational texts.",
            "Write a reflection using evidence from informational texts.",
            "Write a research piece using evidence from informational texts.",
            "Identify which reasons and evidence support specific points in the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Writing",
    "reporting_category": "Range of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.5.10",
      "description": "Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Write routinely, extended time frames, research, reflection, revision, shorter time frames, single setting or day or two, range, discipline-specific tasks, purposes, audiences, experiences, math, ELA, science, social studies, multiple opportunities, on demand writing, short constructed response, text based questions, content knowledge, aspect of a text or texts, sophisticated understandings of vocabulary, text structure, analysis"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.10",
      "grade": null,
      "description": "Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of tasks, purposes, and audiences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That routine writing is repeated experiences with writing.",
            "How to write for extended time frames for research, reflection, and revision.",
            "How to write for shorter time frames that is done in a single setting or a day or two.",
            "How to write for a range of discipline-specific tasks (e.g., math, science, social studies, ELA).",
            "How to write for a range of discipline-specific purposes.",
            "How to write for a range of discipline-specific audiences (e.g., teacher, parent, legislator, online audience, editor)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That writers need multiple opportunities to write for extended time frames and shorter time frames for different purposes throughout the entire school year (in every nine weeks).",
            "That on-demand writing requires different processes than extended process writings."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write daily.",
            "Write for extended time frames when research, reflection, and revision is required.",
            "Write for shorter time frames in a single setting or day or two.",
            "Write to address range of discipline-specific tasks.",
            "Write to address range of purposes.",
            "Write to address range of audiences."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.5.1a",
      "description": "Come to discussions prepared having read or studied required material; explicitly draw on that preparation and other information known about the topic to explore ideas under discussion. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Prepare, participate, conversations, collaborations, diverse, engage, effectively, explicitly, information, explore, discussion, expressing, clearly, preparation, appropriate, main idea, supporting details, key ideas, evidence, paraphrasing, connections, direct quotes"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That collaborative discussions are more productive when participants have read and studied material prior to the discussion.",
            "That participants use prior knowledge about a topic to add ideas to a collaborative discussion.",
            "That participants use evidence from the information read and studied in order to add ideas to a discussion."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That collaborative discussions are more productive when participants have read and studied material prior to the discussion.",
            "That participants use prior knowledge about a topic to add ideas to a collaborative discussion.",
            "That participants use evidence from the information read and studied in order to add ideas to a discussion."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Read or study material prior to collaborative discussion.",
            "Share prior knowledge about topic with peers and/or adults.",
            "Share knowledge read and studied about a topic with peers and adults."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.5.1b",
      "description": "Follow agreed-upon rules for discussions and carry out assigned roles. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That collaborative discussions are conversations with peers and adults in small or large groups.",
            "That rules are important when having discussions.",
            "Make eye contact with the speaker.",
            "Wait until others finish speaking.",
            "Listen for the speaker to pause before speaking.",
            "Be empathic towards others' ideas.",
            "Respectfully agree or disagree.",
            "That rules and assigned roles should be reflected upon/evaluated to ensure engaging and effective discussions.",
            "Assigned roles have specific criteria to follow."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That collaborative discussions are conversations with peers and adults in small or large groups.",
            "That rules are important when having discussions.",
            "Make eye contact with the speaker.",
            "Wait until others finish speaking.",
            "Listen for the speaker to pause before speaking.",
            "Be empathic towards others' ideas.",
            "Respectfully agree or disagree.",
            "That rules and assigned roles should be reflected upon/evaluated to ensure engaging and effective discussions.",
            "Assigned roles have specific criteria to follow."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Make eye contact with the speaker.",
            "Wait until others finish speaking.",
            "Listen for the speaker to pause before speaking.",
            "Be empathic towards others' ideas.",
            "Respectfully agree or disagree.",
            "Carry out assigned roles with the collaborative discussion."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.5.1c",
      "description": "Pose and respond to specific questions by making comments that contribute to the discussion and elaborate on the remarks of others. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Engage, effective, collaborate, discussion, diverse, pose, respond, clarify, remark, participants, ensure, responses, linking, elaborate, extend"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How posing questions during collaborative discussion can enable participants to monitor and understand information being presented.",
            "That questions provoke inquiry and investigations of the topic and/or promote extended thinking.",
            "That specific questions reference the material presented.",
            "How offering comments about others' remarks of the topic promote extended thinking."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How posing and responding to specific questions promotes inquiry and investigation of the topic and/or promotes extended thinking.",
            "How contributing and elaborating on others' remarks of the topic promotes inquiry and investigation of the topic and/or promotes extended thinking.",
            "That specific questions should reference the material presented."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Pose questions to contribute to the discussion.",
            "Listen to others' ideas and be able to \"piggy back\" in an effort to elaborate on the topic or text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.5.1d",
      "description": "Review the key ideas expressed and draw conclusions in light of information and knowledge gained from the discussions. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Prepare, participate, effectively, range, conversations, collaboration, diverse, clearly, persuasively, review, key ideas, understanding, discussion"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That speakers explain the topic using personal ideas, opinions, and reasoning.",
            "Explain the topic by reviewing key ideas.",
            "That personal ideas are based upon prior knowledge of the topic, feelings towards the topic, or thoughts formulated.",
            "That opinions should be concrete with evidence to support the speaker's thoughts.",
            "How reasoning of the topic should be supported with evidence."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That speakers explain the topic using personal ideas, opinions, and reasoning.",
            "Explain the topic by reviewing key ideas.",
            "That personal ideas are based upon prior knowledge of the topic, feelings towards the topic, or thoughts formulated.",
            "That opinions should be concrete with evidence to support the speaker's thoughts.",
            "How reasoning of the topic should be supported with evidence.",
            "How drawing conclusion based on the presentation should be evidence supported."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Listen to others remarks about a text or topic.",
            "Express ideas using personal ideas, opinions, and reasoning based on topics and text.",
            "Link comments to the remarks of others to extend the discussion.",
            "Draw a conclusion based upon knowledge gained from discussions."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.5.3",
      "description": "Summarize the points a speaker makes and explain how each claim is supported by reasons and evidence. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Evaluate, point of view, reasoning, evidence, rhetoric, identify, reasons, provide, points, clarify, diverse media, summarize, explain, claim"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.3",
      "grade": null,
      "description": ". Evaluate a speaker's point of view, reasoning, and use of evidence and rhetoric."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That reasons should support points a speaker makes.",
            "That evidence should support points a speaker makes."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That reasons should support points a speaker makes.",
            "That evidence should support points a speaker makes."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Listen and/or observe text or information presented visually, quantitatively, and/or orally.",
            "Identify the main points a speaker makes.",
            "Identify reasons and evidence a speaker provides to support particular points.",
            "Summarize the points the speaker makes.",
            "Explain how each claim is supported by reasons and evidence."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.5.4",
      "description": "Report on a topic or text or present an opinion, sequencing ideas logically and using appropriate facts and relevant, descriptive details to support main ideas or themes; speak clearly at an understandable pace. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Finding, evidence, line of reasoning, report, topic, recount, experience, facts, relevant, descriptive, details, main idea, themes, pace, opinion, substantial, speaker"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.4",
      "grade": null,
      "description": "Present information, findings, and supporting evidence such that listeners can follow the line of reasoning and the organization, development, and style are appropriate to task, purpose, and audience."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A logical sequence of events is used when reporting on a topic, or text, or recounting an experience.",
            "How recounting an experience should be in presented in an organized manner.",
            "o Sequential",
            "o Chronological",
            "o Compare/Contrast",
            "o Problem/Solution",
            "o Cause/Effect",
            "How determining the appropriate facts that support main ideas or themes and organizing them by using graphic organizers lends itself to an effective reporting of the topic or text.",
            "o Important/Unimportant facts",
            "o Relevant descriptive details",
            "o Visual Organization to enhance understanding of topic"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That ideas are logically sequenced when presenting and opinion about a topic or text.",
            "That appropriate facts and relevant, descriptive details should be provided to support the main idea or theme."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Report on a topic or text in an organized manner.",
            "Present an opinion on a topic or text.",
            "Use appropriate facts and relevant, descriptive details to support the main idea or theme.",
            "Speak clearly at an understandable pace."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.5.5",
      "description": "Include multimedia components (e.g., graphics, sound) and visual displays in presentations when appropriate to enhance the development of main ideas or themes. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Strategic, digital media, visual, displays, enhance, understanding, audio, presentations, development, main idea, details, determine, multimedia components"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.5",
      "grade": null,
      "description": "Make strategic use of digital media and visual displays of data to express information and enhance understanding of presentations."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That audio recordings and visual displays should enhance the information presented, not repeat it.",
            "That fluent reading is an essential element to ensure an engaging recording.",
            "The audio recording and visual display should enhance the main idea and theme.",
            "How using supporting evidence contributes to the understanding of the main idea and theme.",
            "A theme is the central idea the author is trying to convey.",
            "o Understanding the characters' actions, interactions, and motivations and events contribute to the theme of the story."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That graphics and sound should enhance the information presented, not repeat it.",
            "That graphics and sound should enhance the main idea and theme.",
            "A theme is the central idea the author is trying to convey.",
            "How understanding the characters' actions, interactions, and motivations and events contribute to the theme of the story."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "View examples of multimedia components.",
            "Create presentations using graphics and sound to enhance the main idea or theme.",
            "Create or construct visual displays to enhance the development of the main idea or theme."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.5.6",
      "description": "Adapt speech to a variety of contexts and tasks, using formal English when appropriate to task and situation. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Differentiate, context, situations, formal English, informal English, discourse, task, situation, polysyllabic, colloquial, jargon, dialect"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.6",
      "grade": null,
      "description": "Adapt speech to a variety of contexts and communicative tasks, demonstrating command of formal English when indicated or appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That formal or informal language can be present in reading and writing.",
            "That formal language is less personal and is often factual and straight-to-the-point.",
            "That informal language is friendly and conversational.",
            "That both formal and informal language are considered acceptable in certain situations.",
            "That formal English should be used when presenting ideas to an audience.",
            "That informal language or discourse should be used when small groups meet to discuss a topic."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That formal or informal language can be present in reading and writing.",
            "That formal language is less personal and is often factual and straight-to-the-point.",
            "That informal language is friendly and conversational.",
            "That both formal and informal language are considered acceptable in certain situations.",
            "That formal English should be used when presenting ideas to an audience.",
            "That informal language or discourse should be used when small groups meet to discuss a topic.",
            "That speakers must learn to differentiate and adapt speech to match the task and situation."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the situation in which language is being utilized.",
            "Adapt speech to formal English if factual ideas are being presented to an audience.",
            "Adapt speech to informal discourse if small groups are meeting to discuss a topic."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Differentiate",
        "context",
        "situations",
        "formal English",
        "informal English",
        "discourse",
        "task",
        "situation",
        "polysyllabic",
        "colloquial",
        "jargon",
        "dialect"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.1a",
      "description": "Explain the function of conjunctions, prepositions, and interjections in general and their function in particular sentences. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, explain, function, conjunctions, prepositions, interjections, contribute"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How using standard grammar and usage when writing and speaking lends itself to more effective products and understanding of the product.",
            "A conjunction is a word that joins other words or parts of a sentence together.",
            "How coordinating conjunction joins words, phrases, and sentences (independent clauses) together.",
            "A subordinating conjunction joins a dependent clause to an independent clause.",
            "A preposition links nouns, pronouns, and phrases to other words in a sentence.",
            "An interjection is a word added to a sentence to convey emotion."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That conjunctions join words, phrases, and sentences together.",
            "That prepositional phrases can function as an adjective or adverb.",
            "That adjective phrases modify a noun or pronoun.",
            "That adverb phrases modify an adjective, adverb, or verb.",
            "The word or phrase that the preposition introduces is called the",
            "That interjections are usually followed by an exclamation point.",
            "That interjections are considered formal language when used in direct quotes."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify conjunctions, prepositions, and interjections in mentor text.",
            "Explain the function of conjunctions, prepositions, and interjections in mentor text.",
            "Identify conjunctions, prepositions, and interjections in during peer editing.",
            "Compose sentences with conjunctions, prepositions, and interjections in mentor text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.1b",
      "description": "Form and use the perfect (e.g., I had walked; I have walked; I will have walked) verb tenses. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, explain, function, verb, writing, speaking"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How using standard grammar and usage when writing and speaking lends itself to more effective products and understanding of the product.",
            "That verbs convey a sense of past, present, and future.",
            "That some verbs are in irregular form and will be in the form of past-tense or past-participle."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That verbs convey a sense of past, present, and future.",
            "That perfect verb tenses show action already completed.",
            "o Present perfect tense (has/have) describes an action that happened at a time in the past or that began in the past and continues to happen",
            "o Past perfect tense (had) describes an action that took place before another past action.",
            "o Future perfect tense (will have) describes an action that will happen in the future."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify perfect verb tense in mentor text.",
            "Identify the specific time the verb is referencing.",
            "Compose a sentence with present perfect, past perfect, and future perfect.",
            "Use present perfect, past perfect, and future perfect when speaking."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.1c",
      "description": "Use verb tense to convey various times, sequences, states, and conditions. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, explain, function, verbs, times, sequence, conditions, past tense, present tense, future tense"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How using standard grammar and usage when writing and speaking lends itself to more effective products and understanding of the product.",
            "That verbs convey a sense of time by telling about the past, present, and future."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That verbs convey a sense of time by telling about the past, present, and future (e.g., walked, walks, will walk).",
            "That action verbs show what someone or something is doing (e.g. sings, runs, climbs).",
            "That linking verbs show the state of the subject (is, are, feel, seems).",
            "That helping verbs are often referred to as conditional verbs. These verbs show the condition of the subject (could, should, would)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify a verb in mentor text.",
            "Identify the purpose of the verb.",
            "Compose a sentence for the purpose of using a verb to express time, sequence, state, or condition."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.1d",
      "description": "Recognize and correct inappropriate shifts in verb tense. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, explain, function, verbs, narrate, explain, describe, consistent, recognize, inappropriate"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How using standard grammar and usage when writing and speaking lends itself to more effective products and understanding of the product.",
            "That verbs convey a sense of time by telling about the past, present, and future."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to use the exact tense needed to describe, narrate, or explain.",
            "How to use the context to make sure any shifts in verb tense are appropriate.",
            "How not to switch from one tense to another unless the timing of an action demands that you do.",
            "How to keep verb tense consistent in sentences, paragraphs, and essays."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Recognize and correct inappropriate shifts in verb tense.",
            "o Use present tense when writing essays about one's own idea, factual topics, and the action in a specific play or book.",
            "o Use past tense when writing essays about past events or findings.",
            "o Use future tense when writing about an event that will occur in the future."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.1e",
      "description": "Use correlative conjunctions (e.g., either/or, neither/nor). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, explain, function, conjunctions, parallel, grammatical, correlative"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That conjunctions are words that join or link other words, phrases, and clauses within a sentence."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That correlative conjunctions are pairs of words that join or link other words, phrases, and clauses.",
            "The use of correlative conjunctions dictates special subject-verb agreement rules.",
            "That when using either/or or neither/nor, the subject closest to the verb determines the verb form. If the subject closest to the verb is singular, the verb takes the singular form. If the subject closest to the verb is plural, the verb takes the plural form.",
            "That when using both/and, the verb is always plural."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the use of correlative conjunctions in mentor text.",
            "Identify the correct usage of subject-verb agreement with correlative conjunctions.",
            "Use correct subject-verb agreement with either/or or neither/not.",
            "Use correct subject/verb agreement with both/and."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.2a",
      "description": "Use punctuation to separate items in a series. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That commas and quotation marks to are used to mark direct speech and quotations from a text.",
            "That commas are used before a coordinating conjunction in a compound sentence. Commas are used to separate parts of a sentence.",
            "That commas tell readers to pause between words or groups of words, and they help clarify the meanings of sentences."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That commas are used to separate three or more words, phrases, or clauses in a series.",
            "o Words in a series: To make her famous muffins, Paulette bought fresh broccoli, baker's chocolate, flour, sugar, and eggs.",
            "o Phrases in a series: When Harold saw his mother Gloria across the crowded airport, he sprinted toward her, leaping over luggage, colliding with travelers, and dodging potted palms.",
            "o Clauses in a series: Whenever thunder booms, whenever strangers knock on"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify an item in a series situation in mentor text.",
            "Explain why the writer used commas in specific places.",
            "Compose a sentence with words in a series.",
            "Compose a sentence with phrases in a series.",
            "Compose a sentence with clauses in a series.",
            "Compose a sentence suing a semicolon to punctuate items in a series."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.2b",
      "description": "Use a comma to separate an introductory element from the rest of the sentence. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, capitalization, commas, introductory elements, adverbial participial, infinitive phrases, prepositional phrases."
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That commas are used to separate parts of a sentence.",
            "That they tell readers to pause between words or groups of words, and they help clarify the meanings of sentences."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That commas are used after an introductory dependent clause.",
            "An introductory dependent clause is a group of words before the subject of a sentence. It does not form a complete sentence.",
            "That commas are used to set off introductory words, introductory adverbial and longer introductory prepositional phrases.",
            "That commas are used to separate a longer prepositional phrase from the rest of the sentence."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify an introductory element in a mentor text.",
            "Identify the type of introductory element.",
            "Compose a sentence using a comma to separate an adverbial clause from an independent clause.",
            "Compose a sentence using a comma to separate a longer prepositional phrase."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.2c",
      "description": "Use a comma to set off the words yes and no (e.g., Yes, thank you), to set off a tag question from the rest of the sentence (e.g., It's true, isn't it?), and to indicate direct address (e.g., Is that you, Steve?). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, capitalization, comma, introductory, tag question, direct address"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That commas are used to separate parts of a sentence.",
            "That they tell readers to pause between words or groups of words, and they help clarify the meanings of sentences."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A comma is used to set off the words yes and no as introductory elements.",
            "A comma is used to set off a tag question as an introductory element from the rest of the sentence.",
            "A comma is used to set off words in a direct address."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the usage of use of commas to set off the words yes and no in a mentor text.",
            "Identify the usage of commas to set off a tag question in a mentor text.",
            "Identify the usage of commas to indicate a direct address in a mentor text.",
            "Use a comma to set off the words yes and no, a tag question, and a direct address."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.2d",
      "description": "Use underlining, quotation marks, or italics to indicate titles of works. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, capitalization, underlining, quotations marks, italics"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That correct punctuation is essential for clear and effective writing."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That quotation marks set off the titles of songs, poems, articles from newspapers or magazines, chapters, episodes on a television show, and short stories.",
            "That titles of books, magazines, newspapers, movies, performances such as plays and musicals, albums, and artwork should be underlined or italicized."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify titles of work in mentor text.",
            "Identify the types of works that should be set off with quotation marks.",
            "Identify the types of works that should be underlined or italicized.",
            "Use underlining, quotation marks, or italics to indicate titles of work."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.2e",
      "description": "Spell grade-appropriate words correctly, consulting references as needed. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, command, conventions, grammar, usage, capitalization, grade-appropriate, consult, references, guidewords, parenthesis, clarify, dictionary, thesaurus"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to use reference materials to check and correct spellings.",
            "A dictionary is a reference material that lists words in alphabetical order and gives the meaning of the word.",
            "That glossaries and digital dictionaries are used to clarify the correct spelling of words."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to carefully consider the meaning of the word when deciding upon the correct spelling."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Recognize words that are not spelled correctly.",
            "Clarify the correct spelling of the word by using a dictionary or other appropriate reference material (Glossary, Digital dictionary)."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Knowledge of Language",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.3a",
      "description": "Expand, combine, and reduce sentences for meaning, reader/listener interest, and style. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.3",
      "grade": null,
      "description": "Apply knowledge of language to understand how language functions in different contexts, to make effective choices for meaning or style, and to comprehend more fully when reading or listening."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A sentence is a group of words that expresses a complete thought. It contains at least one subject and one verb.",
            "A complete thought is often referred to as an independent clause.",
            "That effective sentences create clear communication.",
            "That sentences can be combined to create one sentence.",
            "A simple sentence contains one independent clause.",
            "A compound sentence contains two independent clauses joined by a coordinating conjunction.",
            "A complex sentence contains an independent clause joined and one dependent clause"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How adding information and details can expand sentences.",
            "That language descriptors such as adjectives, adverbs, and prepositional phrases are used to expand sentences and make them more meaningful.",
            "How to combine sentences by forming compound and complex sentences.",
            "That sentences can be reduced or shortened when necessary to create a desired effect.",
            "That sentences must be interesting to the reader and the listener."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Recognize sentences that need to be expanded, combined, and/or reduced for meaning, reader/listener interest, and style.",
            "Expand sentences by adding adjectives, adverbs, and prepositional phrases.",
            "Combine sentences by composing compound sentences.",
            "Combine sentences by composing complex sentences.",
            "Reduce sentences by omitting ideas that are unimportant, off-topic, or uninteresting."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Knowledge of Language",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.3b",
      "description": "Compare and contrast the varieties of English (e.g., dialects, registers) used in stories, dramas, or poems. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Apply, language, understand, function, contexts, effective, style, comprehend, phrases, effect, compare, contrast, dialect, registers"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.3",
      "grade": null,
      "description": "Apply knowledge of language to understand how language functions in different contexts, to make effective choices for meaning or style, and to comprehend more fully when reading or listening."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That people speak and write differently depending on the situation.",
            "That formal or informal language can be present in reading and writing.",
            "That formal language is less personal and is often factual and straight-to-the-point.",
            "That informal language is friendly and conversational."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That both formal and informal English may vary in dialect and register.",
            "That geographical location can affect the vocabulary, pronunciation, and grammar used by writers.",
            "That dialect refers to regional difference in language.",
            "That register refers to the way language is used in different contexts, or situations, when speaking or writing."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify the geographical location and dialect of the English used in stories, dramas, or poems.",
            "Identify the context or situation in which the English is used in stories, dramas, or poems.",
            "Compare and contrast the dialects used in stories, dramas, or poems.",
            "Compare and contrast the register or situation in which English is used in stories, dramas, or poems.",
            "Use a variety of dialect and register when writing and speaking."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.4a",
      "description": "Use context (e.g., cause/effect relationships and comparisons in text) as a clue to the meaning of a word or phrase. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Determine, clarify, context, clue, signal words, investigate, compare, contrast, cause and effect, determine"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How investigating the text closer is an effective strategy to deterring the meanings of unknown words or phrases.",
            "That clues to unfamiliar words can often be determined by definitions.",
            "o Definition context clues: writer uses an unfamiliar word and then explains what it means in the next sentence or two.",
            "o Some context clues restate the meaning of a word in another way.",
            "o Restatements are often introduced by commas or dashes and by words and phrases such as or, that is, or in other words."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How investigating the text closer is an effective strategy to deterring the meanings of unknown words or phrases.",
            "That signal words are often used in cause/effect relationships such as because, so that, and in order to.",
            "That signal words are often used in compare and contrast relationships such as like, unlike, but, not, in contrast to, and in the same way."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify an unknown or multiple-meaning word in a mentor text.",
            "Read the text closely to understand the context.",
            "Look for a definition, example, or restatement clue.",
            "Using the clue, state the meaning of the unknown word."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.4b",
      "description": "Use common, grade-appropriate Greek and Latin affixes and roots as clues to the meaning of a word (e.g., photograph, photosynthesis). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Determine, clarify, multiple-meaning, phrases, analyzing, determine, affix, prefix, suffix, strategies, understand, commonly, root word"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Common Greek and Latin affixes and roots.",
            "A prefix the prefix does one of three things: it gives a word direction, negates a word by meaning \"not,\" or intensifies the meaning of a word by adding the notion of \"very.",
            "A suffix comes at the end of the word."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to recognize common Greek and Latin affixes and roots.",
            "A prefix the prefix does one of three things: it gives a word direction, negates a word by meaning \"not,\" or intensifies the meaning of a word by adding the notion of \"very.",
            "A suffix comes at the end of the word.",
            "An effective strategy for determining the meaning of an unknown word is to identify the Greek or Latin affix or root of the word."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify an unknown and/or a multiple-meaning word in a mentor text.",
            "Break a word into parts: prefix, root, suffix.",
            "Identify the meaning of the Greek and/or Latin affix and/or root.",
            "Apply the meaning of the Greek and/or Latin affix and/or root to the unknown word.",
            "State the meaning of the unknown word."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.4c",
      "description": "Determine or clarify the meaning of unknown and multiple-meaning word and phrases based on grade 5 reading and content, choosing flexibly from a range of strategies. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown and multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That glossaries or beginning dictionaries, both print and digital, aid students with determining or clarifying the precise meaning of key words and phrases.",
            "That glossaries and beginning dictionaries come in print or digital form on the computer.",
            "A glossary is a list of specialized terms with definitions.",
            "That glossaries are commonly found at the backs of books to help readers understand terms, which may be unfamiliar.",
            "A beginning dictionary offers early readers definitions and illustrative sentences.",
            "A thesaurus is a"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That glossaries or beginning dictionaries, both print and digital, aid students with determining or clarifying the precise meaning of key words and phrases.",
            "That glossaries and beginning dictionaries come in print or digital form on the computer.",
            "A glossary is a list of specialized terms with definitions.",
            "That glossaries are commonly found at the backs of books to help readers understand terms, which may be unfamiliar.",
            "A beginning dictionary offers early readers definitions and illustrative sentences.",
            "A thesaurus is a"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify an unknown or multiple-meaning word and/or phrase.",
            "Use a print or digital glossary to determine or clarify the meaning of an unknown word and/or phrase.",
            "Use a print or digital beginning dictionary to determine or clarify the meaning of an unknown word and/or phrase.",
            "Use a thesaurus to find a word that has a similar and/or contrasting meaning."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.5a",
      "description": "Interpret figurative language, including similes and metaphors, in context. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Determine, clarify, multiple-meaning, phrases, analyzing, determine, interpret, context, figurative language, simile, metaphor, vivid, entertaining"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That writers use similes and metaphors to explain things, to express emotion, and to make their writing more vivid and entertaining.",
            "A simile is a comparison between two things that are generally not alike.",
            "A simile is usually introduced by like or as",
            "A metaphor is a figurative comparison, but these are implied rather than introduced by like or as."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That writers use similes and metaphors to explain things, to express emotion, and to make their writing more vivid and entertaining.",
            "A simile is a comparison between two things that are generally not alike.",
            "A simile is usually introduced by like or as",
            "A metaphor is a figurative comparison, but these are implied rather than introduced by like or as."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify nonliteral language in a mentor text.",
            "Identify the type of nonliteral language as functioning as a simile or a metaphor.",
            "Explain the meaning of the simile or metaphor as it is used in the context.",
            "Use a simple simile or metaphor in writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.5b",
      "description": "Recognize and explain the meaning of common idioms, adages, and proverbs. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Demonstrate, relationship, nuance, recognize, explain, idioms, adage, proverb, synonymous, literal, nonliteral"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That idioms, adages, and proverbs are types of common expressions and sayings.",
            "An idiom is a phrase that means something different from its literal meaning (e.g., After he was cut by the team, he turned over a new leaf and started working out.).",
            "An adage is a well-known proverb that has been used for a long time (e.g., If the shoe fits, wear it).",
            "A proverb is a statement of practical wisdom expressed in a simple way (e.g. An apple a day keeps the doctor away)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That idioms, adages, and proverbs are types of common expressions and sayings.",
            "An idiom is a phrase that means something different from its literal meaning (e.g., After he was cut by the team, he turned over a new leaf and started working out.).",
            "An adage is a well-known proverb that has been used for a long time (e.g., If the shoe fits, wear it).",
            "A proverb is a statement of practical wisdom expressed in a simple way (e.g. An apple a day keeps the doctor away)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify nonliteral language in a mentor text.",
            "Identify the type of nonliteral language as an idiom, adage, or proverb.",
            "Explain the meaning of the idiom, adage, or proverb.",
            "Use an idiom, adage, or proverb in writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.5c",
      "description": "Use the relationship between particular words (e.g., synonyms, antonyms, homographs) to better understand each of the words. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That nouns, verbs, adjectives, adverbs and prepositions can have a synonym as long as both words are the same part of speech.",
            "That often words will have more than one antonym but as with synonyms it depends on the context.",
            "That synonyms are words that have the same or very similar meaning",
            "That antonyms are words that have opposite meanings.",
            "A thesaurus is a reference material that is useful to consult when identifying a synonym or antonym.",
            "That synonyms are words that have the same or very similar meaning",
            "That antonyms are words that have opposite meanings."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That nouns, verbs, adjectives, adverbs and prepositions can have a synonym as long as both words are the same part of speech.",
            "That often words will have more than one antonym but as with synonyms it depends on the context.",
            "That synonyms are words that have the same or very similar meaning",
            "That antonyms are words that have opposite meanings.",
            "A thesaurus is a reference material that is useful to consult when identifying a synonym or antonym.",
            "That synonyms are words that have the same or very similar meaning",
            "That antonyms are words that have opposite meanings."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify a noun, verb, adjective, adverb, or preposition in a mentor text.",
            "Utilize a thesaurus to identify a synonym, or antonym for the word.",
            "Utilize context clues to determine the pronunciation and meaning of a homograph.",
            "Compose a sentence to demonstrate an understanding of two words that have a similar meaning (synonym).",
            "Compose a sentence to demonstrate an understanding of two words that have opposite meanings (antonyms).",
            "Compose multiple sentences to demonstrate knowledge of multiple uses of a homograph."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "5",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.5.6",
      "description": "Acquire and use accurately grade-appropriate general academic and domain-specific words and phrases, including those that signal contrast, addition, and other logical relationships (e.g., however, although, nevertheless, similarly, moreover, in addition). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD Acquire, accurate, appropriate, conversational, spatial, temporal"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.6",
      "grade": null,
      "description": "Acquire and use accurately grade-appropriate conversational, general academic, and domain specific words and phrases, including those that signal spatial and temporal relationships (e.g., After dinner that night we went looking for them)."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That general academic words are words that are found more often in written texts across disciplines. These words can appear in informational, technical, or literary text.",
            "That general academic words signal precise actions, emotions, or states of being (e.g., quizzed, whined, stammered).",
            "That domain specific words are words found more often in written texts within a specific discipline.",
            "That domain-specific words are basic to a particular topic (e.g., wildlife, conservation, and endangered when discussing animal preservation.)"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That academic and domain-specific words can signal contrast (e.g., however, although, nevertheless).",
            "That academic and domain-specific words can signal addition (e.g. similarly, moreover, in addition).",
            "That academic and domain-specific words can signal other logical relationships (e.g., To begin with, About the same time, Prior to)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify general academic and domain specific words in mentor text.",
            "Acquire and use general academic and domain specific words.",
            "Acquire and use specific words and phrases that signal contrast.",
            "Acquire and use words that signal addition.",
            "Acquire and use words that signal logical relationships."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  }
]