[
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.6.1",
      "description": "Cite textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.1",
      "grade": null,
      "description": "Read closely to determine what the text says explicitly and to make logical inferences from it; cite specific textual evidence when writing or speaking to support conclusions drawn from the text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to focus closely and critically on content in a literary text.",
            "How to form a comprehensive understanding or analysis of what they are reading and for selecting key evidence for use in writing or speaking.",
            "How to refer directly to details and examples in a text and/or quote accurately from a text when explaining what happens in the text.",
            "How to refer directly to details and examples in a text and/or quote accurately from a text when drawing inferences from a text.",
            "What it means to draw inferences from a text.",
            "How to ask and answer questions to demonstrate"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors purposely include specific details and/or examples in literary texts and/or omit specific details and/or examples from literary texts to prompt students to ask and answer questions about the text.",
            "Details and examples authors provide in a literary text reveal meaning.",
            "Authors state information explicitly in a text to allow students to make a direct connection and/or implicitly to require students to draw inferences from a text.",
            "Authors provide evidence to support an analysis of what the text says explicitly and/or to support an analysis of inferences drawn from the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, and annotate a literary text to comprehend what the author says explicitly and to discover the levels of meaning embedded deeply within complex literary texts.",
            "Conduct self-checks to ensure comprehension of a literary text, persevere through difficult sections, examine unfamiliar words or phrases and attempt to uncover the meaning of unknown words.",
            "Cite evidence from the text in the form of specific details or examples to support an analysis of what the text says explicitly.",
            "Cite evidence from the text in the form of specific details or examples to support an"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.6.3",
      "description": "Describe how the plot of a literary text unfolds in a series of episodes as well as how the characters respond or change as the plot moves toward a resolution. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: describe, literary text, how characters respond, how characters change, story elements, plot structure, exposition, rising action, conflict, climax, turning point, falling action, solution, resolution, characterization, archetypes, drama elements, unfold, episodes, events"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.3",
      "grade": null,
      "description": "Analyze how and why individuals, events, or ideas develop and interact over the course of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Characters in a literary text interact through dialogue and actions.",
            "How to compare and contrast two or more characters, settings, or events, citing specific details from a literary text.",
            "How to describe in detail a character, setting, or event, citing specific evidence from a literary text.",
            "Students can describe characters and explain how the characters' traits, motivations, or feelings contribute to the events in a literary text.",
            "Students can describe how characters respond to major events and challenges using key details from a literary text.",
            "Students can explain how key events advance the plot of a literary text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A plot of a story consists of the exposition, rising action, conflict, climax, turning point, falling action, and solution/resolution.",
            "Authors develop a character using direct and/or indirect characterization through description of a character's appearance, dialogue, thoughts, actions, reactions, interactions, and behaviors.",
            "A character responds or changes based on interactions with other characters, the setting, the conflict, the resolution, and other events of the story.",
            "Authors often develop characters using general literary archetypes."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, and annotate a literary text for evidence of the plot's development.",
            "Closely read, analyze, and annotate a literary text for evidence of how characters respond as the plot unfolds.",
            "Closely read, analyze, and annotate a literary text for evidence of how characters change as the plot unfolds.",
            "Provide a description of how a particular literary text's plot unfolds in a series of episodes towards a resolution.",
            "Provide a description of how the characters respond over the course of a text.",
            "Provide a description of how the characters change over the course of a text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "describe",
        "literary text",
        "how characters respond",
        "how characters change",
        "story elements",
        "plot structure",
        "exposition",
        "rising action",
        "conflict",
        "climax",
        "turning point",
        "falling action",
        "solution",
        "resolution",
        "characterization",
        "archetypes",
        "drama elements",
        "unfold",
        "episodes",
        "events"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.6.4",
      "description": "Determine the meaning of words and phrases as they are used in a text, including figurative and connotative meanings; analyze the impact of a specific word choice on meaning and tone. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.4",
      "grade": null,
      "description": "Interpret words and phrases as they are used in a text, including determining technical, connotative, and figurative meanings, and analyze how specific word choices shape meaning or tone."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to use context clues to determine what a word means in a given context.",
            "Figurative language uses words in some way other than their literal meanings to make a comparison, add emphasis, or say something in a fresh and creative way.",
            "A metaphor compares two unlike things to illuminate a particular quality or aspect of one of the two things. Metaphors directly state that one thing is something else and do not use the words like or as.",
            "A simile compares two unlike things using like or as to illuminate a particular quality or aspect of one of the two things.",
            "An exaggeration is an extravagant statement that is not meant to be taken literally.",
            "Students know that some words used by authors allude to"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "What a word means in a given context, focusing on what the author is trying to do with the language.",
            "Tone is the author's attitude toward the audience, the subject, or the character. Tone is conveyed through the author's words and details.",
            "Mood is the emotions the reader feels while reading a text. Mood is created by the author's word choice, imagery, dialogue, setting, and plot.",
            "Readers determine tone and mood of a text through clues presented in the text.",
            "Tone or mood may change throughout a text. In effect, a text can have more than one tone or mood."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze and annotate a text for evidence of the meanings of words and phrases as they are used in a text.",
            "Closely read, analyze, and annotate a text for evidence of the impact of a specific word choice on meaning and tone.",
            "Determine the meaning of words and phrases based on context.",
            "Determine the figurative meaning of particular words and phrases based on context.",
            "Determine the connotative meaning of particular words and phrases based on context.",
            "Explain the differences between words and phrases with similar denotative meanings that carry different connotations (e.g.,"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.6.5",
      "description": "Analyze how a particular sentence, chapter, scene, or stanza fits into the overall structure of a text and contributes to the development of the theme, setting, or plot. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.5",
      "grade": null,
      "description": "Analyze the structure of texts, including how specific sentences, paragraphs, and larger portions of the text (e.g., a section, chapter, scene, or stanza) relate to each other and the whole."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to explain how specific chapters fit together to provide the overall structure of a story, specific scenes fit together to provide the overall structure of a drama, and specific stanzas fit together to provide the overall structure of a poem.",
            "The structural elements of poems, dramas, and prose and can refer to specific elements in writing and speaking.",
            "How to describe how each successive part of a poem, drama, or story builds on earlier sections."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Writers purposely include specific sentences, chapters, scenes, or stanzas that contribute to the development of the theme, setting, or plot.",
            "Knowledge of common narrative structure provides support for organizing the ideas and deepening understanding of the text.",
            "Common narrative structure follows the elements of plot: exposition, rising action, climax, falling action, resolution.",
            "Stories may be presented through common narrative structure, through common narrative structure without conflict, with flashbacks, through multiple character"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze. and annotate a text for evidence of how a particular sentence, chapter, scene, or stanza fits into the overall structure of a text.",
            "Closely read, analyze, and annotate a text for evidence of how a particular sentence, chapter, scene, or stanza contributes to the development of the theme.",
            "Closely read, analyze, and annotate a text for evidence of how a particular sentence, chapter, scene, or stanza contributes to the development of the setting.",
            "Closely read, analyze, and annotate a text for evidence of how a particular sentence, chapter, scene, or stanza"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.6.6",
      "description": "Explain how an author develops the point of view of the narrator or speaker in a text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.6",
      "grade": null,
      "description": "Assess how point of view or purpose shapes the content and style of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A narrator or speaker's point of view influences how events are presented and affects the information revealed about the characters and events.",
            "How to distinguish their own point of view from that of the narrator's point of view or other characters' point of view.",
            "Point of view is the perspective from which the story is presented.",
            "There are three major types of point of view: first person, second person, and third person.",
            "Third person point of view consists of three differing forms: third person omniscient, third person limited, and third person objective."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors develop point of view through author's style, tone, word choice, description, dialogue, thoughts, reflection, author or narrator commentary, illustrations.",
            "Authors can direct readers' attention to the exact detail, opinion, or emotion the author wants to stress by manipulating the point of view of the story.",
            "The ways in which an author's point of view influences content and style.",
            "An author's writing is influenced by his experiences, background, and values.",
            "Authors use different points of view to offer different perceptions and to develop a"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, and annotate a text for evidence of how an author develops the point of view of the narrator or speaker in a text.",
            "Provide an explanation of how an author develops the point of view of the narrator or speaker in a text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.6.7",
      "description": "Compare and contrast the experience of reading a story, drama, or poem to listening to or viewing an audio, video, or live version of the text, including contrasting what they \"see\" and \"hear\" when reading the text to what they perceive when they listen or watch. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.7",
      "grade": null,
      "description": "Integrate and evaluate content presented in diverse media and formats, including visually and quantitatively, as well as in words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to describe the differences in a written story or drama and a performed story or drama.",
            "How to explain how a performed story or drama represents the written story or drama.",
            "Visual and multimedia elements contribute to the meaning, tone, or beauty of a text.",
            "How to make connections between the text of a story or drama and a visual or oral presentation of the same story or drama, noting where each version reflects specific descriptions and directions in the text.",
            "How to show how a text's illustrations contribute to"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Literacy includes the written text and the audio, video, and live versions of a text.",
            "The importance of focusing not only on what we learn about the characters in the different formats but also on how the information is presented.",
            "Performed versions of texts affect audiences differently than the printed version.",
            "Suspense may be greater in the written or performed version of the text.",
            "To compare and contrast, they must show both similarities and differences."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze. and annotate a text for evidence to use in comparing and contrasting reading a literary text to listening or viewing an audio, video, or live version of the same text.",
            "Provide a comparison and contrast of reading a story, drama, or poem to listening to or viewing an audio, video, or live version of the text, including contrasting what they \"see\" and \"hear\" when reading the text to what they perceive when they listen or watch.",
            "Provide a contrast of reading a story, drama, or poem to listening to or viewing an audio, video, or live version of the text, including contrasting what they \"see\""
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.6.8",
      "description": "Not applicable to literature. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD:"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.8",
      "grade": null,
      "description": "Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as the relevance and sufficiency of the evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": []
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": []
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": []
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.6.9",
      "description": "Compare and contrast texts in different forms or genres (e.g., stories and poems; historical novels and fantasy stories) in terms of their approaches to similar themes and topics. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to compare and contrast how stories within a particular genre deal with similar themes and topics.",
            "Common literary character archetypes (e.g., the hero, the mother figure, the innocent youth, the doppelganger, the villain, the scapegoat) are often used by authors to develop characters.",
            "Similar themes, topics, and patterns of events are found in stories, myths, and traditional literature from different cultures.",
            "Authors often continue writing about characters they have developed through books in a series. Within a"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Multiple texts in different literary genres may address similar themes or topics.",
            "Reading multiple literary texts addressing a similar theme or topic exposes them to multiple perspectives and points of view.",
            "A specific genre influences the way information is presented in a text.",
            "How to describe and analyze aspects of the setting to explain how the setting affects the plot and characters.",
            "Authors use situational literary archetypes in a variety of literary genres (e.g., journey, the initiation, good vs. evil, the fall)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, and annotate a text for evidence to use in comparing and contrasting approaches to similar themes and topics in texts of different forms or genres.",
            "Provide a comparison and contrast of texts in different forms or genres (e.g., stories and poems, historical novels and fantasy stories) in terms of their approaches to similar themes and topics."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Literature",
    "reporting_category": "Range of Reading and Level of Text Complexity",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.6.10",
      "description": "By the end of the year, read and comprehend literature, including stories, dramas, and poems, in the grades 6-8 text complexity band proficiently, with scaffolding as needed at the high end of the range. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: comprehend, stories, dramas, poems, scaffolding, complexity band, proficiently, range"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.10",
      "grade": null,
      "description": "Read and comprehend complex literary and informational texts independently and proficiently."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to explain how knowing the differences between different genres (e.g., short stories, poetry, drama) based on their characteristics and structural elements aids in comprehension of complex text.",
            "How to make and check predictions.",
            "How to note important parts of a story."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The complexity of text increases as students progress through grade levels.",
            "The importance of knowing the specific characteristics of different forms of literary texts (e.g., adventure stories, historical fiction, mystery, myths, science fiction, realistic fiction, allegory, parody, satire, drama, graphic novel, play, poetry, sonnet, ode, ballad, epic) aids in comprehension of complex texts."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, comprehend, and annotate literary texts of increasing complexity within the Lexile range of 955-1155 for the purpose of comprehension.",
            "Monitor and adjust comprehension of a literary text by recognizing when understanding becomes unclear and applying corrective strategies automatically, including summarizing, paraphrasing, reviewing previous points, making connections to other texts and prior knowledge, determining word- and sentence-level meaning of confusing passages, and applying skills from across the language arts.",
            "Use knowledge of the characteristics of different forms of literary texts to aid in comprehension of text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "comprehend",
        "stories",
        "dramas",
        "poems",
        "scaffolding",
        "complexity band",
        "proficiently",
        "range"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.6.1",
      "description": "Cite textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.1",
      "grade": null,
      "description": "Read closely to determine what the text says explicitly and to make logical inferences from it; cite specific textual evidence when writing or speaking to support conclusions drawn from the text"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to focus closely and critically on content in an informational text.",
            "How to form a thorough understanding or analysis of what they are reading and for selecting key evidence for use in writing or speaking.",
            "How to refer directly to details and examples in a text and/or quote accurately from a text when explaining what a text is about.",
            "How to refer directly to details and examples in a text and/or quote accurately from a text when drawing inferences from a text.",
            "What it means to draw inferences from a text.",
            "How to ask and answer questions to demonstrate understanding of a text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors purposely include specific details and/or examples in informational texts and/or omit specific details and/or examples from informational texts to prompt students to ask and answer questions about the text.",
            "Details and examples authors provide in an informational text reveal meaning.",
            "Authors state information explicitly in a text to allow students to make a direct connection and/or implicitly to require students to draw inferences from a text.",
            "Authors provide evidence to support an analysis of what the text says explicitly and/or to support an analysis of"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read and analyze an informational text to comprehend what the author says explicitly and to discover the layers of meaning that are often embedded within complex informational texts.",
            "Conduct self-checks to ensure comprehension of an informational text, persevere through difficult sections, examine unfamiliar words or phrases and attempt to uncover the meaning of unknown words.",
            "Cite evidence from the text in the form of specific details or examples to support an analysis of what the text says explicitly.",
            "Cite evidence from the text in the form of specific details or examples to support an"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.6.3",
      "description": "Analyze in detail how a key individual, event, or idea is introduced, illustrated, and elaborated in a text (e.g., through examples or anecdotes). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.3",
      "grade": null,
      "description": "Analyze how and why individuals, events, or ideas develop and interact over the course of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to explain the relationships or interactions between two or more individuals, events, ideas based on specific information in the text.",
            "How to explain the relationships or interactions between two or more concepts in a historical, scientific, or technical text based on specific information in the text.",
            "How to explain procedures in a historical, scientific, or technical text, including what happened and why, based on specific information in the text.",
            "How to describe the relationship between a series of historical events, scientific ideas or concepts, or steps in"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Understand how causal relationships between events, individuals, and ideas are introduced and developed in an informational text.",
            "Illustrate means to explain, describe, or give example of an individual, event, or idea.",
            "Elaborate means to provide more details about an individual, event, or idea or to further develop an individual, event, or idea.",
            "An example is something that is mentioned in a text to help explain, illustrate or clarify a concept for readers.",
            "An anecdote is a short narrative that is often presented in an informational text to assist"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read and analyze an informational text for evidence to show how a key individual, event, or idea is developed throughout the text.",
            "Analyze and annotate a text for how an individual, event, or idea is introduced in a text.",
            "Provide a detailed analysis of how a key individual, event or idea is introduced in a text (e.g., through examples and anecdotes)",
            "Analyze and annotate a text for how an individual, event, or idea is illustrated (e.g., explained, described) in a text.",
            "Provide detailed analysis of how a key individual, event or idea is illustrated in a text"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.6.4",
      "description": "Determine the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: determine, meaning, figurative language, connotative meanings, technical meanings, simile, metaphor, exaggeration/hyperbole, personification"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.4",
      "grade": null,
      "description": "Interpret words and phrases as they are used in a text, including determining technical, connotative, and figurative meanings, and analyze how specific word choices shape meaning or tone."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to determine the meaning of general academic and domain-specific words and phrases in a text.",
            "A metaphor is a direct comparison of two unlike things.",
            "A simile is a comparison of two unlike things using the word like or as.",
            "An exaggeration describes something as being greater, larger, more important, etc., than it really is."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "What a word means in a given context, focusing on what the author is trying to do with the language.",
            "Authors often use figurative language to assist in developing the tone or mood of a text.",
            "Authors purposely choose words to achieve particular effects in a text and in the reader.",
            "Authors purposely use figurative language to achieve particular effects in a text and in the reader.",
            "Connotation refers to a reader's emotion or association connected with a word.",
            "Personification is a figure of speech in which a thing, idea, or animal is given human qualities."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, and annotate a text for evidence of the meanings of words and phrases as they are used in a text.",
            "Determine the connotative meaning of particular words and phrases based on context.",
            "Determine the figurative meaning of particular words and phrases based on context.",
            "Determine the technical meaning of particular words and phrases based on context."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "determine",
        "meaning",
        "figurative language",
        "connotative meanings",
        "technical meanings",
        "simile",
        "metaphor",
        "exaggeration/hyperbole",
        "personification"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.6.5",
      "description": "Analyze how a particular sentence, paragraph, chapter, or section fits into the overall structure of a text and contributes to the development of the ideas. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.5",
      "grade": null,
      "description": "Analyze the structure of texts, including how specific sentences, paragraphs, and larger portions of the text (e.g., a section, chapter, scene, or stanza) relate to each other and the whole."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to compare and contrast the overall structure of events, ideas, concepts, or information in two or more texts.",
            "How to describe the overall structure of events, ideas, concepts, or information in a text or part of a text.",
            "How to use text features and search tools (e.g., headings, tables of contents, captions, bold print, subheadings, glossaries, indexes, electronic menus, icons, key words, sidebars, hyperlinks) to locate information relevant to a given topic efficiently.",
            "Common organizational structures are found in informational texts (e.g., cause/effect, comparison/contrast,"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Writers purposely include particular sentences, chapters, paragraphs, chapters, or sections that fit in the overall text and further the development of the overall structure (e.g., transition sentences, relationship statements, cause/effect paragraphs, problem/solutions sections).",
            "Writers purposely include particular sentences, chapters, paragraphs, chapters, or sections that contribute to the development of ideas in a text.",
            "Knowledge of common informational text structures provides support for organizing the ideas and"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, and annotate a text for evidence of how smaller parts of a text fit into the overall structure of a text.",
            "Closely read, analyze and annotate a text for evidence of how smaller parts of a text contribute to the development of ideas.",
            "Provide an analysis of how a particular sentence fits into the overall structure of a text.",
            "Provide an analysis of how a paragraph fits into the overall structure of a text.",
            "Provide an analysis of how a chapter fits into the overall structure of a text.",
            "Provide an analysis of how a particular section fits into the overall structure of a text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.6.6",
      "description": "Determine an author's point of view or purpose in a text and explain how it is conveyed in the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.6",
      "grade": null,
      "description": "Assess how point of view or purpose shapes the content and style of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to determine an author's purpose when it is not explicitly stated in the text.",
            "How to analyze multiple accounts of the same event or topic, noting important similarities and differences in the point of view they represent.",
            "How to compare and contrast a firsthand and secondhand account of the same event or topic and describe the differences in focus and the information provided.",
            "How to distinguish his or her own point of view from that of the author of a text.",
            "How to identify the main purpose of a text, including what the author wants to answer, explain, or describe."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors develop point of view through author's style, tone, word choice, description, omission of information, inclusion of information, etc.",
            "Authors can direct readers' attention to the exact detail, opinion, idea, emotion, etc., the author wants to stress through his or her style of writing.",
            "The ways in which an author's point of view influences content and style.",
            "An author's writing is influenced by his experiences, background, and values.",
            "Authors use different points of view to offer different perceptions and to develop a"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze and annotate a text for evidence of an author's viewpoint and how it is developed throughout the text.",
            "Provide a statement of an author's point of view in a text.",
            "Provide a state of an author's purpose in a text.",
            "Provide an explanation of how the author's point of view is conveyed in the text.",
            "Provide an explanation of how the author's purpose is conveyed in the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.6.7",
      "description": "Integrate information presented in different media or formats (e.g., visually, quantitatively) as well as in words to develop a coherent understanding of a topic or issue. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.7",
      "grade": null,
      "description": "Integrate and evaluate content presented in diverse media and formats, including visually and quantitatively, as well as in words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to draw on information from multiple print and digital sources, demonstrating the ability to locate an answer to a question quickly or to solve a problem efficiently.",
            "How to interpret information presented visually, orally, or quantitatively (e.g., in charts, graphs, diagrams, timelines, animations, or interactive elements on web pages) and explain how the information contributes to an understanding of the text in which it appears.",
            "How to use information gained from illustrations (e.g., maps, photographs) and the words in a text to demonstrate understanding of the text (e.g., where,"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Interpret information and data presented visually, quantitatively, and in writing",
            "Apply information from multiple sources to understand a topic",
            "Integrate information on a topic from several texts to develop a base of knowledge on a subject (e.g., categorize/organize information, compare information, summarize from multiple texts)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, and annotate a text for evidence to use in integrating information presented in different media or formats and in words.",
            "Demonstrate a coherent understanding of a topic or issue that integrates information presented in different media or formats (e.g., visually, quantitatively) as well as in words).",
            "Complete a graphic organizer on a specific topic or questions, integrating information from two or more media (e.g., video, audio, web page) or formats (e.g., charts, diagrams, timelines)."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.6.8",
      "description": "Trace and evaluate the argument and specific claims in a text, distinguishing claims that are supported by reasons and evidence from claims that are not. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.8",
      "grade": null,
      "description": "Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as the relevance and sufficiency of the evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to explain how an author uses reasons and evidence to support particular points in a text, identifying which reasons and evidence support which points.",
            "How to describe a logical connection between particular sentences and paragraphs in a text (e.g., comparison cause/effect, fist/second/third in a sequence).",
            "How to describe how reasons support specific points the author makes in a text.",
            "How to distinguish fact from opinion.",
            "How to recognize that opinions and inferences can be supported by facts."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Trace means to outline or delineate.",
            "Evaluate means to determine the significance of something or a judgment about something based on evidence.",
            "How to identify a speaker's claim(s) and explain how each claim is supported by the argument or arguments the speaker makes (the evidence).",
            "A speaker uses reasons, facts, statistics, details, etc. to support his or her arguments for a claim or claims.",
            "A claim is a statement of opinion the writer or speaker is trying to prove.",
            "Argument(s) is how the speaker supports his claim(s); argument is the main point or points a speaker makes to provide supporting reasons and evidence for his claim."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, and annotate a text for evidence of claims that are supported by reasons and evidence and claims that are not.",
            "Trace the argument and/or specific claims in a text.",
            "Evaluate the argument and/or specific claims in a text.",
            "Provide a statement distinguishing which claims of a text are supported by reasons and evidence and which claims are not supported.",
            "Trace the author's argument and evaluate whether it is convincing based on its use of reasoning and evidence."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.6.9",
      "description": "Compare and contrast one author's presentation of events with that of another (e.g., a memoir written by and a biography on the same person). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: compare, contrast, presentation, events"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to integrate information from several texts on the same topic to write or speak about the subject knowledgably.",
            "How to compare and contrast the most important points and key details presented in two texts on the same topic."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Authors present information differently.",
            "How to explain similarities and differences between informational texts on the same topic (e.g., purpose, organization, main ideas, viewpoint).",
            "There are many forms of Informational text/literary nonfiction subgenres.",
            "o Exposition",
            "o Argument",
            "o Functional text",
            "o Personal essays",
            "o Speeches",
            "o Opinion pieces",
            "o Biographies",
            "o Memoirs",
            "o Journalism"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, and annotate a text for evidence that shows similarities and differences in two or more authors' presentations of the same events.",
            "Provide a comparison and contrast of one author's presentation of events with that of another (e.g., a memoir written by and biography on the same person).",
            "Create a graphic organizer to compare and contrast how each author presents information on the same topic."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "compare",
        "contrast",
        "presentation",
        "events"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Reading Informational Text",
    "reporting_category": "Range of Reading and Level of Text Complexity",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.6.10",
      "description": "By the end of the year, read and comprehend literary nonfiction in the grades 6-8 text complexity band proficiently, with scaffolding as needed at the high end of the range. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.10",
      "grade": null,
      "description": "Read and comprehend complex literary and informational texts independently and proficiently."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to self-monitor and adjust understanding of an informational text by visualizing unfamiliar situations, diagramming complex relationships, and applying skills from across the language arts.",
            "How to explain the differences between text structures (e.g., chronological, compare/contrast, problem/solution, description, process order, etc.).",
            "How to note important parts of a text.",
            "How to explain the characteristics and structural elements of different genres of informational text (e.g.,"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The complexity of text increases as students progress through grade levels.",
            "An interpretive framework can be applied to works of the same genre.",
            "Literary nonfiction shares characteristics with literature but is based on fact.",
            "There are several modes of discourse (e.g., narration, description, exposition, and argument).",
            "Text structure impacts a text's meaning.",
            "Characteristics of informational text forms include:",
            "o Essays",
            "o Speeches",
            "o Opinion pieces"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, comprehend, take notes and annotate literary texts of increasing complexity within the Lexile range of 955-1155 for the purpose of comprehension.",
            "Analyze and explain the characteristics and devices employed by types of informational texts including literary nonfiction (e.g., essay, biography) and argument to begin to establish an interpretive framework for understanding different works.",
            "Monitor and adjust understanding of an informational text by recognizing when comprehension becomes unclear and applying"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.1a",
      "description": "Introduce claim(s) and organize the reasons and evidence clearly. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify a writer's claim(s) and explain how each claim is supported by the argument or arguments the speaker makes (the evidence).",
            "A writer or speaker uses reasons, facts, statistics, details, etc., to support his or her arguments for a claim or claims.",
            "A claim is a statement of opinion the writer or speaker is trying to prove.",
            "Argument(s) is how the writer or speaker supports his claim(s); argument is the main point or points a speaker makes to provide"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Claims are introduced to present the writer's opinion or position on a topic, idea, or issue.",
            "A counterclaim is an alternate or opposing claim, the opposite side of the writer's claim.",
            "Some claims attempt to convince the reader that the position the writer takes is correct.",
            "A writer presents an argument (point, reason, detail) or several arguments to provide support for his claim.",
            "Evidence is introduced to provide support for the writer's claim.",
            "Arguments should be strategically ordered from least support to greatest"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Provide an introductory claim statement about a topic, idea, or issue under study, including the title, author, and genre (TAG sentence) of the texts from which the writing is related.",
            "Complete a graphic organizer to organize the reasons and evidence to support his or her claim clearly.",
            "Separate evidence from the text into two groups: (1) evidence that supports the writer's claim or (2) evidence that supports the counterclaim.",
            "Order his or her evidence from least support to greatest support."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.1b",
      "description": "Support claim(s) with clear reasons and relevant evidence, using credible sources and demonstrating an understanding of the topic or text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to use an appropriate standard format for giving credit to the authors they are citing, such as those from the MLA or the APA.",
            "Reasons should be logically ordered and supported by facts and/or details from the text.",
            "Support must be provided for a claim."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to provide clear reasons supported with relevant support from credible sources for claims will convince the reader that the writer has a well-supported interpretation of the claim.",
            "A well-written claim requires students to have a deep understanding of the topic or text.",
            "Sources are considered credible when they are trustworthy, accurate, and reliable.",
            "How to distinguish between relevant and irrelevant evidence.",
            "Evidence (arguments) should be strategically ordered from least support to greatest"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Evaluate resources for credibility and selects evidence that comes from credible sources to use in writing.",
            "Organize evidence into two groups: (1) relevant evidence or (2) irrelevant evidence.",
            "Provide clear reasons and relevant evidence from credible sources as support for claim(s).",
            "Develop an outline of claim(s) and supporting evidence to ensure understanding of the topic and/or text(s).",
            "Demonstrate an understanding of the text through writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.1c",
      "description": "Use words, phrases, and clauses to clarify the relationships among claim(s) and reasons. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to link opinions and reasons using words, phrases, and clauses (e.g., consequently, specifically, for instance, in order to, in addition, because, therefore, since, for example, and, also).",
            "A claim is a statement of opinion the writer or speaker is trying to prove."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Transition words assist writers in developing relationships among claims and reasons.",
            "There are several types of transition words.",
            "o Agreement, addition, similarity (as a matter of fact, equally, furthermore, of course, by the same token)",
            "o Examples, support, emphasis (in other words, to put it differently, on the positive side, on the negative side, chiefly, notably, most compelling evidence)",
            "o Effect, result, consequence (thus, accordingly, hence, in that case, for this reason, under those circumstances)",
            "o Opposition, limitation, contradiction (although this may be true, in contrast, instead, whereas, despite,"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Include precise language in writing.",
            "Include descriptive words/ phrases.",
            "Include sensory details.",
            "Use transition words to clarify relationships among claims and reasons.",
            "Include domain-specific vocabulary as appropriate to the text or topic.",
            "Include relevant warrants to the claim."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.1d",
      "description": "Establish and maintain a formal style. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: formal style, argument, support, claim, relevant evidence"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Formal language should not include words that are used in a casual language. (i.e., euphemisms, slang, biased language, group-specific jargon).",
            "Formal language uses correct grammar and spelling."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The level of formality is determined by the audience.",
            "Academic writing requires a formal tone."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Develop a response appropriate for the intended audience.",
            "Omit casual language.",
            "Use correct spelling and grammar."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "formal style",
        "argument",
        "support",
        "claim",
        "relevant evidence"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.1e",
      "description": "Provide a concluding statement or section that follows from the argument presented. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: concluding statement/ section, arguments, support, claims"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to provide a concluding statement or section related to the opinion presented.",
            "Conclusions wrap up what has been discussed throughout the paper."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Conclusions address why the reader should align with your position.",
            "Support for the argument(s) presented will convince the reader that the writer has a well-supported interpretation of the claim."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Provide a concluding statement or section that restates the arguments presented to support the claim.",
            "Provide a concluding statement or section that addresses why the reader should align with your position."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "concluding statement/ section",
        "arguments",
        "support",
        "claims"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.2a",
      "description": "Introduce a topic; organize ideas, concepts, and information, using strategies such as definition, classification, comparison/contrast, and cause/effect; include formatting (e.g., headings), graphics (e.g., charts, tables), and multimedia when useful to aiding comprehension. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: informative, explanatory, introduce, topic, ideas, general observation and focus, concepts, related information, logically, organization, definition, classifications, comparison, contrast, cause, effect, formatting, graphics, multimedia, comprehension"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative /explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to introduce a topic clearly, provide a general observation and focus, and group related information logically.",
            "How to include formatting and tools (e.g., headings, illustrations, and multimedia) when useful to aiding comprehension.",
            "How to group related information in paragraphs and sections.",
            "Topics should be narrow.",
            "Formats used to signal major divisions throughout the text.",
            "o Headings",
            "o Sections",
            "Graphics (i.e., charts, tables) provide examples for the topic.",
            "Multimedia (i.e., audio, still images, video, animation) help the reader understand the topic."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The topic must be presented in the introduction.",
            "Ideas, concepts, and information should be organized for audience and purpose using the most effective method.",
            "Ideas can be organized using different methods.",
            "o Definition",
            "o Classification",
            "o Compare/contrast",
            "o Cause/effect",
            "The method of organization will assist in the development of the topic.",
            "The text should be formatted to help the reader understand the major divisions within the text.",
            "Graphics will help the reader understand the topic.",
            "Multimedia will help the reader understand the topic."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Introduce a topic that is clearly developed.",
            "Organize ideas, concepts, and information using a specific organizational method and/or graphic organizer appropriate to the topic.",
            "Include specific formatting, graphics, and/or multimedia when it aids in comprehension."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "informative",
        "explanatory",
        "introduce",
        "topic",
        "ideas",
        "general observation and focus",
        "concepts",
        "related information",
        "logically",
        "organization",
        "definition",
        "classifications",
        "comparison",
        "contrast",
        "cause",
        "effect",
        "formatting",
        "graphics",
        "multimedia",
        "comprehension"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.2b",
      "description": "Develop the topic with relevant facts, definitions, concrete details, quotations, or other information and examples. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: topic, relevant facts, definitions, concrete details, quotations, examples"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative /explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to develop a topic with facts, definitions, concrete details, quotations, or other information and examples related to the topic.",
            "Definitions provide statements of the exact meaning of a word.",
            "Concrete details are facts that come from the source.",
            "Quotations are words taken from a text or speech and repeated by someone other than the original speaker.",
            "Examples are a model or pattern of something that can be imitated."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Developing a topic will help the reader to understand what the writer is trying to convey.",
            "Relevant facts connected to the topic will aid the reader in comprehending the information the writer is presenting.",
            "Relevant means to be closely connected or appropriate to the context.",
            "Concrete details about the topic will aid the reader in comprehending the information the writer is presenting.",
            "Quotations about the topic will aid the reader in comprehending the information the writer is presenting.",
            "Examples that are relevant to the topic will aid the reader in comprehending the information the writer is presenting."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Develop the main point(s) (body) of the paper by including relevant facts, definitions, concrete details, quotations or other information and examples retrieved from resources that support the main focus of his paper."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "topic",
        "relevant facts",
        "definitions",
        "concrete details",
        "quotations",
        "examples"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.2c",
      "description": "Use appropriate transitions to clarify the relationships among ideas and concepts. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative /explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to link ideas within and across categories of information using words, phrases, and clauses (e.g., in contrast, especially, another, for example, also, because, and, more, but)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Transitions unify writing into a whole piece.",
            "Transitions connect ideas and paragraphs.",
            "Transitions connect corresponding paragraphs.",
            "Transition words assist writers in developing relationships among claims and reasons.",
            "There are several types of transition words.",
            "o Agreement, addition, similarity (as a matter of fact, equally, furthermore, of course, by the same token)",
            "o Examples, support, emphasis (in other words, to put it differently, on the positive side, on the negative side, chiefly, notably, most compelling evidence)",
            "o Effect, result, consequence (thus, accordingly, hence, in"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Include transitions that provide logical connections in writing.",
            "Build ideas and paragraphs from a smaller point to a larger point.",
            "Show that one paragraph refers to another.",
            "Clearly show the relationships among ideas and concepts."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.2d",
      "description": "Use precise language and domain-specific vocabulary to inform about or explain the topic. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: precise language, domain-specific vocabulary, inform, audience, purpose for writing"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative /explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Precise language is language that uses the right words to convey the exact message.",
            "Domain-specific vocabulary includes words that are specific to certain domain/ area."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Precise language will help the reader understand the writer's topic."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Include language that is specific to the writer's topic, audience, and purpose.",
            "Include domain-specific vocabulary to inform or explain the writer's topic."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "precise language",
        "domain-specific vocabulary",
        "inform",
        "audience",
        "purpose for writing"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.2e",
      "description": "Establish and maintain a formal style. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: informative/explanatory, concepts, selection, organization, analysis, relevant content, formal style"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative /explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Formal language should not include words that are used in a casual language. (i.e., euphemisms, slang, biased language, group-specific jargon).",
            "Formal language uses correct grammar and spelling."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The level of formality is determined by the audience.",
            "Academic writing requires a formal tone."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Develop a response appropriate for the intended audience.",
            "Omit casual language.",
            "Use correct spelling and grammar."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "informative/explanatory",
        "concepts",
        "selection",
        "organization",
        "analysis",
        "relevant content",
        "formal style"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.2f",
      "description": "Provide a concluding statement or section that follows from the information or explanation presented. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: concluding statement, concluding section, support, information, explanation"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative /explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to provide a concluding statement or section related to the information presented."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Conclusions wrap up what has been discussed throughout the paper.",
            "The concluding section should support the information presented."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Include a concluding statement or section that supports the topic and the points discussed throughout the paper."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "concluding statement",
        "concluding section",
        "support",
        "information",
        "explanation"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.3a",
      "description": "Engage and orient the reader by establishing a context and introducing a narrator and/or characters; organize an event sequence that unfolds naturally and logically. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well-structured event sequences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to orient the reader by establishing a situation and introducing a narrator and/or characters.",
            "How to organize an event sequence that unfolds naturally.",
            "How to write a narrative in which he or she recounts a well-elaborated event or short sequence of events; includes details to describe actions, thoughts, and feelings; uses temporal words to signal event order; and provides a sense of closure.",
            "A narrative tells a story.",
            "A narrator is the person who tells the story of events.",
            "A narrative includes a setting, characters, and a plot."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Establishing a context will let the reader know what the narrative is about.",
            "Organizing an event sequence that unfolds naturally and logically will allow the reader the opportunity to become engaged in the story.",
            "Students can begin narratives in a variety of ways (e.g., with a statement by one of the characters, a detailed description of a place, a question by a character of the narrator, a thought of one of the characters or narrator, description of an action by a character, with a sound effect and description, a flashback)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Complete a graphic organizer to plan the context, setting, introduce the characters, and logically sequence the plot.",
            "Develop an engaging context to hook the reader into the narrative.",
            "Determine to begin the narrative.",
            "Introduce the narrator and characters.",
            "Organize an event sequence that unfolds naturally and logically."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.3b",
      "description": "Use narrative techniques, such as dialogue, pacing, and description, to develop experiences, events, and/or characters. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well- structured event sequences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to use narrative techniques such as dialogue, description, and pacing, to develop experiences and events.",
            "Narrative techniques include dialogue, pacing, and description.",
            "Dialogue is a conversation between two or more people.",
            "Pacing is the manipulation of time.",
            "Pacing moves the events of the narrative forward.",
            "Description is a way to give details about events, people, and experiences.",
            "How to use dialogue and descriptions of actions, thoughts, and feelings to develop characters."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Narrative techniques such as dialogue, description, and pacing, assist in developing complex characters.",
            "Dialogue, pacing, and description work together and/or individually to drive the action and push the plot toward a resolution/solution.",
            "Pacing is important to a narrative to assist the development of the plot by allowing the events to flow naturally.",
            "Description provides a spoken or written representation of a person, experience, or an event.",
            "Dialogue is important to the development of the character and events in a narrative."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Include techniques such as dialogue, pacing, and description to develop the characters' experiences.",
            "Include techniques such as dialogue, pacing, and description to develop the events in the plot.",
            "Include techniques such as dialogue, pacing, and description to develop complex characters.",
            "Focus on a short period for the narrative that allows the student to develop the experiences, events, and characters in a complex, engaging manner.",
            "Include pacing that allows the events and experiences to flow and unfold naturally.",
            "Include detailed description in order to provide the"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.3c",
      "description": "Use variety of transition words, phrases, and clauses to convey sequence and signal shifts from one time frame or setting to another. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well- structured event sequences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Transition words, phrases, and clauses connect ideas and paragraphs.",
            "Transitional words will signal exceptions, time, repetition, summary, or conclusion, emphasis, or give examples.",
            "Sequencing is the order in which things happen."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Transitions unify writing into a whole piece.",
            "Transitions connect ideas and paragraphs.",
            "Transitions connect corresponding paragraphs.",
            "Transition words assist writers in developing relationships among claims and reasons.",
            "There are many transition words that convey sequence, time, chronology (e.g., after, as soon as, before, initially, now, immediately, meanwhile, when we finished, soon after, before long, suddenly, later on).",
            "Transitions help readers understand how ideas and paragraphs work together.",
            "Transitions help readers understand that ideas and"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Include a variety of transition words, phrases, and/or clauses that provide logical transitions in their writing.",
            "Annotate his or her writing for inclusion of transitions that link one event and/or paragraph to another are included.",
            "Annotate his or her writing for inclusion of signal shifts from one time frame to another to ensure the plot is moving forward.",
            "Include signal shifts to introduce a flashback if appropriate to the context of the narrative.",
            "Use transition words to link one setting to another in appropriate to the context of the narrative."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.3d",
      "description": "Use precise words and phrases, relevant descriptive details, and sensory language to convey experiences and events. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well- structured event sequences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to use concrete words and phrases and sensory details to convey experiences and events precisely.",
            "How to provide a sense of closure in a narrative.",
            "Precise language is language that uses the right words to convey the exact message.",
            "Descriptive details convey a clear picture of an idea.",
            "Sensory details are details that deal with the senses."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Writers should choose precise words based on the effect they want to achieve in the reader.",
            "Choosing words for their specific connotations assists the reader in determining the mood of the passage and the tone of the writer.",
            "Tone is how the author chooses to present the writing (e.g., style, word choice).",
            "There are many possible tones a writer can use (e.g., serious, humorous, amused, angry, playful, neutral, ironic, suspicious, witty).",
            "Mood is the feeling a piece of literature evokes in a reader.",
            "There are many possible moods a reader can feel (e.g., optimistic, gloomy, happy,"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Include words that are precise to convey experiences and events and evoke feelings in the reader.",
            "Include relevant descriptive details to convey experiences and events.",
            "Include sensory language to help create an image in the reader's mind of experiences and events in the narrative.",
            "Annotate his or her writing for precise words, descriptive details, and sensory language.",
            "Give and receive peer feedback on the inclusion of precise words, descriptive details, and sensory language."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.3e",
      "description": "Provide a conclusion that follows from the narrated experiences or events. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: provide, conclusion, narrated experiences, narrated events"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well- structured event sequences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to provide a conclusion that follows the narrated experiences or events."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Conclusions inform the reader of the resolution or solution.",
            "A conclusion brings the narrative to a close (e.g., shows what was learned through the experience or event by the narrator or another character, connects the event to a larger meaning, provides a reflection of the experience or event)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Include a concluding statement or section that follows from the narrated events or experiences and brings the narrative to a close.",
            "Give and receive peer feedback on the inclusion of an appropriate conclusion."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "provide",
        "conclusion",
        "narrated experiences",
        "narrated events"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.4",
      "description": "Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.4",
      "grade": null,
      "description": "Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Coherent writing is logically ordered, well-organized, and connected, and easy to understand.",
            "Text structure is how the information within the text is written or organized.",
            "o Narration",
            "o Description",
            "o Process",
            "o Definition",
            "o Division and classification",
            "o Compare and contrast",
            "o Analogy",
            "o Cause and effect",
            "A writer's style is the way he or she chooses language to convey ideas.",
            "Style includes the author's voice, tone, and word choice.",
            "A task is an assigned piece of work to be completed."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The assigned task must be addressed in the writing.",
            "Considering the purpose of the writing will assist the writer in the organization of the writing.",
            "Determining the audience will be helpful when developing the subject."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Present writing in a clear, coherent manner.",
            "Address the assigned task.",
            "Use language appropriate to the task, purpose, and audience.",
            "Give and receive peer feedback on development, organization, style, task purpose, audience for a variety of pieces of writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.5",
      "description": "With some guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach. (Editing for conventions should demonstrate command of Language standards 1-3 up to and including grade 6.) Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.5",
      "grade": null,
      "description": "Use technology, including the internet, to produce and publish writing and to interact and collaborate with others."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A peer is someone who is of equal standing.",
            "The steps of writing include planning, revising, editing, re-writing, or trying a new approach.",
            "Planning allows the student the opportunity to gather ideas, brainstorm, and map out thoughts and make decisions about the content of a piece.",
            "Revising is altering something that has already been written or printed in order to improve, update or make corrections.",
            "Editing is correcting written work, checking for grammar, spelling, or punctuation errors."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Receiving guidance and support from peers and adults will help the development of and strengthen the writing by giving the writer an opportunity to write for an audience.",
            "Using the writing process will help develop the writer's piece.",
            "Using the writing process will help strengthen the writer's writing."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Ask for and receive guidance and support from peers and adults for pieces of writing.",
            "Make change to pieces of writing, based on the feedback from peers and teachers to strengthen writing.",
            "Demonstrate command of the conventions of standard English grammar and usage.",
            "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling.",
            "Request peer or adult feedback on the conventions of standard English and edit pieces of writing accordingly.",
            "Demonstrate knowledge of language and its conventions."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.6",
      "description": "Use technology, including the internet, to produce and publish writing as well as to interact and collaborate with others; demonstrate sufficient command of keyboarding skills. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: technology, Internet, produce, publish, collaborate, demonstrate, sufficient command of keyboarding skills, single sitting"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.6",
      "grade": null,
      "description": "Use technology, including the internet, to produce and publish writing and to interact and collaborate with others."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Technology consists of electronic and web-based tools and applications used to access, analyze, and evaluate information.",
            "The Internet is a global system of interconnected computer networks.",
            "Produce means to create something.",
            "Publish is the final step in the writing process then the writer shares the work with others.",
            "To collaborate means to work cooperatively with others.",
            "Keyboarding skills are necessary for using both word processing software and database software."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The student's writing will be produced using technology (e.g., PowerPoint, Prezi,).",
            "The student's writing will be published through technology (e.g., classroom blogs, classroom webpages).",
            "Collaborating with others provides many positive opportunities for students (e.g., make and receive suggestions, assist others and receive assistance, coproduce products and tasks)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Produce writing using technology.",
            "Publish writing through technology.",
            "Collaborate with others to retrieve information and/or publish information."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "technology",
        "Internet",
        "produce",
        "publish",
        "collaborate",
        "demonstrate",
        "sufficient command of keyboarding skills",
        "single sitting"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.7",
      "description": "Conduct short research projects to answer a question, drawing on several sources and refocusing the inquiry when appropriate. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: conduct, research project, several sources, refocusing, inquiry"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.7",
      "grade": null,
      "description": "Conduct short as well as more sustained research projects based on focused quotations, demonstrating understanding of the subject under investigation."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to conduct short research projects, using several sources to build knowledge through investigation of different aspects of a topic.",
            "A research project is an organized study to discover facts about a particular topic.",
            "Sources are people, places, or things that provide information.",
            "An inquiry is a request for information."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Researching a topic will answer questions that the reader may have.",
            "Using several sources will provide more support for the research topic.",
            "Several sources will help verify answers to the research inquiry.",
            "The inquiry of the research may need to be refocused based on the information that is found.",
            "How to use an appropriate standard format for giving credit to the authors they are citing, such as those from the MLA or the APA."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Conduct short research projects that answer a question.",
            "Use several sources when conducting research (e.g., websites, digital encyclopedia, journals, books).",
            "Refocus the inquiry of the research based on information found.",
            "Correctly, cite sources using an appropriate standard format.",
            "Use a graphic organizer to organize and maintain the information from resources."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "conduct",
        "research project",
        "several sources",
        "refocusing",
        "inquiry"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.8",
      "description": "Gather relevant information from multiple print and digital sources; assess the credibility of each source; and quote or paraphrase the data and conclusions of others while avoiding plagiarism and providing basic bibliographic information for sources. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.8",
      "grade": null,
      "description": "Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as the relevance and sufficiency of the evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to recall relevant information from experiences or gather relevant information from print and digital sources.",
            "Digital sources are sources that are available in electric form, readable and manipulated by computer.",
            "How to summarize or paraphrase information in notes and finished work.",
            "How to provide a list or sources.",
            "How to quote a source correctly within his or her writing."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Information can be gathered from print and digital sources.",
            "Sources are considered credible when they are trustworthy, accurate, and reliable.",
            "Paraphrase means to rephrase an author's idea in different words.",
            "Information from sources should be used without plagiarizing.",
            "Plagiarism is the use of ideas or writings of another author, representing them as one's original work.",
            "Providing bibliographic information about sources will give the author of the information credit. A quote is a repeat or copy of someone else's statement or thoughts."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Gather information from several print and digital sources.",
            "Assess the credibility of the source by the author, the author's purpose, and the date of the information.",
            "Quote directly from a source and provide credit to the author by providing basic bibliographic information using an appropriate standard format.",
            "Paraphrase information from others while avoiding plagiarism and providing basic bibliographic information using an appropriate standard format."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.9a",
      "description": "Apply grade 6 Reading standards to literary texts (e.g., \"Compare and contrast texts in different forms or genres [e.g., stories and poems; historical novels and fantasy stories] in terms of their approaches to similar themes and topics\"). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A student should be able to compare and contrast two or more characters, settings, or events in a story or drama, drawing on specific details in a text.",
            "How to describe in depth a character, setting, or event in a story or drama, drawing on specific details in a text.",
            "Evidence is information that shows, proves, or gives reasons for making a judgment.",
            "Literary texts are written works such as a novel, poem, or play.",
            "Support is used to show that an idea, statement, or theory is true or correct.",
            "Analysis means to separate into parts in order to"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Evidence to support analysis, reflection, or research must be retrieved from literary texts."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": []
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.9b",
      "description": "Apply grade 6 Reading standards to literary nonfiction and/or informational texts (e.g., \"Trace and evaluate the argument and specific claims in a text, distinguishing claims that are supported by reasons and evidence from claims that are not\"). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to explain how an author uses reasons and evidence to support particular points in a text, identifying which reasons and evidence support which point(s).",
            "Evidence is information that shows, proves, or gives reasons for making a judgment.",
            "Informational texts are written selections intended to explain an idea, topic, or process.",
            "Support is used to show that an idea, statement, or theory is true or correct.",
            "Analysis means to separate into parts to determine what something is or how it works.",
            "Reflection means to consider the thoughts on a topic or literary work."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Evidence to support analysis, reflection, or research must be retrieved from informational texts."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Provide a written response to questions based on Reading for Literature and Reading for Information Standards 2-9.",
            "Support written responses to questions based on Reading for Information Standard 1.",
            "Include evidence gather from informational texts that supports analysis, reflection, and research."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Writing",
    "reporting_category": "Range of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.6.10",
      "description": "Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: routinely, extended time frames, shorter time frames, discipline-specific tasks, purposes, audiences"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.10",
      "grade": null,
      "description": "Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of tasks, purposes, and audiences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Routine is a sequence of actions regularly followed.",
            "Time frames are intervals of time.",
            "Research is the careful investigation or study of a topic.",
            "Reflection is done to consider the thoughts on a topic or literary work.",
            "Revision is a step in the writing process used to correct or improve the original work.",
            "Single sitting is a limited period of activity without stopping.",
            "Discipline-specific tasks are tasks related to a specific branch of knowledge.",
            "Purpose is the intended or desired result of a piece of written or spoken material.",
            "Audiences are the people for whom a selection is written or performed."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Writing should be done regularly.",
            "Writing will have to be produced during different time frames.",
            "Writing will be produced for a range of discipline-specific tasks.",
            "Writing will be produced for a range of purposes.",
            "Writing will be produced for a range of audiences."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write routinely over extended time frames and shorter time frames.",
            "Produce writing for a range of discipline-specific tasks.",
            "Produce writing for a range of purposes.",
            "Produce writing for a range of audiences."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "routinely",
        "extended time frames",
        "shorter time frames",
        "discipline-specific tasks",
        "purposes",
        "audiences"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.6.1a",
      "description": "Come to discussions prepared, having read or studied required material; explicitly draw on that preparation by referring to evidence on the topic, text, or issue to probe and reflect on ideas under discussion. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: discussion, evidence, probe"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A good communicator is able to express his or her ideas effectively and listen actively.",
            "How to come to discussions prepared, having read required material.",
            "How to use evidence to support ideas shared in a discussion."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Sometimes it is necessary to prepare for a discussion by researching the topic, text, or issue to be discussed.",
            "Reading required material prepares them for discussion of the text.",
            "How to identify key ideas from researched material on the topic, text, or issue under discussion.",
            "How to use evidence to support ideas shared in a discussion.",
            "How to formulate comments, questions, and responses on ideas under discussion."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Provide evidence of reading/studying required material through note-taking and/or annotation of the text.",
            "Participate in discussions on the required material, citing evidence from the text to support comments on the text.",
            "Ask questions that require a deeper probing of ideas presented in the text.",
            "Provide comments that offer a differing perspective or reflection of the topic or ideas under discussion.",
            "Develop comments, questions, and responses based on evidence."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "discussion",
        "evidence",
        "probe"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.6.1b",
      "description": "Follow rules for collegial discussions, set specific goals and deadlines, and define individual roles as needed. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: collegial, discussion, goals, deadlines, roles"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to follow agreed-upon rules of a collegial discussion.",
            "How to define individual roles for group discussions."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The importance of setting goals and deadlines for collegial discussions."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Continually demonstrate the ability to follow established rules for participating in collegial discussions (e.g., listen actively and attentively, do not monopolize discussion, ask for clarification, respect every member)",
            "Within a collegial discussion, remain on task and achieve the instructional goal(s) set forth by the teacher within the established time frame.",
            "Participate in small-group discussions and effectively carry out assigned role (e.g., leader, recorder, reporter, illustrator, time keeper)."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "collegial",
        "discussion",
        "goals",
        "deadlines",
        "roles"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.6.1c",
      "description": "Pose and respond to specific questions with elaboration and detail by making comments that contribute to the topic, text, or issue under discussion. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: pose, respond, elaboration, topic, text, issue, discussion"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to pose and respond to specific questions."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to elaborate on a topic by making comments that contribute to the topic, text, or issue under discussion."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "In a one-on-one, small-group, or whole-group setting, ask questions about a topic, text, or issue under discussion that require classmates to elaborate on their answers by providing specific details from the text.",
            "In a one-on-one, small-group, or whole-group setting, answer questions about a topic, text, or issue under discussion by elaborating on specific details found in the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "pose",
        "respond",
        "elaboration",
        "topic",
        "text",
        "issue",
        "discussion"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.6.1d",
      "description": "Review the key ideas expressed and demonstrate understanding of multiple perspectives through reflection and paraphrasing. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: reflection, paraphrasing, key ideas, perspectives, discussion"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify key ideas and details gained from discussions."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Group discussions can be a powerful way to gain new understanding.",
            "Reflecting and paraphrasing information helps you better understand the key ideas expressed in a discussion.",
            "Paraphrasing means to express the meaning of another person's writing and/or speaking using different words."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "In one-on-one, small-group, or whole-group settings, a student reviews the key ideas of a text expressed by classmates.",
            "In one-on-one, small-group, or whole-group settings, a paraphrase other classmates' ideas and perspectives.",
            "In one-on-one, small-group, or whole-group settings, reflect on others' ideas and affirm or adjust his or her own ideas."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "reflection",
        "paraphrasing",
        "key ideas",
        "perspectives",
        "discussion"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.6.2",
      "description": "Interpret information presented in diverse media and formats (e.g., visually, quantitatively, orally) and explain how it contributes to a topic, text, or issue under study. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.2",
      "grade": null,
      "description": "Integrate and evaluate information presented in diverse media and formats, including visually, quantitatively, and orally."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to summarize a written text orally.",
            "How to summarize information presented through various forms of media and various formats (visually, quantitatively, orally).",
            "How to paraphrase portions of a read-aloud text orally.",
            "How to paraphrase information presented through various forms of media and various formats (visually, quantitatively, orally).",
            "How to determine the main ideas and supporting details of a read-aloud text.",
            "How to determine the main idea and supporting details of information presented in various media and formats"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "By interpreting information presented in diverse media and formats, you develop a stronger understanding of the topic, text, or issue under study.",
            "Interpreting information requires students to attend closely to the format in which the information is presented.",
            "Interpreting information means explaining what the information means.",
            "Diverse media and formats refer to the different types of media and formats available.",
            "o Visual (e.g., video clips, graphics, diagrams, photographs, illustrations, digital storytelling, web page, blog, images, political cartoons, maps, magazines, timelines)"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Explain the main idea and details of the information presented through various media and formats (visually, quantitatively, orally).",
            "Participate in a discussion of how information presented in diverse media and formats contributes to topic, text, or issue under study.",
            "Summarize the information presented in diverse media and formats.",
            "Discuss and explain how visual, quantitative, and oral formats contribute differently to a topic, text, or issue.",
            "Paraphrase the information presented in diverse media and formats."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.6.3",
      "description": "Delineate a speaker's argument and specific claims, distinguishing claims that are supported by reasons and evidence from claims that are not. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: delineate, argument, claim, distinguish, supported claim, unsupported claim, evidence"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.3",
      "grade": null,
      "description": "Evaluate a speaker's point of view, reasoning, and use of evidence or rhetoric."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify a speaker's claim(s) and explain how each claim is supported by the argument or arguments the speaker makes (the evidence).",
            "A speaker uses reasons, facts, statistics, details, etc., to support his or her arguments for a claim or claims.",
            "A claim is a statement of opinion the writer or speaker is trying to prove.",
            "Argument(s) is how the speaker supports his claim(s); argument is the main point or points a speaker makes to provide supporting reasons and evidence for his claim."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Delineate means to outline, trace, or describe.",
            "The difference between a claim that is supported with reasons and evidence opposed to a claim that is unsupported."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Provide an outline of a speaker's claim and supporting arguments (points).",
            "Provide an explanation of whether or not a claim is supported by reasons and evidence."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "delineate",
        "argument",
        "claim",
        "distinguish",
        "supported claim",
        "unsupported claim",
        "evidence"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.6.4",
      "description": "Present claims and findings, sequencing ideas logically and using pertinent descriptions, facts, and details to accentuate main ideas or themes; use appropriate eye contact, adequate volume, and clear pronunciation. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: present claims, present findings, sequencing, logically, pertinent, description, fact, detail, accentuate, main idea, themes, appropriate eye contact, adequate volume, clear pronunciation"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.4",
      "grade": null,
      "description": "Present information, findings, and supporting evidence such that listeners can follow the line of reasoning and the organization, development, and style are appropriate to task, purpose, and audience."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to report on a topic or present an opinion in an organized manner.",
            "How to sequence ideas logically.",
            "How to use appropriate facts and relevant, descriptive details to support main ideas or themes.",
            "How to speak clearly at an understandable pace.",
            "How to tell a story in an organized manner, using appropriate facts and relevant, descriptive details to support main idea or theme.",
            "How to recount an experience in an organized manner."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to plan and deliver presentations.",
            "How to sequence ideas logically.",
            "The importance of separating pertinent information from impertinent information when presenting claims and findings.",
            "Pertinent refers to whether or not the description, facts, and details clearly relate to or are relevant to the claim or findings under discussion.",
            "Accentuating a main idea or theme means to present information that emphasizes a main idea or theme by using details, facts, gestures, and body language.",
            "The importance of using appropriate eye contact, adequate volume, and clear pronunciation."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Orally present claims and findings, sequencing ideas logically.",
            "Use pertinent description, facts, and details to support their claims.",
            "Distinguish between information that in pertinent to a claim or finding and information that is impertinent.",
            "Use appropriate eye contact, adequate volume, and clear pronunciation."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "present claims",
        "present findings",
        "sequencing",
        "logically",
        "pertinent",
        "description",
        "fact",
        "detail",
        "accentuate",
        "main idea",
        "themes",
        "appropriate eye contact",
        "adequate volume",
        "clear pronunciation"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.6.5",
      "description": "Include multimedia components (e.g., graphics, images, music, sound) and visual displays in presentations to clarify information. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: multimedia, components, graphics, images, music, sound, visual displays, presentations, clarify, information"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.5",
      "grade": null,
      "description": "Make strategic use of digital media and visual displays of data to express information and enhance understanding of presentations."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Adding multimedia (e.g., graphics, sound) and visual displays to a presentation can enhance the development of main ideas or themes.",
            "How to create engaging audio recordings of stories and poems that demonstrate fluid reading at an understandable pace.",
            "How to add visual displays to a presentation to emphasize or enhance certain facts or details."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Including multimedia and visual components can help the audience understand the main idea and key details of his or her report.",
            "How to select appropriate multimedia components (graphics, images, music, sound, etc.) that best clarify information in a presentation.",
            "How to select appropriate visual displays that best clarify information in a presentation."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Select multimedia components that add clarity to oral presentations.",
            "Create a presentation including multimedia components to clarify information presented orally.",
            "Design and create a visual display to include in an oral presentation to clarify the information presented."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "multimedia",
        "components",
        "graphics",
        "images",
        "music",
        "sound",
        "visual displays",
        "presentations",
        "clarify",
        "information"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.6.6",
      "description": "Adapt speech to a variety of contexts and tasks, demonstrating command of formal English when indicated or appropriate. (See grade 6 Language standards 1 and 3 for specific expectations.) Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: adapt, speech, variety, contexts, tasks, formal English, appropriate, situation"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.6",
      "grade": null,
      "description": "Adapt speech to a variety of contexts and communicative tasks, demonstrating command of formal English when indicated or appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify formal and informal settings.",
            "The qualities of formal and informal speech.",
            "How to differentiate between contexts or situations that call for formal English and contexts or situations where informal English is appropriate.",
            "How to speak in complete sentence when asked to provide requested details, information, or clarification."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Language should be adjusted depending on audience and the specific occasion, context or task.",
            "How to determine if formal or informal English is appropriate in a given setting and audience."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Appropriately adapt speech for a variety of contexts and tasks.",
            "Based on audience, context, and task, determine when formal or informal language should be used.",
            "Demonstrate correct usage of formal English when indicated."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "adapt",
        "speech",
        "variety",
        "contexts",
        "tasks",
        "formal English",
        "appropriate",
        "situation"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.6.1a",
      "description": "Ensure that pronouns are in the proper case (subjective, objective, possessive). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: ensure, pronoun, proper case, subject pronoun, object pronoun, possessive pronoun, apostrophe"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A pronoun is a word used in place of a noun.",
            "A personal pronoun takes the place of a person or people (e.g., I, me, etc.).",
            "A possessive pronoun shows ownership of something (e.g., mine, ours, yours, etc.).",
            "The noun that the pronoun is replacing is called the antecedent."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A pronoun's function in a sentence determines which case to use.",
            "Pronouns in the subjective case are used as subjects.",
            "Pronouns in the objective case are used as objects of a verb or preposition.",
            "Pronouns in the possessive case express ownership and do not use apostrophes.",
            "Appropriate pronoun usage is essential to the enrichment of conventional language."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Correctly use pronouns in the proper case."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "ensure",
        "pronoun",
        "proper case",
        "subject pronoun",
        "object pronoun",
        "possessive pronoun",
        "apostrophe"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.6.1b",
      "description": "Use intensive pronouns (e.g., myself, ourselves). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: pronoun, noun, antecedent, personal pronoun, reflexive pronoun, intensive pronoun"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A pronoun is a word used in place of a noun.",
            "The noun that the pronoun is replacing is called the antecedent.",
            "A reflexive pronoun (e.g., myself, ourselves, etc.) is a pronoun that refers back to the subject of the sentence or clause."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Intensive pronouns are formed by using a personal pronoun and adding the suffix \"-self\" or \"-selves\" to it.",
            "Intensive pronouns are used to add emphasis to another noun or pronoun.",
            "Intensive pronouns can be removed from a sentence without changing the meaning of the sentence.",
            "Appropriate pronoun usage is essential to the enrichment of conventional language."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Correctly use intensive pronouns."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "pronoun",
        "noun",
        "antecedent",
        "personal pronoun",
        "reflexive pronoun",
        "intensive pronoun"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.6.1c",
      "description": "Recognize and correct inappropriate shifts in pronoun number and person. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: pronoun, noun, antecedent, gender, number, shift, pronoun number, singular, plural, pronoun person, first-person pronoun, second-person pronoun, third-person pronoun"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A pronoun is a word used in place of a noun.",
            "The noun that the pronoun is replacing is called the antecedent.",
            "A pronoun must agree in gender and number with its antecedent."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A shift in pronoun number occurs when a pronoun and its antecedent do not agree in number (singular or plural).",
            "To correct an inappropriate shift in pronoun number, change either the antecedent or the pronoun to the appropriate number.",
            "A shift in pronoun person occurs when the pronoun and antecedent do not agree in person (e.g., first, second, or third person).",
            "To correct an inappropriate shift in pronoun person, change either the antecedent or the pronoun to the appropriate person.",
            "Appropriate pronoun usage is essential to the enrichment of conventional language."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Recognize and revise inappropriate shifts in pronoun and person.",
            "Correctly use pronouns and antecedents."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "pronoun",
        "noun",
        "antecedent",
        "gender",
        "number",
        "shift",
        "pronoun number",
        "singular",
        "plural",
        "pronoun person",
        "first-person pronoun",
        "second-person pronoun",
        "third-person pronoun"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.6.1d",
      "description": "Recognize and correct vague pronouns (i.e., ones with unclear or ambiguous antecedents). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: pronoun, antecedent, vague pronoun, ambiguous antecedent"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A pronoun is a word used in place of a noun.",
            "The noun that the pronoun is replacing is called the antecedent."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Pronouns help writers to avoid repetition, but when a pronoun is vague, readers have difficulty determining what or whom it refers to.",
            "A pronoun may be vague if there is more than one noun that it could refer to or if there is not a clear antecedent to which the pronoun refers.",
            "To correct a vague pronoun, you can change the vague pronoun to a noun.",
            "Appropriate pronoun usage is essential to the enrichment of conventional language."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify and correct a vague pronoun.",
            "Demonstrate clear pronoun-antecedent agreement."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "pronoun",
        "antecedent",
        "vague pronoun",
        "ambiguous antecedent"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.6.1e",
      "description": "Recognize variations from standard English in their own and others' writing and speaking, and identify and use strategies to improve expression in conventional language. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: variations, standard English, expression, conventional language, grammar, usage, communication"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The correct use of grammar and usage is essential in order for a reader to understand what you have written."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Effective communication of ideas when writing or speaking relies on the appropriate usage of the conventions of standard English."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Identify and correct variations of standard English in own and others' writing and speaking."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "variations",
        "standard English",
        "expression",
        "conventional language",
        "grammar",
        "usage",
        "communication"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.6.2a",
      "description": "Use punctuation (commas, parentheses, dashes) to set off nonrestrictive/parenthetical elements. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Commas are used to separate items in a series.",
            "Commas are used to separate an introductory element from the rest of the sentence.",
            "A comma is used to set off the words yes and no.",
            "A comma is used to set off a tag question from the rest of the sentence.",
            "A comma is used to indicate direct address.",
            "A comma is used before a coordinating conjunction in a compound sentence.",
            "Commas and quotation marks are used to mark direct speech and quotations from a text.",
            "Commas and quotation marks are used in dialogue."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Nonrestrictive and parenthetical elements contain extra information that is interesting but not absolutely necessary to the meaning of the sentence.",
            "Commas can be used to enclose nonrestrictive and parenthetical elements from the rest of the sentence.",
            "Parenthesis can be used to set off nonrestrictive and parenthetical elements from the rest of the sentence.",
            "Dashes can be used to add emphasis, set off a new thought, or show a sudden change in thinking in a sentence."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use commas, parentheses, and dashes to set off nonrestrictive and/or parenthetical elements."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.6.2b",
      "description": "Spell correctly. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Spell, reference materials, appropriate usage"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to consult reference materials, as needed, to check the spelling of a word."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Effective communication of ideas when writing or speaking relies on the appropriate usage of the conventions of standard English."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Spell grade-level words correctly."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Spell",
        "reference materials",
        "appropriate usage"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Language",
    "reporting_category": "Knowledge of Language",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.6.3a",
      "description": "Vary sentence patterns for meaning, reader/listener interest, and style. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: sentence patterns, meaning, style, declarative sentence, exclamatory sentence, interrogative sentence, imperative sentence, simple sentence, independent clause, compound sentence, comma, coordinating conjunction, semicolon, complex sentence, dependent clause, subordinating conjunction"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.3",
      "grade": null,
      "description": "Apply knowledge of language to understand how language functions in different contexts, to make effective choices for meaning or style, and to comprehend more fully when reading or listening."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A simple sentence contains one independent clause.",
            "A compound sentence contains two independent clauses joined by a comma and a coordinating conjunction or by a semicolon.",
            "A complex sentence contains one independent clause and one or more dependent clauses. The clauses are joined by a subordinating conjunction.",
            "When writing or speaking, sentences should be expanded, combined, or reduced for meaning, reader/listener interest, and style. A declarative sentence makes a statement.",
            "An exclamatory sentence expresses strong emotion.",
            "An interrogative sentence asks a question.",
            "An imperative sentence gives a command or makes a request."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Varying sentence patterns when writing or speaking enhances meaning, keeps the reader/listener interested, and showcases a writer's style."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use various sentence patterns (e.g., simple sentences, compound sentences, complex sentences).",
            "Use different sentence patterns to fit the audience and purpose of their writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "sentence patterns",
        "meaning",
        "style",
        "declarative sentence",
        "exclamatory sentence",
        "interrogative sentence",
        "imperative sentence",
        "simple sentence",
        "independent clause",
        "compound sentence",
        "comma",
        "coordinating conjunction",
        "semicolon",
        "complex sentence",
        "dependent clause",
        "subordinating conjunction"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Language",
    "reporting_category": "Knowledge of Language",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.6.3b",
      "description": "Maintain consistency in style and tone. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: formal language, informal language, audience, style, tone, maintain, consistent, consistency"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.3",
      "grade": null,
      "description": "Apply knowledge of language to understand how language functions in different contexts, to make effective choices for meaning or style, and to comprehend more fully when reading or listening."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The use of formal English or informal English is dependent upon the context of the audience to whom you are writing and/or speaking."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The style and tone in writing and speaking need to align to the purpose for writing or speaking.",
            "Style refers to the way writing is put together. It refers to the choice of sentence patterns and words.",
            "Tone refers to how something is said or written. Tone shows the attitude of the writer/speaker toward his or her subject and/or reader. The tone may be serious, humorous, logical, emotional, etc.",
            "When writing or speaking, it is important to be consistent in style and tone."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Establish a specific style and tone and maintain that style and tone throughout his piece of writing.",
            "The style and tone of a student's writing and/or speaking should match his or her purpose for communicating."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "formal language",
        "informal language",
        "audience",
        "style",
        "tone",
        "maintain",
        "consistent",
        "consistency"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.6.4a",
      "description": "Use context (e.g., the overall meaning of a sentence or paragraph; a word's position or function in a sentence) as a clue to the meaning of a word or phrase. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: context, definition, example, restatement, cause/effect, comparison/contrast, position, function"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown or multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Context clues are words and phrases in the text that provide hints to a word's meaning.",
            "There are several types of context clues readers can look for when trying to figure out unfamiliar words or phrases. Many of the types have signal words.",
            "o Definition (e.g., is, means, are, or)",
            "o Example (e.g., such as, like, for example)",
            "o Restatements (e.g., or, that is, in other words, which is)",
            "o Cause/effect (e.g., as a result, because)",
            "o Comparison/contrast (e.g., although, similarly, like, unlike)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The overall meaning of a sentence or a paragraph can be used to determine the meaning of a word or phrase.",
            "A word's position and/or function in a sentence can be used to derive word meaning."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use the overall context of sentence or paragraph to determine the meaning of an unknown word or phrase.",
            "Use a word's position and function in a sentence to determine the meaning of an unknown word or phrase."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "context",
        "definition",
        "example",
        "restatement",
        "cause/effect",
        "comparison/contrast",
        "position",
        "function"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.6.4b",
      "description": "Use common, grade-appropriate Greek or Latin affixes and roots as clues to the meaning of a word (e.g., audience, auditory, audible). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: affix, prefix, suffix, root"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown or multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Adding an affix (prefix or suffix) to a root word forms many English words.",
            "The root of a word is its basic meaning before an affix is added.",
            "A prefix is a word part added to the beginning of a root to change its meaning.",
            "A suffix is a word part added to the end of a root to change its meaning."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The meanings of grade-appropriate Greek or Latin roots in order to use their meanings as a clue to determine the meaning of unknown words.",
            "o Example: aud means \"hear\"",
            "The meanings of grade-appropriate Greek and Latin affixes to use their meanings as a clue to determine unknown words.",
            "o Examples:",
            "-ible means \"can be done\"",
            "-ence means \"state of\"",
            "-ory means \"quality of\""
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Demonstrate knowledge of the meaning of grade-appropriate roots.",
            "Demonstrate knowledge of the meaning of grade-appropriate Greek or Latin prefixes.",
            "Demonstrate knowledge of the meaning of grade-appropriate Greek or Latin suffixes.",
            "Use Greek and Latin affixes and roots to derive word meaning."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "affix",
        "prefix",
        "suffix",
        "root"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.6.4c",
      "description": "Consult reference materials (e.g., dictionaries, glossaries, thesauruses), both print and digital, to find the pronunciation of a word or determine or clarify its precise meaning or its part of speech. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: reference materials, dictionary, pronunciation, part of speech, definition, glossary, thesaurus, synonym, antonym"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown or multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Reference materials are print or digital resources that give factual information about a word or topic.",
            "A dictionary lists words in alphabetical order. Each entry contains the word's pronunciation, part of speech, and definition(s).",
            "A glossary is an alphabetical list of words that are used in a book. The glossary also contains the word's pronunciation and part of speech, but the glossary will only provide the definition of the word as it is used in the book.",
            "A thesaurus lists synonyms and antonyms for words."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Words can have more than one definition and can function as more than one part of speech.",
            "When reading and writing, consult a reference material to determine or clarify a word's meaning or part of speech."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Consult a dictionary, either print or digital, to confirm the meaning of a word and to find its pronunciation and part of speech.",
            "Consult a glossary of a book, either print or digital, to find a word's pronunciation, part of speech, and to determine the word's meaning in that particular book.",
            "Consult a thesaurus, either print or digital, to find synonyms and antonyms of a word."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "reference materials",
        "dictionary",
        "pronunciation",
        "part of speech",
        "definition",
        "glossary",
        "thesaurus",
        "synonym",
        "antonym"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.6.4d",
      "description": "Verify the preliminary determination of the meaning of a word or phrase (e.g., by checking the inferred meaning in context or in a dictionary). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: verify, preliminary, inferred, context"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown or multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to determine the meaning of an unknown word using context clues.",
            "How to consult reference materials to determine the meaning of a word."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Verifying the preliminary determination of the meaning of a word or phrase by checking the inferred meaning in context or in a dictionary ensures that you are using words correctly when writing or speaking.",
            "Effective readers, writers, and speakers use knowledge of language to acquire, clarify, and appropriately use vocabulary."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine the meaning of a word by checking the inferred meaning in context.",
            "Determine the meaning of a word by checking by checking the inferred meaning in a dictionary."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "verify",
        "preliminary",
        "inferred",
        "context"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.6.5a",
      "description": "Interpret figures of speech (e.g., personification) in context. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: interpret, figures of speech, figurative language, literal, similes, metaphors, compare, personification, attributes, mood, visualize"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Figurative language is language that goes beyond the literal meaning of the words.",
            "How to interpret similes and metaphors in context.",
            "o A simile compares two things using the words like or as.",
            "o A metaphor compares two things by stating that one thing is other."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Personification is a figure of speech that gives human attributes to something that is non-human.",
            "Writers use personification to create mood and to make something easier for the reader to visualize."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Interpret figures of speech in context."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "interpret",
        "figures of speech",
        "figurative language",
        "literal",
        "similes",
        "metaphors",
        "compare",
        "personification",
        "attributes",
        "mood",
        "visualize"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.6.5b",
      "description": "Use the relationship between particular words (e.g., cause/effect, part/whole, item/category) to better understand each of the words. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: relationship, cause, effect, part, whole, item, category, synonym, antonym, homograph, analogy"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to use the relationship between synonyms, antonyms, and homographs to better understand each of the words.",
            "o Synonyms are words that have the same, or nearly the same, meaning.",
            "o Antonyms are words that have opposite meanings.",
            "o Homographs are words that are spelled the same but have different origins, meanings, or pronunciations."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How words are related to one another helps build vocabulary knowledge.",
            "An analogy shows the relationship between two pairs of words.",
            "There are several types of analogies.",
            "o Cause/effect analogies show relationships in which one word in each pair is the cause of the other word.",
            "o Part/whole analogies show relationships in which one word in each pair is a part of the other word.",
            "o Item/category analogies show relationships in which one word in each pair is an item of the category that the other word represents."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Demonstrate the ability to determine the analogous relationship between particular words.",
            "Recognize and use the relationships between particular words to further understand multiple words."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "relationship",
        "cause",
        "effect",
        "part",
        "whole",
        "item",
        "category",
        "synonym",
        "antonym",
        "homograph",
        "analogy"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.6.5c",
      "description": "Distinguish among the connotations (associations) of words with similar denotations (definitions) (e.g., stingy, scrimping, economical, unwasteful, thrifty). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: distinguish, connotation, association, denotation, definition, dictionary, positive, negative, neutral"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to determine the explicit meaning of a word.",
            "How to use word relationships to clarify meaning of a word.",
            "A student should know that a word can have different kinds of meanings."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A word's denotation is its dictionary definition.",
            "A word's connotation is the feeling or association that it suggests.",
            "Connotations can be positive, negative, or neutral."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine the connotations of words with similar denotations.",
            "Choose and use specific words for their connotations to achieve an effect or a specific purpose."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "distinguish",
        "connotation",
        "association",
        "denotation",
        "definition",
        "dictionary",
        "positive",
        "negative",
        "neutral"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "6",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.6.6",
      "description": "Acquire and use accurately grade-appropriate general academic and domain- specific words and phrases; gather vocabulary knowledge when considering a word or phrase important to comprehension or expression. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: academic words, domain-specific words, subtle, precise"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.6",
      "grade": null,
      "description": "Acquire and use accurately a range of general academic and domain-specific words and phrases sufficient for reading, writing, speaking, and listening at the college and career readiness level; demonstrate independence in gathering vocabulary knowledge when considering a word or phrase important to comprehension or expression."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify, understand, and use 5th grade general academic and domain-specific terms.",
            "Certain phrases signal relationships, such as contrast."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Academic words are words that are used routinely in all types of texts. They often represent subtle or precise ways to say relatively simple things.",
            "Domain-specific words are words that are specific to a course of study.",
            "How to use context clues and their knowledge of language to determine a word's meaning in reading, writing, speaking, or listening."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Provide a statement demonstrating accurate meaning and use of grade-appropriate general academic words and phrases.",
            "Use a range of general academic and grade-specific words and phrases accurately.",
            "Correctly use the general academic and domain-specific words that are important to the comprehension of a text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "academic words",
        "domain-specific words",
        "subtle",
        "precise"
      ]
    }
  }
]