[
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.8.1",
      "description": "Cite the textual evidence that most strongly supports an analysis of what the text says explicitly as well as inferences drawn from the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.1",
      "grade": null,
      "description": "Read closely to determine what the text says explicitly and to make logical inferences from it; cite specific textual evidence when writing or speaking to support conclusions drawn from the text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to focus closely and critically on content in a literary text.",
            "How to form a comprehensive understanding or analysis of what they are reading and for selecting key evidence for use in writing or speaking.",
            "How to cite several pieces of evidence from the text in the form of specific details or examples to support an analysis of what the text says explicitly.",
            "How to cite several pieces of evidence from the text in the form of specific details or examples to support an analysis of inferences drawn from the text.",
            "How to refer directly to details and examples in a text and/or quote accurately from a text when explaining what happens How to refer directly to details and examples in a text and/or"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors purposely include specific details and/or examples in literary texts and/or omit specific details and/or examples from literary texts to prompt students to ask and answer questions about the text.",
            "That the details and examples authors provide in a literary text reveal meaning.",
            "That authors state information explicitly in a text to allow students to make a direct connection and/or implicitly to require students to draw inferences from a text.",
            "That authors provide evidence to support an analysis of what the text says explicitly and/or to support"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, and annotate a literary text to comprehend what the author says explicitly and to discover the levels of meaning embedded deeply within complex literary texts.",
            "Conduct self-checks to ensure comprehension of the text, persevere through difficult sections, examine unfamiliar words or phrases and attempt to uncover the meaning of unknown words.",
            "Provide textual evidence that most strongly supports analysis of what the text says explicitly.",
            "Provide textual evidence that most strongly supports analysis of inferences drawn from the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Literature",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.8.3",
      "description": "Analyze how particular lines of dialogue or incidents in a literary text propel the action, reveal aspects of a character, or provoke a decision. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.3",
      "grade": null,
      "description": "Analyze how and why individuals, events, or ideas develop and interact over the course of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to provide an analysis of how two or more story elements interact.",
            "That a character's development impacts the plot.",
            "How to describe how a plot develops through events or episodes.",
            "How to analyze plot structure and development (e.g., conflict and resolution, rising and falling action, subplots) and determine how events advance the plot, explain previous events, and foreshadow later events.",
            "How to describe how characters respond to challenges over the course of a text.",
            "How to describe how characters change over the course of a text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That dialogue is conversation between characters.",
            "That authors intentionally include particular lines of dialogue to propel the action, reveal aspects of a character, or provoke a decision of a literary text.",
            "How particular lines of dialogue may explicitly propel the action, reveal aspects of a character, or provoke a decision of a literary text.",
            "How particular lines of dialogue may implicitly propel the action, reveal aspects of a character, or provoke a decision of a literary text.",
            "That authors intentionally include particular incidents in a story to propel the action, reveal aspects of a character,"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Provide an analysis of how particular lines of dialogue propel the action in a literary text.",
            "Provide an analysis of how particular lines of dialogue show what a character is like.",
            "Provide an analysis of how particular lines of dialogue provoke a character to make a decision.",
            "Provide an analysis of how key incidents in a story propel the action.",
            "Provide an analysis of how key incidents in a story show what a character is like.",
            "Provide an analysis of how key incidents in a story provoke a character to make a decision.",
            "Provide an analysis discussing the importance and influence of setting on characters, plot,"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.8.4",
      "description": "Determine the meaning of words and phrases as they are used in a text, including figurative and connotative meanings; analyze the impact of specific word choices on meaning and tone, including analogies or allusions to other texts. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.4",
      "grade": null,
      "description": "Interpret words and phrases as they are used in a text, including determining technical, connotative, and figurative meanings, and analyze how specific word choices shape meaning or tone."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That words and phrases with similar denotative meanings can carry different connotative meanings (e.g., sulk/brood; ally/comrade/best friend) in literary texts.",
            "That authors purposely choose words possessing strong, weak, positive, negative, or neutral connotations to achieve particular effects in a text and in the reader.",
            "That connotation refers to a reader's emotion or association connected with a word.",
            "That authors purposely use figurative language to achieve particular effects in a section of a text.",
            "That sound devices (e.g., repetition, rhyme scheme, alliteration, assonance, consonance, onomatopoeia, rhythm) help to achieve"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "What a word means in a given context, focusing on what the author is trying to do with the language.",
            "That authors purposely use figurative language to achieve particular effects in a section of a text.",
            "That authors purposely choose words possessing strong, weak, positive, negative, or neutral connotations to achieve particular effects in a text.",
            "That analogies are comparisons. In literature, an analogy is expressed using figurative language (e.g., metaphor, simile). In effect, an analogy is a way of comparing two things that have a feature in common but are otherwise unlike."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze and annotate a text for evidence of the meanings of words and phrases as they are used in a text.",
            "Closely read, analyze and annotate a text for evidence of the impact of specific word choices on meaning and tone.",
            "Closely read, analyze and annotate a text for evidence of the impact of a specific analogy on meaning and tone.",
            "Closely read, analyze and annotate a text for evidence of the impact of a specific allusion on meaning and tone.",
            "Determine the meaning of words and phrases based on context."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.8.5",
      "description": "Compare and contrast the structure of two or more texts and analyze how the differing structure of each text contributes to its meaning and style. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.5",
      "grade": null,
      "description": "Analyze the structure of texts, including how specific sentences, paragraphs, and larger portions of the text (e.g., a section, chapter, scene, or stanza) relate to each other and the whole."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A text's form and structure provide support for organizing the ideas and deepening understanding of the text.",
            "That authors often use a soliloquy to convey a character's inner thoughts or motivations to the audience.",
            "A soliloquy is an uninterrupted speech delivered by a single character to the audience but not to the other characters in the scene.",
            "A soliloquy can be very poetic and elegant in nature but is meant to be a personal communication of a character's innermost thoughts presented as if the character were thinking aloud."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That identifying the structure of a text and analyzing how the author develops ideas in a text help the reader better understand the meaning and purpose of a text.",
            "That stories, poems (sonnet, soliloquy, haiku, elegy, ode, lyrical), and dramas follow different forms and structures.",
            "That style describes how the author chooses to describe events, objects, and ideas.",
            "An author's word choice, sentence structure, use of figurative language, sentence arrangement, sentence fluency and voice all work together to establish tone, mood, images, and meaning in the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze and annotate two or more texts for evidence of how the differing structure of each text contributes to its meaning and style.",
            "Provide a comparison and contrast of the structure of two or more literary texts.",
            "Provide an analysis of how the differing structure of each text contributes to its meaning and style."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Literature",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.8.6",
      "description": "Analyze how differences in the points of view of the characters and the audience or reader (e.g., created through the use of dramatic irony) create such effects as suspense or humor. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.6",
      "grade": null,
      "description": "Assess how point of view or purpose shapes the content and style of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That point of view influences how the story is told and how the author develops the narrator and other characters (e.g., how Robert Cormier slowly reveals the narrator's reality in I Am the Cheese).",
            "That authors often include characters with opposing points of view for effect (e.g., to present conflict, show how characters see a situation differently).",
            "That authors develop point of view through author's style, tone, word choice, description, dialogue, thoughts, reflection, author or narrator commentary, illustrations.",
            "That authors often direct readers' attention to the exact detail, opinion, or"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That authors present narrators and characters as reliable or unreliable.",
            "That authors use differing points of view of the characters and the audience or reader to create specific effects (e.g., suspense, humor).",
            "That authors create suspense, humor, and other effects through tone, word choice, dialogue, thoughts, figurative language, literary devices, stylistic devices.",
            "That dramatic irony occurs when the audience or reader knows things that the other characters in the book do not know (e.g., the audience/reader knows about the plans of another character or about an awaiting danger)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze and annotate a text for evidence of how differing points of view of the characters and the audience or reader create suspense or humor in a literary text.",
            "Provides an analysis of how one or more differences in the points of view of the characters and the audience and/or reader (e.g., through the use of dramatic irony) create such effects as suspense or humor.",
            "Provide an analysis of how the narrator's point of view and characterization affect the telling of the narrative (e.g., a biased, unreliable, or impaired first-person narrator).",
            "Compare and contrast the effects of different points of"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.8.7",
      "description": "Analyze the extent to which a filmed or live production of a story or drama stays faithful to or departs from the text or script, evaluating the choices made by the director or actors. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.7",
      "grade": null,
      "description": "Integrate and evaluate content presented in diverse media and formats, including visually and quantitatively, as well as in words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That authors purposely use word choice, description, dialogue, thoughts, reflections, author or narrator commentary and illustrations, while directors purposely select lighting, sound, color, or camera focus and angles to achieve specific effects and influence the audience/reader's perceptions.",
            "How performed versions of texts affect audiences differently than the printed version.",
            "How to compare and contrast reading the text of a story, drama, or poem to listening or viewing a performed version, describing how each version affects the reader or viewer differently (e.g., explain whether the suspense is greater in the written or performed version of the text).",
            "How to describe the differences in a written story or drama and a performed story or drama."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How directors may choose to omit, insert, or change parts of a text when directing a film version of the text.",
            "How authors purposely use word choice, style, description, dialogue, thoughts, reflections, author or narrator commentary and illustrations, while directors purposely select lighting, sound, color, or camera focus and angles to achieve specific effects and influence the audience/reader's perceptions.",
            "That performed versions of texts affect audiences differently than the printed version.",
            "That suspense may be greater in the written or performed version of the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, take notes and/or annotate a text for evidence of the extent to which a filmed or live production of a story or drama stays faithful to or departs from the text, noting specific choices made by the director or actors.",
            "Provide an analysis of the extent to which a filmed production of a story or drama stays faithful to or departs from the text or script, including an evaluation of the choices made by the director or actors.",
            "Provide an analysis and evaluation of the choices made by directors, performers, and artists in departing from and/or interpreting the written text or script (e.g., explain differences in what each version emphasizes)",
            "Provide an analysis of how the medium used contributes to the message conveyed in a filmed, performed, or multimedia version"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.8.8",
      "description": "Not applicable to literature. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD:"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.8",
      "grade": null,
      "description": "Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as the relevance and sufficiency of the evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": []
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": []
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": []
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Literature",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.8.9",
      "description": "Analyze how myths, traditional stories, or religious works such as the Bible influence themes, patterns of events, or character types in a modern work, including how the material is rendered new. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Authors often draw inspiration from themes, patterns of events, and character types in other source material.",
            "That stories are influenced by the genre an author chooses for his writing.",
            "That multiple texts in different literary genres may address similar themes or topics.",
            "How reading multiple literary texts addressing a similar theme or topic exposes students to multiple perspectives and points of view.",
            "A specific genre influences the way information is presented in a text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That literary themes have a timeless nature.",
            "How to recognize allusions to and connections between modern literary texts and traditional and classic literature and myths.",
            "A literary text reflects and is influenced by its historical setting."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, take notes and/or annotate a text for evidence of how a modern work of fiction draws on themes, patterns of events, or character types from myths, traditional stories, or religious.",
            "Provide an analysis of a modern literary text draws on themes, patterns of events, and/or character types, including describing how the material is rendered new.",
            "Provide a description of how the material in a modern text is rendered new."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Literature",
    "reporting_category": "Range of Reading and Level of Text Complexity",
    "standard": {
      "type": "Grade-Specific",
      "id": "RL.8.10",
      "description": "By the end of the year, read and comprehend literature, including stories, dramas, and poems, at the high end of grades 6-8 text complexity band independently and proficiently. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: comprehend, stories, dramas, poems, scaffolding, complexity band, independently, proficiently, range"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.10",
      "grade": null,
      "description": "Read and comprehend complex literary and informational texts independently and proficiently."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to self-monitor and adjust understanding of a literary text by visualizing unfamiliar situations, diagramming complex relationships, and applying skills from across the language arts.",
            "How to explain the differences between different genres (e.g., short stories, poetry, drama) based on their characteristics and structural elements.",
            "How to make and check predictions.",
            "How to note important parts of a story."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The complexity of text increases as students progress through grade levels.",
            "The importance of knowing the specific characteristics of different forms of literary texts (e.g., adventure stories, historical fiction, mystery, myths, science fiction, realistic fiction, allegory, parody, satire, drama, graphic novel, play, poetry, sonnet, ode, ballad, epic)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, comprehend, take notes and annotate literary texts of increasing complexity for the purpose of comprehension.",
            "Monitor and adjust understanding of a literary text by recognizing when comprehension becomes unclear and applying corrective strategies automatically, including summarizing, paraphrasing, reviewing previous points, making connections to other texts and prior knowledge, determining word- and sentence-level meaning of confusing passages, and applying skills from across the language arts.",
            "Use knowledge of the characteristics of different forms of literary texts to aid in comprehension of text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "comprehend",
        "stories",
        "dramas",
        "poems",
        "scaffolding",
        "complexity band",
        "independently",
        "proficiently",
        "range"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.8.1",
      "description": "Cite the textual evidence that most strongly supports an analysis of what the text says explicitly as well as inferences drawn from the text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.1",
      "grade": null,
      "description": "Read closely to determine what the text says explicitly and to make logical inferences from it; cite specific textual evidence when writing or speaking to support conclusions drawn from the text"
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to focus closely and critically on content in an informational text.",
            "How to form a thorough understanding or analysis of what they are reading and for selecting key evidence for use in writing or speaking.",
            "How to refer directly to details and examples in a text and/or quote accurately from a text when explaining what a text is about.",
            "How to refer directly to details and examples in a text and/or quote accurately from a text when drawing inferences from a text.",
            "What it means to draw inferences from a text.",
            "How to ask and answer questions to demonstrate understanding of a text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "An analysis is a close examination of the components or structure of a text.",
            "That authors purposely include specific details and/or examples in informational texts and/or omit specific details and/or examples from informational texts to prompt students to ask and answer questions about the text.",
            "That some evidence presented in a text is stronger that other evidences presented.",
            "How to determine which piece of evidence from the text provides the strongest support for an analysis of the text."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read and analyze an informational text to comprehend what the author says explicitly and to discover the layers of meaning that are often embedded within complex informational texts.",
            "Conduct self-checks to ensure comprehension of an informational text, persevere through difficult sections, examine unfamiliar words or phrases and attempt to uncover the meaning of unknown words.",
            "Cite evidence from the text in the form of specific details or examples to support an analysis of what the text says explicitly.",
            "Cite evidence from the text in the form of specific details or examples to support an"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Informational Text",
    "reporting_category": "Key Ideas and Details",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.8.3",
      "description": "Analyze how a text makes connections among and distinctions between individuals, ideas, or events (e.g., through comparisons, analogies, or categories). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.3",
      "grade": null,
      "description": "Analyze how and why individuals, events, or ideas develop and interact over the course of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to analyze the cause-and-effect interactions between individuals, events, and ideas in an informational text (e.g., analyze how ideas influence an individual)",
            "How to analyze how events, ideas, or individuals' actions influence subsequent events or ideas in an informational text (e.g., how Jefferson's Louisiana purchase influenced the development of the United States; how movement of tectonic plates leads to earthquakes)",
            "How to provide a detailed analysis of how a key individual, event or idea is elaborated in a text (e.g., through examples and anecdotes).",
            "How to determine and explain the relationships or"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How causal relationships between events, individuals, and ideas are introduced and developed in an informational text.",
            "The importance of comprehending ideas and processes as they develop in an informational text.",
            "That events, ideas, and actions described in the text influence other events, ideas, and actions.",
            "That events, ideas, and actions described in the text are influenced by other events, ideas, and actions.",
            "The subtle or implied cause-and-effect relationships; recognizing flaws in information presented as a cause and effect."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze and annotate a text for evidence to make connections between individuals, ideas, or events.",
            "Provide an analysis of how a text makes connections among and distinctions between individuals through comparisons, analogies, or categories.",
            "Provide an analysis of how a text makes connections among and distinctions between ideas through comparisons, analogies, or categories.",
            "Provide an analysis of how a text makes connections among and distinctions between events through comparisons, analogies, or categories."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.8.4",
      "description": "Determine the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings; analyze the impact of specific word choices on meaning and tone, including analogies or allusions to other texts. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.4",
      "grade": null,
      "description": "Interpret words and phrases as they are used in a text, including determining technical, connotative, and figurative meanings, and analyze how specific word choices shape meaning or tone."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That words and phrases with similar denotative meanings can carry different connotative meanings (e.g., sulk/brood; ally/comrade/best friend) in informational texts.",
            "That authors purposely choose words possessing strong, weak, positive, negative, or neutral connotations to achieve particular effects in a text and in the reader.",
            "That connotation refers to a reader's emotion or association connected with a word.",
            "That authors purposely use figurative language to achieve particular effects in a section of a text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "What a word means in a given context, focusing on what the author is trying to do with the language.",
            "That authors purposely use figurative language to achieve particular effects in a section of a text.",
            "That authors purposely choose words possessing strong, weak, positive, negative, or neutral connotations to achieve particular effects in a text.",
            "That analogies are comparisons. In informational text, an analogy is expressed using figurative language (e.g., metaphor, simile). In effect, an analogy is a way of comparing two things that"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze and annotate a text for evidence of the meanings of words and phrases as they are used in a text.",
            "Closely read, analyze and annotate a text for evidence of the impact of specific word choices on meaning and tone.",
            "Closely read, analyze and annotate a text for evidence of the impact of a specific analogy on meaning and tone.",
            "Closely read, analyze and annotate a text for evidence of the impact of a specific allusion on meaning and tone.",
            "Determine the meaning of words and phrases based on context."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.8.5",
      "description": "Analyze the structure of a specific paragraph in a text, including the role of particular sentences in developing and refining a key concept. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.5",
      "grade": null,
      "description": "Analyze the structure of texts, including how specific sentences, paragraphs, and larger portions of the text (e.g., a section, chapter, scene, or stanza) relate to each other and the whole."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to provide an analysis of the structure an author uses to organize a text, including how the major sections contribute to the whole and to the development of ideas.",
            "How to provide an analysis of how a particular sentence, paragraph, chapter, or section fits into the overall structure of a text",
            "How to provide an analysis of how a particular sentence, chapter, or section contributes to the development of the ideas",
            "How to compare and contrast the overall structure of events, ideas, concepts, or information in two or more texts.",
            "How to describe the overall structure of events, ideas,"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "Knowing how paragraphs are formed aids in student comprehension and deeper understanding of a text(s).",
            "That individual sentences in a paragraph contribute to the overall concept of the paragraph.",
            "That knowledge of common informational text structures provides support for organizing the ideas and deepening understanding of the text.",
            "That authors use linguistic devices specific to different text structures (complex sentences, correlative conjunctions, specific nouns, verbs, and adjectives)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, and annotate a text for evidence to show the structure of a paragraph.",
            "Closely read, analyze, and annotate a text for evidence to show the role of particular sentences in developing a concept.",
            "Provide a detailed analysis of the structure of a specific paragraph in text, including the role of particular sentences in developing and refining a key concept.",
            "Analyze how an informational text is organized.",
            "Identify major sections and explain how they contribute to the development of larger ideas in the text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Informational Text",
    "reporting_category": "Craft and Structure",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.8.6",
      "description": "Determine an author's point of view or purpose in a text and analyze how the author acknowledges and responds to conflicting evidence or viewpoints. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.6",
      "grade": null,
      "description": "Assess how point of view or purpose shapes the content and style of a text."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "An author's point of view is his position on a topic, idea, individual, event, etc.",
            "How authors develop point of view through author's style, tone, word choice, description, omission of information, inclusion of information, etc.",
            "How authors can direct readers' attention to the exact detail, opinion, idea, emotion, etc., the author wants to stress through his or her style of writing.",
            "How Authors can present information objectively (based on facts) or subjectively (based on opinions and bias).",
            "That bias means having a preconceived opinion or judgment about something.",
            "The ways in which an author's point of view influences content and style.",
            "An author's writing is influenced by his experiences, background, and values."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How authors often acknowledge opposing or conflicting viewpoints in a way that strengthen their own positions.",
            "How authors respond to conflicting evidence and viewpoints by downplaying their importance.",
            "How to continually question the author's viewpoint while reading an argument.",
            "The importance of recognizing whether or not the author addresses readers' concerns or questions.",
            "Ann effective argument directly addresses and responds to conflicting evidence or opposing viewpoints."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, and annotate a text for evidence of an author's point of view.",
            "Closely read, analyze, and annotate a text for evidence of an author's purpose.",
            "Closely read, analyze, and annotate a text for evidence of conflicting information or viewpoints.",
            "Provide a statement of an author's point of view in a text.",
            "Provide a statement of an author's purpose in a text.",
            "Provide an analysis of how the author acknowledges and responds to conflicting evidence.",
            "Provide an analysis of how an author acknowledges and responds to conflicting viewpoints."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.8.7",
      "description": "Evaluate the advantages and disadvantages of using different mediums (e.g., print or digital text, video, multimedia) to present a particular topic or idea. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.7",
      "grade": null,
      "description": "Integrate and evaluate content presented in diverse media and formats, including visually and quantitatively, as well as in words."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How authors purposely use word choice, style, etc., while directors purposely select lighting, sound, color, or camera focus and angles to achieve specific effects and influence the audience/reader's perceptions.",
            "How speakers use intonation, pausing, voice, etc., to achieve specific effects and influence the audience's perceptions.",
            "How performed versions of texts affect audiences differently than the printed version.",
            "How to draw on information from multiple print and digital sources, demonstrating the ability to locate an answer to a question quickly or to solve a problem efficiently."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The importance of interpreting information and data presented visually, quantitatively, and in writing.",
            "How reading and analyzing information from multiple sources helps students to understand a topic better.",
            "How integrating information on a topic from several texts develops a base of knowledge on a subject (e.g., categorize/organize information, compare information, summarize from multiple texts)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, take notes and/or annotate a text for evidence to use in evaluating the advantages and disadvantages of using different mediums to present a particular topic or idea.",
            "Provide an evaluation of the advantages and disadvantages of using different mediums to present a particular topic.",
            "Create a graphic organizer listing the advantages and disadvantages of information from two or more mediums on a particular topic.",
            "Provide an explanation of how the presentation of information in a text contributes to or detracts"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.8.8",
      "description": "Delineate and evaluate the argument and specific claims in a text, assessing whether the reasoning is sound and the evidence is relevant and sufficient; recognize when irrelevant evidence is introduced. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.8",
      "grade": null,
      "description": "Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as the relevance and sufficiency of the evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The difference between sound and unsound reasoning.",
            "How sound reasoning is based on facts, data, credible sources, etc.",
            "How unsound reasoning refers to evidence presented from non-credible sources such as, blogs, self-authored cites, opinions, etc.",
            "That some arguments may not be relevant (not appropriate or not closely connected) to the claim.",
            "That some of the evidence presented may not be sufficient; the argument presented may be weak details that do not provide adequate support for the claim.",
            "That sufficient refers to enough or adequate.",
            "How to identify the speaker's purpose and audience by"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The difference between relevant or irrelevant evidence.",
            "That relevant evidence is deeply connected and significant to the claim(s) and/or argument(s).",
            "That irrelevant evidence does not apply and is insignificant to the claim(s) and/or argument(s).",
            "How to determine whether or not a speaker has provided enough relevant evidence to support his or her argument."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, take notes and/or annotate a text for evidence to use in assessing whether or not the reasoning is sound and the evidence is relevant and sufficient.",
            "Closely read, analyze, take notes and/or annotate a text for evidence to recognize when irrelevant evidence is introduced.",
            "Provide a delineation of the argument and specific claims in a text.",
            "Provide an assessment of whether the reasoning of the argument is sound.",
            "Provide an evaluation of whether the evidence is relevant and sufficient to support the claims."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Informational Text",
    "reporting_category": "Integration of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.8.9",
      "description": "Analyze a case in which two or more texts provide conflicting information on the same topic and identify where the texts disagree on matters of fact or interpretation. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) Journalism A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: compare, contrast, presentation, events, analyze, interpretation, emphasis, topic"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to integrate information from several texts on the same topic in order to write or speak about the subject knowledgably.",
            "How to compare and contrast the most important points and key details presented in two texts on the same topic."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to explain similarities and differences between informational texts on the same topic (purpose, organization, main ideas, viewpoint).",
            "That there are many forms of Informational text/literary nonfiction subgenres.",
            "o Exposition",
            "o Argument",
            "o Functional text",
            "o Personal essays",
            "o Speeches",
            "o Opinion pieces",
            "o Biographies",
            "o Memoirs"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, analyze, take notes and/or annotate a text for evidence of conflicting information and disagreement in two or more texts on the same topic by different authors.",
            "Provide an analysis of a case in which two or more texts provide conflicting information on the same topic and identify where the texts disagree on matter of fact or interpretation.",
            "Describe instances in which authors writing about the same topic disagree or arrive at different conclusions.",
            "Analyze similarities and differences in emphasis and interpretation in informational texts on the same topic."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "compare",
        "contrast",
        "presentation",
        "events",
        "analyze",
        "interpretation",
        "emphasis",
        "topic"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Reading Informational Text",
    "reporting_category": "Range of Reading and Level of Text Complexity",
    "standard": {
      "type": "Grade-Specific",
      "id": "RI.8.10",
      "description": "By the end of the year, read and comprehend literary nonfiction at the high end of the Grades 6-8 text complexity band independently and proficiently. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "R",
      "reporting_category": null,
      "id": "CCR.R.10",
      "grade": null,
      "description": "Read and comprehend complex literary and informational texts independently and proficiently."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to self-monitor and adjust understanding of an informational text by visualizing unfamiliar situations, diagramming complex relationships, and applying skills from across the language arts.",
            "How to explain the differences between text structures (chronological, compare/contrast, problem/solution, description, process order, etc.)",
            "How to note important parts of a text.",
            "How to explain the characteristics and structural elements of different genres of informational text (e.g., argument, exposition, functional texts)."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The complexity of text increases as students progress through grade levels.",
            "An interpretive framework can be applied to works of the same genre.",
            "That literary nonfiction shares characteristics with literature but is based on fact.",
            "That there are several modes of discourse (e.g., narration, description, exposition, and argument).",
            "How a text structure impacts a text's meaning.",
            "How the conventions of a genre influence the text.",
            "The importance of knowing the characteristics of informational text forms include:"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Closely read, comprehend, take notes and annotate literary texts of increasing complexity within the Lexile range of 955-1155 for the purpose of comprehension.",
            "Analyze the characteristics and devices of different genres of informational texts, and describe how the characteristics influence a text",
            "Monitor and adjust understanding of an informational text by recognizing when comprehension becomes unclear and applying corrective strategies automatically, including summarizing, paraphrasing, reviewing previous points, making connections to other texts and prior knowledge,"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.1a",
      "description": "Introduce claim(s), acknowledge and distinguish the claim(s) from alternate or opposing claims, and organize the reasons and evidence logically. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How opposing or alternate claims are acknowledged by writers to strengthen the argument made by the writer and refutes the opposing claim.",
            "How alternate or opposing claims are often presented using subordination through complex sentences; subordination allows the writer to emphasize his claim by deemphasizing the opposing or alternate claim.",
            "That evidence is introduced to provide support for the writer's claim.",
            "That coherence and cohesion aids to the clarity of the writer's idea.",
            "The structure of the text should be based on the purpose of the writing."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The opposing or alternate claims should be distinguished from the writer's claim."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Ensure writing is about a debatable claim.",
            "Provide an introductory claim statement about a topic, idea, or issue under study, including the title, author, and genre (TAG sentence) of the texts from which the writing is related.",
            "Write a statement of the alternate or opposing claim(s) in a way that helps to strengthen his or her claim.",
            "Complete a graphic organizer to organize the reasons and evidence to support his or her claim clearly.",
            "Separate relevant evidence from the text into two groups: (1) evidence that supports the writer's claim or (2) evidence that supports the counterclaim."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.1b",
      "description": "Support claim(s) with logical reasoning and relevant evidence, using accurate, credible sources and demonstrating an understanding of the topic or text. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A well-written claim requires students to have a deep understanding of the topic or text.",
            "That sources are considered credible when they are trustworthy, accurate, and reliable.",
            "How to distinguish between relevant and irrelevant evidence.",
            "That evidence (arguments) should be strategically ordered from least support to greatest support so readers end with the strongest support in their minds.",
            "That there are different ways to present evidence.",
            "o Paraphrasing"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How providing support for claims will convince the reader that the writer has a well-supported interpretation of the claim.",
            "That relevant evidence causes the argument to be more credible."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Evaluate his or her resources for accuracy and credibility and selects evidence that comes from credible sources to use in writing.",
            "Organize evidence into two groups: (1) relevant evidence or (2) irrelevant evidence.",
            "Provide clear reasons and relevant evidence from credible sources as support for claim(s).",
            "Develop an outline of his claim(s) and supporting evidence to ensure understanding of the topic and/or text(s).",
            "Demonstrate an understanding of the text through his or her writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.1c",
      "description": "Use words, phrases, and clauses, to create cohesion and clarify the relationships among claim(s), counterclaims, reasons, and evidence. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That transition words assist writers in developing relationships among claims and reasons.",
            "That there are several types of transition words.",
            "o Agreement, addition, similarity (as a matter of fact, equally, furthermore, of course, by the same token)",
            "o Examples, support, emphasis (in other words, to put it differently, on the positive side, on the negative side, chiefly, notably, most compelling evidence)",
            "o Effect, result, consequence (thus,"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That specific words, phrases, and clauses are used to show the reader how the evidence is connected to the claim.",
            "That cohesion is the connection that allows the sentences and paragraphs to work as a unified piece.",
            "A counterclaim is an alternate or opposing claim; the opposite side of the writer's claim.",
            "That counterclaims are often presented using subordination through complex sentences; subordination allows the writer to emphasize his claim by deemphasizing the opposing or alternate claim."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use transition words, phrases and/or clauses to clarify relationships among claims, reasons, and evidence.",
            "Use transition words, phrases and/or clauses to clarify the relationship with the counterclaim.",
            "Demonstrate cohesion in writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.1d",
      "description": "Establish and maintain a formal style. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: formal style, arguments, support, clams, reasons, relevant evidence"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That formal language should not include words that are used in a casual language. (i.e. euphemisms, slang, biased language, group-specific jargon)",
            "That formal language uses correct grammar and spelling."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The audience determines the level of formality.",
            "That academic writing requires a formal tone."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Develop a response appropriate for the intended audience.",
            "Omit casual language.",
            "Use correct spelling and grammar."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "formal style",
        "arguments",
        "support",
        "clams",
        "reasons",
        "relevant evidence"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.1e",
      "description": "Provide a concluding statement or section that follows from and supports the argument presented. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: concluding statement/ section, arguments, support, claims"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.1",
      "grade": null,
      "description": "Write arguments to support claims in an analysis of substantive topics or texts using valid reasoning and relevant and sufficient evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to provide a concluding statement or section related to the opinion presented.",
            "That conclusions wrap up what has been discussed throughout the paper."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That conclusions address why the reader should align with your position.",
            "That support for the argument(s) presented will convince the reader that the writer has a well-supported interpretation of the claim."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Provide a concluding statement or section that restates the arguments presented to support the claim.",
            "Provide a concluding statement or section that addresses why the reader should align with your position."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "concluding statement/ section",
        "arguments",
        "support",
        "claims"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.2a",
      "description": "Introduce a topic clearly, previewing what is to follow; organize ideas, concepts, and information into broader categories; include formatting (e.g., headings), graphics (e.g., charts, tables), and multimedia when useful to aiding comprehension. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative /explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to introduce a topic clearly, provide a general observation and focus, and group related information logically.",
            "How to include formatting (e.g., heading), illustrations, and multimedia when useful to aiding comprehension.",
            "How to group related information in paragraphs and sections.",
            "That topics should be narrow.",
            "That formats used to signal major divisions throughout the text.",
            "o Headings",
            "o Sections",
            "That graphics (i.e. charts, tables) provide examples for the topic."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The topic must be clear and presented in the introduction.",
            "How including a preview of the information that will be included in the text allows the reader will know what to expect.",
            "That ideas, concepts, and information should be organized into broader categories for audience and purpose using the most effective method.",
            "That ideas can be organized using different methods.",
            "o Definition",
            "o Classification",
            "o Compare/contrast",
            "o Cause/effect",
            "The method of organization will assist in the development of the topic."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Introduce a topic clearly and provide a preview of what is to be presented in the body of the text.",
            "Organize ideas, concepts, and information using a specific organizational method and/or graphic organizer appropriate to the topic.",
            "Include specific formatting, graphics, and/or multimedia when it aids in comprehension."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.2b",
      "description": "Develop the topic with relevant, well-chosen facts, definitions, concrete details, quotations, or other information and examples. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: topic, relevant, well-chosen facts, definitions, concrete details, quotations, examples"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative /explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to develop a topic with facts, definitions, concrete details, quotations, or other information and examples related to the topic.",
            "That definitions provide statements of the exact meaning of a word.",
            "That concrete details are facts that come from the source.",
            "That quotations are words taken from a text or speech and repeated by someone other than the original speaker.",
            "That examples are a model or pattern of something that can be imitated."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How developing a topic will help the reader to understand what the writer is trying to convey.",
            "That relevant facts connected to the topic will aid the reader in comprehending the information the writer is presenting.",
            "That well-chosen facts will aid in the reader's understanding of the topic.",
            "That concrete details about the topic will aid the reader in comprehending the information the writer is presenting.",
            "That quotations about the topic will aid the reader in comprehending the information the writer is presenting.",
            "That examples that are relevant to the topic will aid the reader in comprehending the information the writer is presenting."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Develop the main point(s) (body) of the paper by including relevant, well-chosen facts; definitions; concrete details; quotations or other information and examples retrieved from resources that support the main focus of his paper."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "topic",
        "relevant",
        "well-chosen facts",
        "definitions",
        "concrete details",
        "quotations",
        "examples"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.2c",
      "description": "Use appropriate and varied transitions to create cohesion and clarify the relationships among ideas and concepts. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: appropriate, varied, transitions, cohesion, clarify, relationship, ideas, concepts, informative/explanatory texts"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative /explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That transitions connect ideas and paragraphs.",
            "That transitions connect corresponding paragraphs.",
            "That transitions signal different relationships.",
            "o Exceptions",
            "o Time",
            "o Repetition",
            "o Summary",
            "o Conclusion",
            "o Emphasis",
            "o Examples",
            "o Sequence",
            "That varied transitions will consist of different transitional words.",
            "That cohesion is the connection between the sentences and paragraphs."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That transitions unify writing into a whole piece.",
            "That transitions help readers understand how ideas and paragraphs work together.",
            "That transitions help readers understand that ideas and paragraphs reference one another.",
            "That transitions help readers understand that ideas build from a small point to a larger point.",
            "That transitions create logical progressions for the reader in order to help the writer get the point across.",
            "That cohesion is the connection that allows the sentences and paragraphs to work as a unified piece."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Include transitions that provide logical transitions in informative/explanatory written responses.",
            "Include a variety of transitions informative/explanatory written responses.",
            "Build from a smaller point to a larger point in student's ideas and paragraphs.",
            "Write paragraphs that refer to each other.",
            "Clearly show the relationships among ideas and concepts in the student's informative/explanatory response to the prompt."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "appropriate",
        "varied",
        "transitions",
        "cohesion",
        "clarify",
        "relationship",
        "ideas",
        "concepts",
        "informative/explanatory texts"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.2d",
      "description": "Use precise language and domain-specific vocabulary to inform about or explain the topic. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: precise language, domain-specific vocabulary, inform, topic, audience, purpose for writing"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative /explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That precise language is language that uses the right words to convey the exact message.",
            "That domain specific vocabulary includes words that are specific to certain domain/ area."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That precise language will help the reader understand the writer's topic."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Include language that is specific to the writer's topic, audience, and purpose.",
            "Include domain-specific vocabulary in order to inform or explain the writer's topic."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "precise language",
        "domain-specific vocabulary",
        "inform",
        "topic",
        "audience",
        "purpose for writing"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.2e",
      "description": "Establish and maintain a formal style. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: informative/explanatory, organization, analysis, relevant content, formal style"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative /explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That formal language should not include words that are used in a casual language. (i.e. euphemisms, slang, biased language, group-specific jargon)",
            "That formal language uses correct grammar and spelling."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The audience determines the level of formality.",
            "That academic writing requires a formal tone."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Develop a response appropriate for the intended audience.",
            "Omit casual language.",
            "Use correct spelling and grammar."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "informative/explanatory",
        "organization",
        "analysis",
        "relevant content",
        "formal style"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.2f",
      "description": "Provide a concluding statement or section that follows from and supports the information or explanation presented. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: concluding statement, concluding section, support, information, explanation, informative/explanatory, organization, analysis of relevant content"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.2",
      "grade": null,
      "description": "Write informative /explanatory texts to examine and convey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That conclusions wrap up what has been discussed throughout the paper.",
            "The concluding section should support the information presented."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That conclusions wrap up what has been discussed throughout the paper.",
            "How providing support for the information presented will convince the reader that the information presented is accurate."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Include a concluding statement or section that restates the topic.",
            "Include a concluding statement or section that supports the information presented."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "concluding statement",
        "concluding section",
        "support",
        "information",
        "explanation",
        "informative/explanatory",
        "organization",
        "analysis of relevant content"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.3a",
      "description": "Engage and orient the reader by establishing a context and point of view and introducing a narrator and/or characters; organize an event sequence that unfolds naturally and logically. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well- structured event sequences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to orient the reader by establishing a situation and introducing a narrator and/or characters.",
            "How to organize an event sequence that unfolds naturally.",
            "How to write a narrative in which he or she recounts a well-elaborate event or short sequence of events; includes details to describe actions, thoughts, and feelings; uses temporal words to signal event order; and provides a sense of closure.",
            "A narrative tells a story.",
            "A narrator is the person who tells the story of events.",
            "A narrative includes a setting, characters, and a plot.",
            "The plot of a narrative is made up of the events that take place in a story (e.g., the exposition, rising acting, conflict, climax,"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How establishing a context will let the reader know what the essay is about.",
            "How organizing an event sequence that unfolds naturally and logically will allow the reader the opportunity to get engaged with the piece."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Complete a graphic organizer to plan the context, setting, introduce the characters, and logically sequence the plot.",
            "Develop an engaging context to hook the reader into the narrative.",
            "Establish a point of view.",
            "Determine how he or she will begin the narrative.",
            "Introduce the narrator and characters.",
            "Organize an event sequence that unfolds naturally and logically."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.3b",
      "description": "Use narrative techniques, such as dialogue, pacing, and description, to develop experiences, events, and/or characters. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) Dialogue is important to the development of the A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well- structured event sequences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to use narrative techniques such as dialogue, description, and pacing, to develop experiences and events.",
            "That narrative techniques include dialogue, pacing, and description.",
            "That dialogue is a conversation between two or more people.",
            "How pacing is the manipulation of time.",
            "How pacing moves the events of the narrative forward.",
            "That description is a way to give details about events, people, and experiences.",
            "How to use dialogue and descriptions of actions,"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That narrative techniques such as dialogue, descriptions, and pacing, assist in developing complex characters.",
            "That dialogue, pacing, and description work together and/or individually to drive the action and push the plot toward a resolution/solution.",
            "How pacing is important to a narrative to assist the development of the plot by allowing the events to flow naturally.",
            "That description provides a spoken or written representation of a person, experience or an event."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Include techniques such as dialogue, pacing, and description to develop the characters' experiences.",
            "Include techniques such as dialogue, pacing, and description to develop the events in the plot.",
            "Include techniques such as dialogue, pacing, and description to develop complex characters.",
            "Focus a short time period for the narrative that allows the student to develop the experiences, events, and characters in a complex, engaging manner.",
            "Include pacing that allows the events and experiences to flow and unfold naturally."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.3c",
      "description": "Use variety of transition words, phrases, and clauses to convey sequence and signal shifts from one time frame or setting to another. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well- structured event sequences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That transition words, phrases, and clauses connect ideas and paragraphs.",
            "That transitional words will signal exceptions, time, repetition, summary, or conclusion, emphasis, or give examples.",
            "How sequencing is the order in which things happen."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That transitions unify writing into a whole piece.",
            "That transitions connect ideas and paragraphs.",
            "That transitions connect corresponding paragraphs.",
            "That transition words assist writers in developing relationships among claims and reasons.",
            "That there are many transition words that convey sequence, time, chronology (after, as soon as, before, initially, now, immediately, meanwhile, when we finished, soon after, before long, suddenly, later on)",
            "That transitions help readers understand how ideas and paragraphs work together."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Include a variety of transition words, phrases, and/or clauses that provide logical transitions in their writing.",
            "Annotate his or her writing for inclusion of transitions that link one event and/or paragraph to another are included.",
            "Annotate his or her writing for inclusion of signal shifts from one time frame to another to ensure the plot is moving forward.",
            "Include signal shifts to introduce a flashback if appropriate to the context of the narrative.",
            "Use transition words to link one setting to another in"
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.3d",
      "description": "Use precise words and phrases, relevant descriptive details, and sensory language to convey experiences and events. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well- structured event sequences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to use concrete words and phrases and sensory details to convey experiences and events precisely.",
            "How to provide a sense of closure in a narrative.",
            "That precise language is language that uses the right words to convey the exact message.",
            "That descriptive details convey a clear picture of an idea.",
            "That sensory details are details that deal with the senses."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to choose precise words based on the effect they want to achieve in the reader.",
            "How choosing words for their specific connotations assists the reader in determining the mood of the passage and the tone of the writer.",
            "That tone is how the author chooses to present the writing (e.g., style, word choice).",
            "That there are many possible tones a writer can use (e.g., serious, humorous, amused, angry, playful, neutral, ironic, suspicious, witty).",
            "That mood is the feeling a piece of literature evokes in a reader."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Include words that are precise to convey experiences and events and evoke feelings in the reader.",
            "Include relevant descriptive details to convey experiences and events.",
            "Include sensory language to help create an image in the reader's mind of experiences and events in the narrative.",
            "Annotate his or her writing for precise words, descriptive details, and sensory language.",
            "Give and receive peer feedback on the inclusion of precise words, descriptive details, and sensory language."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Text Types and Purposes",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.3e",
      "description": "Provide a conclusion that follows from the narrated experiences or events. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: provide, conclusion, narrated experiences, narrated events"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.3",
      "grade": null,
      "description": "Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well- structured event sequences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to provide a conclusion that follows the narrated experiences or events."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That conclusions inform the reader of the resolution or solution.",
            "A conclusion brings the narrative to a close (e.g., shows what was learned through the experience or event by the narrator or another character, connects the event to a larger meaning, provides a reflection of the experience or event)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Include a concluding statement or section that follows from the narrated events or experiences and brings the narrative to a close.",
            "Give and receive peer feedback on the inclusion of an appropriate conclusion."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "provide",
        "conclusion",
        "narrated experiences",
        "narrated events"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.4",
      "description": "Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) Determining the audience will be helpful when developing the subject. A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.4",
      "grade": null,
      "description": "Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That coherent writing is logically ordered, well-organized and connected, and easy to understand.",
            "That text structure is how the information within the text is written or organized.",
            "o Narration",
            "o Description",
            "o Process",
            "o Definition",
            "o Division and Classification",
            "o Compare and Contrast",
            "o Analogy",
            "o Cause and Effect",
            "A writer's style is the way he or she chooses language to convey ideas.",
            "That style includes the author's voice, tone, and word choice."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The assigned task must be addressed in the writing.",
            "How considering the purpose of the writing will assist the writer in the organization of the writing."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Present writing in a clear, coherent manner.",
            "Address the assigned task.",
            "Use language appropriate to the task, purpose, and audience.",
            "Give and receive peer feedback on development, organization, style, task, purpose, and audience for a variety of pieces of writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.5",
      "description": "With some guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on how well purpose and audience have been addressed. (Editing for conventions should demonstrate command of Language standards 1-3 up to and including Grade 8 on page 53.) Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.5",
      "grade": null,
      "description": "Use technology, including the internet, to produce and publish writing and to interact and collaborate with others."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A peer is someone who is of equal standing.",
            "The steps of writing include planning, revising, editing, re-writing, or trying a new approach.",
            "How planning allows the student the opportunity to gather ideas, brainstorm, and map out thoughts and make decisions about the content of a piece.",
            "How revising is altering something that has already been written or printed in order to improve, update or make corrections.",
            "How editing is correcting written work, checking for grammar, spelling, or punctuation errors.",
            "The command of the conventions of Standard English grammar and its usage."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How receiving guidance and support from peers and adults will help the development of and strengthen the writing by giving the writer an opportunity to write for an audience.",
            "How using the writing process will help develop the writer's piece.",
            "How using the writing process will help strengthen the writer's writing."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Ask for and receive guidance and support from peers and adults for pieces of writing.",
            "Make change to pieces of writing, based on the feedback from peers and teachers to strengthen writing.",
            "Demonstrate command of the conventions of Standard English grammar and usage.",
            "Demonstrate command of the conventions of Standard English capitalization, punctuation, and spelling.",
            "Request peer or adult feedback on the conventions of standard English and edit pieces of writing accordingly.",
            "Demonstrate knowledge of language and its conventions. capitalization, punctuation, and spelling."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Production and Distribution of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.6",
      "description": "Use technology, including the internet, to produce and publish writing and present the relationships between information and ideas efficiently as well as to interact and collaborate with others. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.6",
      "grade": null,
      "description": "Use technology, including the internet, to produce and publish writing and to interact and collaborate with others."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That link to sources means to include a hyperlink to the website resource used in part/all of the presentation.",
            "How linking the sources to the writing will show the reader the direct connections in the writing.",
            "How citing sources identifies and credits the source from which the information came.",
            "How citing sources will allow the reader to verify that the information given is supported by a reliable source.",
            "That technology consists of electronic and web-based tools and applications used to access, analyze, and evaluate information.",
            "The Internet is a global system of interconnected computer networks."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to produce writing using technology (PowerPoint, Prezi,).",
            "How to publish writing through technology (e.g., classroom blogs, classroom webpages).",
            "How presenting the relationships between the information and ideas will aid the reader in their comprehension of the materials presented.",
            "How interacting and collaborating with others will allow the writer to have an ample amount of information on the topic.",
            "How collaborating with others provides many positive opportunities for students (e.g., make and receive suggestions, assist others and receive"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Produce writing using technology.",
            "Publish their writing through technology.",
            "Type a minimum of three pages in a single sitting.",
            "Present the relationships between information and ideas efficiently.",
            "Collaborate with others to retrieve information and/or publish information.",
            "Provide a link to sources within the presentation/publication.",
            "Cite sources."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.7",
      "description": "Conduct short research projects to answer a question (including a self-generated question), drawing on several sources, and generating additional related, focused questions that allow for multiple avenues of exploration. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Research projects, question, self-generated question, sources, generate, related/focused questions, multiple avenues, exploration"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.7",
      "grade": null,
      "description": "Conduct short as well as more sustained research projects based on focused quotations, demonstrating understanding of the subject under investigation."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to conduct short research projects, using several sources to build knowledge through investigation of different aspects of a topic.",
            "A research project is an organized study to discover facts about a particular topic.",
            "That sources are people, places, or things that provide information.",
            "An inquiry is a request for information.",
            "An investigation is conducted to find out the facts about something."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How researching a topic will answer questions that the reader may have.",
            "How using several sources will provide more support for the research topic.",
            "That several sources will help verify answers to the research questions.",
            "How to explore additional avenues may be explored based on the information found",
            "That exploration is searching for information or resources.",
            "How to utilize an appropriate standard format for giving credit to the authors they are citing, such as the Modern Language Association (MLA) or the American Psychological Association (APA)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Conduct short research projects that answer a question.",
            "Use several sources when conducting research.",
            "Generate additional questions that will allow multiple avenues to be explored.",
            "Use a graphic organizer to organize and maintain the information from resources."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Research projects",
        "question",
        "self-generated question",
        "sources",
        "generate",
        "related/focused questions",
        "multiple avenues",
        "exploration"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.8",
      "description": "Gather relevant information from multiple print and digital sources; using search terms effectively; assess the credibility and accuracy of each source; and quote or paraphrase the data and conclusions of others while avoiding plagiarism and following a standard format for citation. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.8",
      "grade": null,
      "description": "Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning as well as the relevance and sufficiency of the evidence."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to recall relevant information from experiences or gather relevant information from print and digital sources.",
            "That digital sources are sources that are available in electric form, readable and manipulated by computer.",
            "How to summarize or paraphrase information in notes and finished work.",
            "How to provide a list or sources.",
            "How to quote a source correctly within his or her writing."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That information can be gathered from print and digital sources.",
            "That sources are considered credible when they are trustworthy, accurate, and reliable.",
            "That paraphrase means to rephrase an author's idea in different words.",
            "That information from sources should be used without plagiarizing.",
            "That plagiarism is the use of ideas or writings of another author, representing them as one's original work.",
            "How providing bibliographic information about sources will give the author of the information credit. Quotes are a repeat or copy of"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Gather information from several print and digital sources.",
            "Assess the credibility of the source by the author, the author's purpose, and the date of the information.",
            "Quote directly from a source and provide credit to the author by providing basic bibliographic information using an appropriate standard format.",
            "Paraphrase information from others while avoiding plagiarism and providing basic bibliographic information using an appropriate standard format."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.9a",
      "description": "Apply Grade 8 Reading standards to literature (e.g., \"Analyze how a modern work of fiction draws on themes, patterns of events, or character types from myths, traditional stories, or religious works such as the Bible, including describing how the material is rendered new\"). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to compare and contrast a fictional portrayal of a time, place, or character and a historical account of the same period as a means of understanding how authors of fiction use or alter history.",
            "How to compare and contrast texts in different forms or genres [e.g., stories and poems; historical novels and fantasy stories] in terms of their approaches to similar themes and topics.",
            "How to compare and contrast two or more characters, settings, or events in a story or drama, drawing on specific details in a text.",
            "How to describe in depth a character, setting, or event in a story or drama, drawing on specific details in a text."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How evidence to support analysis, reflection, or research must be retrieved from literary texts."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Provide a written response to questions based on Reading for Literature Standards 2-9.",
            "Support written responses to questions based on Reading for Literature Standard 1.",
            "Include evidence from literary texts that supports analysis, reflection, and research."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Research to Build and Present Knowledge",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.9b",
      "description": "Apply Grade 8 Reading standards to literary nonfiction and/or informational texts (e.g., \"Trace and evaluate the argument and specific claims in a text, assessing whether the reasoning is sound and the evidence is relevant and sufficient to support the claims\"). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.9",
      "grade": null,
      "description": "Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to trace and evaluate the argument and specific claims in a text, assessing whether the reasoning is sound and the evidence is relevant and sufficient to support the claims.",
            "How to trace and evaluate the argument and specific claims in a text, distinguishing claims that are supported by reasons and evidence from claims that are not.",
            "How to explain how an author uses reasons and evidence to support particular points in a text, identifying which reasons and evidence support which point(s).",
            "That evidence is information that shows, proves, or gives reasons for making a judgment."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That evidence to support analysis, reflection, or research must be retrieved from informational texts."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Provide a written response to questions based on Reading for Information and Reading for Literature Standards 2-9.",
            "Support written responses to questions based on Reading for Information and Reading for Literature Standard 1.",
            "Include evidence gather from informational texts that supports analysis, reflection, and research."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Writing",
    "reporting_category": "Range of Writing",
    "standard": {
      "type": "Grade-Specific",
      "id": "W.8.10",
      "description": "Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) Produce writing for a range of audiences. KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: routinely, extended time frames, shorter time frames, discipline-specific tasks, purposes, audiences"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Writing",
      "reporting_category": null,
      "id": "CCR.W.10",
      "grade": null,
      "description": "Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of tasks, purposes, and audiences."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That routine is a sequence of actions regularly followed.",
            "That time frames are periods of time.",
            "That research is the careful investigation or study of a topic.",
            "That reflection is done to consider the thoughts on a topic or literary work.",
            "That revision is a step in the writing process used to correct or improve the original work.",
            "That single sitting is a limited period of time without stopping.",
            "That discipline-specific tasks are tasks related to a specific branch of knowledge.",
            "That purpose is the intended or desired result of a piece of written or spoken material.",
            "That audiences are the people for whom a selection is written or performed."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How writing should be done regularly.",
            "How writing will have to be produced during different time frames.",
            "How writing will be produced for a range of discipline-specific tasks.",
            "How writing will be produced for a range of purposes.",
            "How writing will be produced for a range of audiences."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Write routinely over extended time frames and shorter time frames.",
            "Produce writing for a range of discipline-specific tasks.",
            "Produce writing for a range of purposes."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "routinely",
        "extended time frames",
        "shorter time frames",
        "discipline-specific tasks",
        "purposes",
        "audiences"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.8.1a",
      "description": "Come to discussions prepared, having read or researched material under study; explicitly draw on that preparation by referring to evidence on the topic, text, or issue to probe and reflect on ideas under discussion. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: discussion, researched, evidence, probe"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A good communicator is able to express his or her ideas effectively and listen actively.",
            "How to come to discussions prepared, having read required material.",
            "How to use evidence to support ideas shared in a discussion."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That sometimes it is necessary to prepare for a discussion by researching the topic, text, or issue to be discussed.",
            "That reading required material prepares them for discussion of the text.",
            "How to identify key ideas from researched material on the topic, text, or issue under discussion.",
            "How to use evidence to support ideas shared in a discussion.",
            "How to formulate comments, questions, and responses on ideas under discussion."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Provide evidence of reading/studying required material through note taking and/or annotation of the text.",
            "Participate in discussions on the required material, citing evidence from the text to support comments on the text.",
            "Ask questions that require a deeper probing of ideas presented in the text.",
            "Provide comments that offer a differing perspective or reflection of the topic or ideas under discussion.",
            "Develop comments, questions, and responses based on evidence."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "discussion",
        "researched",
        "evidence",
        "probe"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.8.1b",
      "description": "Follow rules for collegial discussions and decision-making, track progress toward specific goals and deadlines, and define individual roles as needed. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: collegial, discussion, decision-making, track, goals, deadlines, roles"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to follow agreed-upon rules of a collegial discussion.",
            "The importance of setting goals and deadlines for collegial discussions.",
            "How define individual roles for group discussions."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to use the rules for collegial discussions and decision-making.",
            "How to set goals and deadlines, and then track progress.",
            "How to assign and assume individual roles in a discussion."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Continually demonstrate the ability to follow established rules for participating in collegial discussions (e.g., listen actively and attentively, do not monopolize discussion, ask for clarification, respect every member)",
            "Remain on task and track progress toward achieving the instructional goal(s) set forth by the teacher within the established time frame during a collegial discussion.",
            "Participate in small group discussions and effectively carry out assigned role (e.g., leader, recorder, reporter, illustrator, time keeper)."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "collegial",
        "discussion",
        "decision-making",
        "track",
        "goals",
        "deadlines",
        "roles"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.8.1c",
      "description": "Pose questions that connect the ideas of several speakers and respond to others' questions and comments with relevant evidence, observations, and ideas. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: pose, connect, relevant, evidence, observations"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to pose questions that elicit elaboration.",
            "How to respond to others' questions and comments with relevant observations and ideas.",
            "How bring a discussion back on topic as needed."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How create questions that connect the ideas of several speakers.",
            "How to respond to questions and comments with relevant evidence, observations, and ideas."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Ask questions that connect the ideas of several classmates in small group or whole group settings.",
            "Answer questions about a topic, text, or issue under discussion by providing relevant evidence, observations, and ideas from the text in small group or whole group settings."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "pose",
        "connect",
        "relevant",
        "evidence",
        "observations"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.8.1d",
      "description": "Acknowledge new information expressed by others, and, when warranted, qualify or justify their own views in light of the evidence presented. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.1",
      "grade": null,
      "description": "Prepare for and participate effectively in a range of conversations and collaborations with diverse partners, building on others' ideas and expressing their own clearly and persuasively."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to acknowledge new information expressed by others.",
            "How to modify his or her own views when warranted.",
            "How to demonstrate understanding of multiple perspectives by reflecting on the ideas expressed.",
            "That group discussions can be a powerful way to gain new understanding.",
            "That reflecting and paraphrasing information helps you better understand the key ideas expressed in a discussion.",
            "That paraphrasing means to express the meaning of"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to consider the key ideas presented by others in a discussion.",
            "That it is important to allow your views to be flexible.",
            "How to use evidence to qualify or justify personal viewpoints."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Review new information expressed by classmates in one-on-one, small group, or whole group settings.",
            "Reflect on others' ideas and, when warranted, qualifies and justifies his own views in light of the evidence presented in one-on-one, small group, or whole group settings."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.8.2",
      "description": "Analyze the purpose of information presented in diverse media and formats (e.g., visually, quantitatively, orally) and evaluate the motives (e.g., social, commercial, political) behind its presentation. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.2",
      "grade": null,
      "description": "Integrate and evaluate information presented in diverse media and formats, including visually, quantitatively, and orally."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify and analyze the main idea and supporting details presented in a variety of media and formats.",
            "That the ideas presented in diverse media and formats should help to clarify the topic, text, or issue under study.",
            "How to develop a stronger understanding of the topic, text, or issue under study by interpreting information presented in diverse media and formats.",
            "How interpreting information requires students to attend closely to the format in which the information is presented.",
            "How interpreting information means explaining what the information means.",
            "That diverse media and formats refer to the different types of media and formats available."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That there are various purposes for presenting information to an audience.",
            "That information can be presented objectively or subjectively.",
            "That information presented objectively is unbiased and not influenced by the presenter's opinions or feelings.",
            "That information presented subjectively is biased and is influenced by the presenter's personal feelings, tastes, or opinions.",
            "That presenters show their bias or subjectivity in various ways (e.g., word choice, intonation, pauses in speaking, omitted information, added information, facial expressions, body language)."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine the purpose of the information being presented in a variety of media and formats.",
            "Evaluate the presenter's motives.",
            "Analyze a presentation for evidence of bias or subjectivity.",
            "Analyze the main idea and details of the information presented to evaluate the motives behind the presentation.",
            "Participate in a discussion of how information presented in different media forms and formats has different purposes and motives.",
            "Discuss and explain how visual, quantitative, and oral formats contribute differently to a topic, the presenter's purpose, and the presenter's motive.",
            "Paraphrase the information presented in diverse media and formats to determine objectivity or subjectivity."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Speaking and Listening",
    "reporting_category": "Comprehension and Collaboration",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.8.3",
      "description": "Delineate a speaker's argument and specific claims, evaluating the soundness of the reasoning and relevance and sufficiency of the evidence and identifying when irrelevant evidence is introduced. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.3",
      "grade": null,
      "description": "Evaluate a speaker's point of view, reasoning, and use of evidence or rhetoric."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The difference between sound and unsound reasoning.",
            "That sound reasoning is based on facts, data, credible sources, etc.",
            "That unsound reasoning refers to evidence presented from non-credible sources such as, blogs, self-authored cites, opinions, etc.",
            "That some arguments may not be relevant (not appropriate or not closely connected) to the claim.",
            "That some of the evidence presented may not be sufficient; the argument presented may be weak details that do not provide adequate support for the claim.",
            "That sufficient refers to enough or adequate.",
            "How to identify the speaker's purpose and audience by analyzing the content and delivery."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The difference between relevant or irrelevant evidence.",
            "That relevant evidence is deeply connected and significant to the claim(s) and/or argument(s).",
            "That irrelevant evidence does not apply and is insignificant to the claim(s) and/or argument(s).",
            "How to determine whether or not a speaker has provided enough relevant evidence to support his or her argument."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Provide an outline of a speaker's claim(s) and supporting argument(s) (main points).",
            "Provide an evaluation of whether or not a claim is supported by reasons and evidence.",
            "Provide an evaluation of whether or not the evidence and reasoning presented is sound.",
            "Provide an evaluation of whether or not the evidence presented is relevant and sufficient.",
            "Create a list of all evidence and determine whether or not each piece is relevant to the claim(s) and/or argument(s) presented."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.8.4",
      "description": "Present claims and findings, emphasizing salient points in a focused, coherent manner with relevant evidence, sound valid reasoning, and well-chosen details; use appropriate eye contact, adequate volume, and clear pronunciation. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.4",
      "grade": null,
      "description": "Present information, findings, and supporting evidence such that listeners can follow the line of reasoning and the organization, development, and style are appropriate to task, purpose, and audience."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to determine salient points and pertinent descriptions, facts, details, and examples in order to emphasize them in a presentation.",
            "How to arrange claims, findings, salient points, pertinent descriptions, facts, details, and examples in a focused, coherent manner.",
            "A salient point refers to a prominent or obvious detail or feature.",
            "That coherent manner means to express the salient points in a clear, logical and well-organized way.",
            "How to plan and deliver presentations.",
            "How to sequence ideas logically."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to choose relevant evidence to support his or her claim.",
            "How to determine if reasoning is sound and valid.",
            "That valid reasoning refers to reasoning that is fair, logical, and reasonable.",
            "How to choose details that support his or her claims and findings."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Present claims and findings, emphasizing salient points in a focused, coherent manner with relevant evidence, sound valid reasoning, and well-chosen details.",
            "Determine whether or not the evidence presented is relevant to the claim or findings.",
            "Determine whether or not the reasoning presented is sound and valid.",
            "Select relevant and valid evidence, reasoning, and details to support claims and findings.",
            "Use appropriate eye contact, adequate volume, and clear pronunciation when presenting."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.8.5",
      "description": "Integrate multimedia and visual displays into presentations to clarify information, strengthen claims and evidence, and add interest. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.5",
      "grade": null,
      "description": "Make strategic use of digital media and visual displays of data to express information and enhance understanding of presentations."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "Which parts of his or her presentation could use clarification or emphasis.",
            "How to select multimedia components/visual displays that add meaning to his or her presentation.",
            "A salient point refers to a prominent or obvious detail or feature.",
            "How to identify a speaker's claim(s) and explain how each claim is supported by the argument or arguments the speaker makes (the evidence).",
            "That a speaker uses reasons, facts, statistics, details, etc. to support his or her arguments for a claim or claims."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How to integrate multimedia and visual displays to clarify information in his presentation.",
            "That integrating multimedia and visual displays is one way to strengthen his or her claims and evidence.",
            "Which parts of his or her presentation could use additional interest."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Create and/or select multimedia components that help to clarify information given in his or her oral presentation, strengthen claims and evidence, and add interest.",
            "Design and create a visual display to include in an oral presentation that helps to clarify claims and findings and emphasize salient points.",
            "Determine whether or not a multimedia component or visual display strengthens or weakens claims."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Speaking and Listening",
    "reporting_category": "Presentation of Knowledge and Ideas",
    "standard": {
      "type": "Grade-Specific",
      "id": "SL.8.6",
      "description": "Adapt speech to a variety of contexts and tasks, demonstrating command of formal English when indicated or appropriate. (See Grade 8 Language standards 1 and 3 for specific expectations.) Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Speaking and Listening",
      "reporting_category": null,
      "id": "CCR.SL.6",
      "grade": null,
      "description": "Adapt speech to a variety of contexts and communicative tasks, demonstrating command of formal English when indicated or appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That language should be adjusted depending on whom he or she is speaking to and on what the specific occasion, context or task is."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That language should be adjusted depending on audience and the specific occasion, context or task.",
            "How to determine if formal or informal English is appropriate in a given setting and audience."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Appropriately adapt speech for a variety of contexts and tasks.",
            "Determine when formal or informal language should be used based on audience, context, and task.",
            "Demonstrate correct usage of formal English when indicated."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.8.1a",
      "description": "Explain the function of verbals (gerunds, participles, infinitives) in general and their function in particular sentences. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "A noun names a person, place, or thing, or idea.",
            "An adjective modifies a noun.",
            "An adjective answers the questions which ones, what kind, and how many.",
            "An adverb modifies a verb, adjective, or another adverb.",
            "An adverb answers the questions when, where, why, and how.",
            "An action verb expresses action that a noun can do.",
            "A linking verb connects the subject to additional information in the sentence about the subject."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That gerunds, participles, and infinitives are verbals.",
            "A verbal is a word that is formed from a -ing verb but functions as a noun, adjective, or adverb in a sentence.",
            "A gerund begins with an -ing verb but acts as a noun.",
            "o A gerund phrase begins with a gerund (an -ing verb) and will include other modifiers and/or objects.",
            "o A gerund or gerund phrase functions as a noun - as a subject, predicate nominative, direct object or object of the preposition.",
            "A participle is formed by using the present or past participle of a verb.",
            "o A present participle ends in -ing.",
            "o A past participle ends in -ed or -en."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use and explain the functions of gerunds or gerund phrases in general and their function in particular sentences.",
            "Use and explain the functions of participles and participial phrases in general and their function in particular sentences.",
            "Use and explain the functions of infinitives and infinitive phrases in general and their function in particular sentences."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.8.1b",
      "description": "Form and use verbs in the active and passive voice. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: verbs, active voice, passive voice"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "The subject of a sentence is the person, place, thing, or idea that is doing or being something.",
            "An action verb expresses action that a noun can do."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That verb voice describes how a verb relates to its subject.",
            "The subject performs the action of the verb in the active voice.",
            "The subject receives the action expressed by the verb in the passive voice."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Form and use verbs in the active and passive voice."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "verbs",
        "active voice",
        "passive voice"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.8.1c",
      "description": "Form and use verbs in the indicative, imperative, interrogative, conditional, and subjunctive mood. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Action verb, linking verb, auxiliary verb, indicative mood, imperative mood, interrogative mood, conditional mood, subjunctive mood"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "An action verb expresses action that a noun can do.",
            "A linking verb connects the subject to additional information in the sentence about the subject.",
            "That auxiliary verbs are used with main verbs to create verb phrases."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That verbs in the indicative mood are used to express a fact or opinion.",
            "That verbs in the imperative mood are used to give orders or to make a request.",
            "That verbs in the interrogative mood are used to ask questions.",
            "That verbs in the conditional mood are used to express uncertainty.",
            "That verbs in the subjunctive mood are used to express something contrary to the fact or make a suggestion."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Form and use verbs in the indicative mood.",
            "Form and use verbs in the imperative.",
            "Form and use verbs in the interrogative mood.",
            "Form and use verbs in the conditional mood.",
            "Form and use verbs in the subjunctive mood."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Action verb",
        "linking verb",
        "auxiliary verb",
        "indicative mood",
        "imperative mood",
        "interrogative mood",
        "conditional mood",
        "subjunctive mood"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.8.1d",
      "description": "Recognize and correct inappropriate shifts in verb voice and mood. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.1",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English grammar and usage when writing (printing, cursive, or keyboarding) or speaking."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That verb voice describes how a verb relates to its subject.",
            "That verbs can be in the active or passive voice.",
            "The subject performs the action of the verb in the active voice.",
            "The subject receives the action expressed by the verb in the passive voice.",
            "That verb mood refers to the manner in which the verb is expressed.",
            "That verbs can be in the indicative, imperative, interrogative, conditional, or subjunctive mood.",
            "That verbs in the indicative mood are used to express a fact or opinion."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That shifts in verb voice and mood can confuse your reader.",
            "How shifting the verb voice from active to passive makes your writing less direct and emphatic.",
            "That a shift in verb voice occurs when a sentence contains both active and passive voice.",
            "How to correct a shift in verb voice by revising the sentence so that the voice is consistent.",
            "That a shift in verb mood occurs when more than one mood is used in the same sentence.",
            "How to correct a shift in verb mood by revising the"
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Recognize and correct inappropriate shifts in verb voice and mood."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.8.2a",
      "description": "Use punctuation (comma, ellipsis, dash) to indicate a pause or break. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge)"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That dashes can be used to add emphasis, set off a new thought, or show a sudden change in thinking in a sentence.",
            "That commas can be used to enclose nonrestrictive and parenthetical elements from the rest of the sentence.",
            "That commas are used to separate items in a series.",
            "A comma is used to separate an introductory element from the rest of the sentence.",
            "A comma is used to set off the words yes and no.",
            "A comma is used to set off a tag question from the rest of the sentence.",
            "A comma is used to indicate direct address."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That some punctuation indicates when a reader should pause.",
            "A comma can be used to indicate a pause or break after introductory words, nouns of direct address, and parenthetical elements.",
            "That ellipsis is three dots within a sentence.",
            "That ellipsis can be used to indicate an unfinished action or a pause in the process of thinking.",
            "A dash can be used to indicate a change in thought."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use a comma or commas to indicate a pause or break.",
            "Use an ellipsis to indicate a pause or break.",
            "Use a dash or dashes to indicate a pause or break."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": []
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.8.2b",
      "description": "Use an ellipsis to indicate an omission. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: ellipsis, omission"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "An ellipsis is three dots within a sentence."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That ellipsis should be used to indicate that information in a direct quotation has been omitted."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use an ellipsis to indicate an omission when writing."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "ellipsis",
        "omission"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Language",
    "reporting_category": "Conventions of Standard English",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.8.2c",
      "description": "Spell correctly. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: Spell, conventions, appropriate, conventions, reference materials"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.2",
      "grade": null,
      "description": "Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to consult reference materials, as needed, to check the spelling of a word."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That effective communication of ideas when writing or speaking relies on the appropriate usage of the conventions of Standard English."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Spell grade level appropriate words correctly."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "Spell",
        "conventions",
        "appropriate",
        "conventions",
        "reference materials"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Language",
    "reporting_category": "Knowledge of Language",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.8.3a",
      "description": "Use verbs in the active and passive voice and in the conditional and subjunctive mood to achieve particular effects (e.g., emphasizing the actor or the action; expressing uncertainty or describing a state contrary to fact). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: verbs, active voice, passive voice, conditional mood, subjunctive mood"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.3",
      "grade": null,
      "description": "Apply knowledge of language to understand how language functions in different contexts, to make effective choices for meaning or style, and to comprehend more fully when reading or listening."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That when a verb is in the active voice, the subject performs the action of the verb,",
            "That when a verb is in the passive voice, the subject receives the action expressed by the verb.",
            "A verb in the conditional mood is used to express uncertainty.",
            "A verb in the subjunctive mood is used to express something contrary to the fact or make a suggestion."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That writers choose a specific voice and a specific mood in which to present their information to achieve certain effects.",
            "The active voice should be used to emphasize the subject performing the action.",
            "The passive voice should be used to emphasize the action.",
            "The conditional mood should be used to express uncertainty.",
            "The subjunctive mood should be used to describe a state contrary to the fact."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use verbs in the active voice to achieve particular effects when writing.",
            "Use verbs in the passive voice to achieve particular effects when writing.",
            "Use verbs in the conditional mood to achieve particular effects.",
            "Use verbs in the subjunctive mood to achieve particular effects."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "verbs",
        "active voice",
        "passive voice",
        "conditional mood",
        "subjunctive mood"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.8.4a",
      "description": "Use context (e.g., the overall meaning of a sentence or paragraph; a word's position or function in a sentence) as a clue to the meaning of a word or phrase. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: context, definition, example, restatement, cause/effect, comparison/contrast, position, function"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown or multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That context clues are words and phrases in the text that give hints to a word's meaning.",
            "That there are several types of context clues readers can look for when trying to figure out unfamiliar text. Many of the types have signal words.",
            "o Definition (is, means, are, or)",
            "o Example (such as, like, for example)",
            "o Restatements (or, that is, in other words, which is)",
            "o Cause/Effect (as a result, because)",
            "o Comparison/Contrast (although, similarly, like, unlike)"
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The overall meaning of a sentence or a paragraph can be used to determine the meaning of a word or phrase.",
            "A word's position and function in a sentence can be used to derive word meaning."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Use the overall context of sentence or paragraph to determine the meaning of an unknown word or phrase.",
            "Use a word's position and function in a sentence to determine the meaning of an unknown word or phrase."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "context",
        "definition",
        "example",
        "restatement",
        "cause/effect",
        "comparison/contrast",
        "position",
        "function"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.8.4b",
      "description": "Use common, grade-appropriate Greek or Latin affixes and roots as clues to the meaning of a word (e.g., precede, recede, secede). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: affix, prefix, suffix, root"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown or multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How adding an affix (prefix or suffix) to a root word forms many English words.",
            "The root of a word is its basic meaning before an affix is added.",
            "A prefix is a word part that can be added to the beginning of a root to change its meaning.",
            "A suffix is a word part that is added to the end of a root to change its meaning."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "The meanings of grade-appropriate Greek or Latin roots in order to use their meanings as a clue to determine the meaning of unknown words.",
            "o Example: cede means \"go, move\"",
            "The meanings of grade-appropriate Greek and Latin affixes in order to use their meanings as a clue to determine unknown words.",
            "o Examples:",
            "pre- means \"before\"",
            "-ion means \"act or process of\""
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Demonstrate knowledge of the meaning of grade-appropriate roots.",
            "Demonstrate knowledge of the meaning of grade-appropriate Greek or Latin prefixes.",
            "Demonstrate knowledge of the meaning of grade-appropriate Greek or Latin suffixes.",
            "Use Greek and Latin affixes and roots to derive word meaning."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "affix",
        "prefix",
        "suffix",
        "root"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.8.4c",
      "description": "Consult general and specialized reference materials (e.g., dictionaries, glossaries, thesauruses), both print and digital, to find the pronunciation of a word or determine or clarify its precise meaning or its part of speech. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: reference materials, dictionary, pronunciation, part of speech, definition, glossary, thesaurus, synonym, antonym"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown or multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That reference materials are print or digital resources that give factual information about a word or topic.",
            "A dictionary lists words in alphabetical order. Each entry contains the word's pronunciation, part of speech, and definition(s).",
            "A glossary is an alphabetical list of words that are used in a book. The glossary also contains the word's pronunciation and part of speech, but the glossary will only provide the definition of the word as it is used in the book.",
            "A thesaurus lists synonyms and antonyms for words."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That words can have more than one definition and can function as more than one part of speech. When reading and writing, consult a reference material to determine or clarify a word's meaning or part of speech."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Consult a dictionary, either print or digital, to confirm the meaning of a word and to find its pronunciation and part of speech.",
            "Consult a glossary of a book, either print or digital, to find a word's pronunciation, part of speech, and to determine the word's meaning in that particular book.",
            "Consult a thesaurus, either print or digital, to find synonyms and antonyms of a word."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "reference materials",
        "dictionary",
        "pronunciation",
        "part of speech",
        "definition",
        "glossary",
        "thesaurus",
        "synonym",
        "antonym"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.8.4d",
      "description": "Verify the preliminary determination of the meaning of a word or phrase (e.g., by checking the inferred meaning in context or in a dictionary). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: verify, preliminary, inferred, context"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.4",
      "grade": null,
      "description": "Determine or clarify the meaning of unknown or multiple-meaning words and phrases by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to determine the meaning of an unknown word using context clues.",
            "How to consult reference materials to determine the meaning of a word."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "How verifying the preliminary determination of the meaning of a word or phrase by checking the inferred meaning in context or in a dictionary ensures that you are using words correctly when writing or speaking.",
            "That effective readers, writers, and speakers use knowledge of language to acquire, clarify, and appropriately use vocabulary."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine the meaning of a word by checking the inferred meaning in context when writing and speaking.",
            "Determine the meaning of a word by checking by checking the inferred meaning in a dictionary when writing and speaking."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "verify",
        "preliminary",
        "inferred",
        "context"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.8.5a",
      "description": "Interpret figures of speech (e.g. verbal irony, puns) in context. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: interpret, figures of speech, figurative language, literal, similes, metaphors, compares, personification, attributes, allusion, associations, verbal irony, puns"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "That figurative language is language that goes beyond the literal meaning of the words.",
            "How to interpret similes, metaphors, personification, and allusions in context.",
            "o A simile compares two things using the words like or as.",
            "o A metaphor compares two things by stating that one thing is other.",
            "o Personification is a figure of speech that gives human attributes to something that is non-human.",
            "o Allusion is a reference to a well-known person, place, event, piece of art, or literary work."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That verbal irony is the use of words that mean something different from what is said or written.",
            "A pun is a play on words where writers often use different word meanings for the purpose of being funny."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Interpret figures of speech in context."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "interpret",
        "figures of speech",
        "figurative language",
        "literal",
        "similes",
        "metaphors",
        "compares",
        "personification",
        "attributes",
        "allusion",
        "associations",
        "verbal irony",
        "puns"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.8.5b",
      "description": "Use the relationship between particular words to better understand each of the words. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: relationship, analogy, analyze"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How words are related to one another helps build vocabulary knowledge.",
            "That synonyms are words that have the same, or nearly the same meaning.",
            "That antonyms are words that have opposite meanings."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "An analogy shows the relationship between two pairs of words.",
            "That it is important to determine the relationship between the first pair of words in an analogy. Then, the student should apply the same relationship to the second pair of words."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Analyze the relationship between particular words.",
            "Use the relationship between particular words to better understand each of the words."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "relationship",
        "analogy",
        "analyze"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.8.5c",
      "description": "Distinguish among the connotations (associations) of words with similar denotations (definitions) (e.g., bullheaded, willful, firm, persistent, resolute). Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: distinguish, connotation, association, denotation, definition, dictionary, positive, negative, neutral"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.5",
      "grade": null,
      "description": "Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to determine the explicit meaning of a word.",
            "How to use word relationships to clarify meaning of a word.",
            "That a word can have different kinds of meanings."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "A word's denotation is its dictionary definition.",
            "A word's connotation is the feeling or association that it suggests.",
            "That connotations can be positive, negative, or neutral."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Determine the connotations of words with similar denotations.",
            "Choose and use specific words for their connotations to achieve an effect or a specific purpose."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "distinguish",
        "connotation",
        "association",
        "denotation",
        "definition",
        "dictionary",
        "positive",
        "negative",
        "neutral"
      ]
    }
  },
  {
    "subject": "English Language Arts",
    "grade": "8",
    "strand": "Language",
    "reporting_category": "Vocabulary Acquisition and Use",
    "standard": {
      "type": "Grade-Specific",
      "id": "L.8.6",
      "description": "Acquire and use accurately grade-appropriate general academic and domain- specific words and phrases; gather vocabulary knowledge when considering a word or phrase important to comprehension or expression. Desired Student Performance A student should know (Prerequisite Knowledge) A student should understand (Conceptual Understanding) A student should be able to do (Evidence of Knowledge) KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD: academic words, domain-specific words, subtle, precise"
    },
    "anchor_standard": {
      "type": "College and Career Readiness Anchor",
      "strand": "Language",
      "reporting_category": null,
      "id": "CCR.L.6",
      "grade": null,
      "description": "Acquire and use accurately a range of general academic and domain-specific words and phrases sufficient for reading, writing, speaking, and listening at the college and career readiness level; demonstrate independence in gathering vocabulary knowledge when considering a word or phrase important to comprehension or expression."
    },
    "student_performance": {
      "categories": {
        "knowledge": {
          "label": "A student should know (Prerequisite Knowledge)",
          "items": [
            "How to identify, understand, and use 6th grade general academic and domain-specific terms.",
            "That certain phrases signal relationships, such as contrast."
          ]
        },
        "understanding": {
          "label": "A student should understand (Conceptual Understanding)",
          "items": [
            "That academic words are words that are used routinely in all types of texts. They often represent subtle or precise ways to say relatively simple things.",
            "That domain-specific words are words that are specific to a course of study.",
            "How to use context clues and their knowledge of language to determine a word's meaning in reading, writing, speaking, or listening."
          ]
        },
        "skills": {
          "label": "A student should be able to do (Evidence of Knowledge)",
          "items": [
            "Provide a statement demonstrating accurate meaning and use of grade-appropriate general academic words and phrases.",
            "Use a range of general academic and grade-specific words and phrases accurately.",
            "Correctly use the general academic and domain specific words that are important to the comprehension of a text."
          ]
        }
      }
    },
    "related_keywords": {
      "label": "KEY LANGUAGE/VERBS/TERMS RELATED TO THE STANDARD",
      "terms": [
        "academic words",
        "domain-specific words",
        "subtle",
        "precise"
      ]
    }
  }
]